Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
          <instance name="FLEXCOM3">
            <register-group address-space="base" name="FLEXCOM3" name-in-module="FLEXCOM" offset="0x4001C000"/>
            <parameters>
              <param name="DMAC_ID_TX" value="6"/>
              <param name="DMAC_ID_RX" value="7"/>
              <param name="INSTANCE_ID" value="14"/>
              <param name="CLOCK_ID" value="14"/>
            </parameters>
            <signals>
              <signal pad="PA20" function="A" group="FLEXCOM3_IO" index="0"/>
              <signal pad="PA19" function="A" group="FLEXCOM3_IO" index="1"/>
              <signal pad="PA23" function="A" group="FLEXCOM3_IO" index="2"/>
              <signal pad="PA24" function="A" group="FLEXCOM3_IO" index="3"/>
              <signal pad="PA21" function="A" group="FLEXCOM3_IO" index="4"/>
              <signal pad="PA22" function="A" group="FLEXCOM3_IO" index="5"/>
              <signal pad="PA12" function="A" group="FLEXCOM3_IO" index="6"/>
            </signals>
          </instance>
          <instance name="FLEXCOM4">
            <register-group address-space="base" name="FLEXCOM4" name-in-module="FLEXCOM" offset="0x40020000"/>
            <parameters>
              <param name="DMAC_ID_TX" value="8"/>
              <param name="DMAC_ID_RX" value="9"/>
              <param name="INSTANCE_ID" value="15"/>
              <param name="CLOCK_ID" value="15"/>
            </parameters>
            <signals>
              <signal pad="PC0" function="A" group="FLEXCOM4_IO" index="0"/>
              <signal pad="PC1" function="A" group="FLEXCOM4_IO" index="1"/>
              <signal pad="PC2" function="A" group="FLEXCOM4_IO" index="2"/>
              <signal pad="PC3" function="A" group="FLEXCOM4_IO" index="3"/>
              <signal pad="PC4" function="A" group="FLEXCOM4_IO" index="4"/>
              <signal pad="PC5" function="A" group="FLEXCOM4_IO" index="5"/>
              <signal pad="PC6" function="A" group="FLEXCOM4_IO" index="6"/>
            </signals>
          </instance>
          <instance name="FLEXCOM5">
            <register-group address-space="base" name="FLEXCOM5" name-in-module="FLEXCOM" offset="0x40024000"/>
            <parameters>
              <param name="DMAC_ID_TX" value="10"/>
              <param name="DMAC_ID_RX" value="11"/>
              <param name="INSTANCE_ID" value="22"/>
              <param name="CLOCK_ID" value="22"/>
            </parameters>
            <signals>
              <signal pad="PC9" function="A" group="FLEXCOM5_IO" index="0"/>
              <signal pad="PC10" function="A" group="FLEXCOM5_IO" index="1"/>
              <signal pad="PA9" function="A" group="FLEXCOM5_IO" index="2"/>
              <signal pad="PA10" function="A" group="FLEXCOM5_IO" index="3"/>
              <signal pad="PA11" function="A" group="FLEXCOM5_IO" index="4"/>
            </signals>
          </instance>
          <instance name="FLEXCOM6">
            <register-group address-space="base" name="FLEXCOM6" name-in-module="FLEXCOM" offset="0x40028000"/>
            <parameters>
              <param name="DMAC_ID_TX" value="12"/>
              <param name="DMAC_ID_RX" value="13"/>
              <param name="INSTANCE_ID" value="23"/>
              <param name="CLOCK_ID" value="23"/>
            </parameters>
            <signals>
              <signal pad="PB6" function="A" group="FLEXCOM6_IO" index="0"/>
              <signal pad="PB7" function="A" group="FLEXCOM6_IO" index="1"/>
            </signals>
          </instance>
          <instance name="FLEXCOM7">
            <register-group address-space="base" name="FLEXCOM7" name-in-module="FLEXCOM" offset="0x4002C000"/>
            <parameters>
              <param name="DMAC_ID_TX" value="14"/>
              <param name="DMAC_ID_RX" value="15"/>
              <param name="INSTANCE_ID" value="24"/>
              <param name="CLOCK_ID" value="24"/>
            </parameters>
            <signals>
              <signal pad="PB4" function="A" group="FLEXCOM7_IO" index="0"/>
              <signal pad="PB5" function="A" group="FLEXCOM7_IO" index="1"/>
            </signals>
          </instance>
          <instance name="FLEXCOM8">
            <register-group address-space="base" name="FLEXCOM8" name-in-module="FLEXCOM" offset="0x40030000"/>
            <parameters>
              <param name="DMAC_ID_TX" value="16"/>
              <param name="DMAC_ID_RX" value="17"/>
              <param name="INSTANCE_ID" value="45"/>
              <param name="CLOCK_ID" value="45"/>
            </parameters>
            <signals>
              <signal pad="PA27" function="A" group="FLEXCOM8_IO" index="0"/>
              <signal pad="PA28" function="A" group="FLEXCOM8_IO" index="1"/>
            </signals>
          </instance>
          <instance name="FLEXCOM9">
            <register-group address-space="base" name="FLEXCOM9" name-in-module="FLEXCOM" offset="0x40034000"/>
            <parameters>
              <param name="DMAC_ID_TX" value="18"/>
              <param name="DMAC_ID_RX" value="19"/>
              <param name="INSTANCE_ID" value="46"/>
              <param name="CLOCK_ID" value="46"/>
            </parameters>
            <signals>
              <signal pad="PA25" function="A" group="FLEXCOM9_IO" index="0"/>
              <signal pad="PA26" function="A" group="FLEXCOM9_IO" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="FLEXRAMECC" id="44124" version="A">
          <instance name="FLEXRAMECC">
            <register-group address-space="base" name="FLEXRAMECC" name-in-module="FLEXRAMECC" offset="0x40100600"/>
          </instance>
        </module>
        <module name="GMAC" id="11046" version="T">
          <instance name="GMAC">
            <register-group address-space="base" name="GMAC" name-in-module="GMAC" offset="0x4009C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="69"/>
              <param name="CLOCK_ID" value="69"/>
            </parameters>
            <signals>
              <signal pad="PC26" function="B" group="GCOL"/>
              <signal pad="PC27" function="B" group="GCRS"/>
              <signal pad="PC20" function="B" group="GMDC"/>
              <signal pad="PC19" function="B" group="GMDIO"/>
              <signal pad="PC28" function="B" group="GRXCK"/>
              <signal pad="PC16" function="B" group="GRXDV"/>
              <signal pad="PC15" function="B" group="GRXER"/>
              <signal pad="PC12" function="B" group="GRX" index="0"/>
              <signal pad="PC11" function="B" group="GRX" index="1"/>
              <signal pad="PC30" function="B" group="GRX" index="2"/>
              <signal pad="PC29" function="B" group="GRX" index="3"/>
              <signal pad="PC31" function="B" group="GTSUCOMP"/>
              <signal pad="PC18" function="B" group="GTXCK"/>
              <signal pad="PC17" function="B" group="GTXEN"/>
              <signal pad="PC23" function="B" group="GTXER"/>
              <signal pad="PC14" function="B" group="GTX" index="0"/>
              <signal pad="PC13" function="B" group="GTX" index="1"/>
              <signal pad="PC24" function="B" group="GTX" index="2"/>
              <signal pad="PC25" function="B" group="GTX" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="HEFC" id="44123" version="A">
          <instance name="HEFC">
            <register-group address-space="base" name="HEFC" name-in-module="HEFC" offset="0x40004000"/>
            <parameters>
              <param name="FLASH_SIZE" value="131072"/>
              <param name="PAGE_SIZE" value="256"/>
              <param name="INSTANCE_ID" value="50"/>
              <param name="CLOCK_ID" value="50"/>
              <param name="PAGES_PR_REGION" value="512"/>
            </parameters>
          </instance>
        </module>
        <module name="HEMC" id="44121" version="A">
          <instance name="HEMC">
            <register-group address-space="base" name="HEMC" name-in-module="HEMC" offset="0x40080000"/>
            <signals>
              <signal pad="PG0" function="A" group="A" index="0"/>
              <signal pad="PG1" function="A" group="A" index="1"/>
              <signal pad="PG2" function="A" group="A" index="2"/>
              <signal pad="PG3" function="A" group="A" index="3"/>
              <signal pad="PG4" function="A" group="A" index="4"/>
              <signal pad="PG5" function="A" group="A" index="5"/>
              <signal pad="PG6" function="A" group="A" index="6"/>
              <signal pad="PG7" function="A" group="A" index="7"/>
              <signal pad="PG8" function="A" group="A" index="8"/>
              <signal pad="PG9" function="A" group="A" index="9"/>
              <signal pad="PG10" function="A" group="A" index="10"/>
              <signal pad="PG11" function="A" group="A" index="11"/>
              <signal pad="PG12" function="A" group="A" index="12"/>
              <signal pad="PG13" function="A" group="A" index="13"/>
              <signal pad="PG14" function="A" group="A" index="14"/>
              <signal pad="PG15" function="A" group="A" index="15"/>
              <signal pad="PG15" function="A" group="BA" index="0"/>
              <signal pad="PG16" function="A" group="A" index="16"/>
              <signal pad="PG16" function="A" group="BA" index="1"/>
              <signal pad="PG17" function="A" group="A" index="17"/>
              <signal pad="PG18" function="A" group="A" index="18"/>
              <signal pad="PG19" function="A" group="A" index="19"/>
              <signal pad="PG20" function="A" group="A" index="20"/>
              <signal pad="PG21" function="A" group="A" index="21"/>
              <signal pad="PG22" function="A" group="A" index="22"/>
              <signal pad="PG23" function="A" group="A" index="23"/>
              <signal pad="PG24" function="A" group="A" index="24"/>
              <signal pad="PG25" function="A" group="A" index="25"/>
              <signal pad="PG26" function="A" group="A" index="26"/>
              <signal pad="PG27" function="A" group="A" index="27"/>
              <signal pad="PF24" function="X1" group="BOOT_MODE"/>
              <signal pad="PF10" function="A" group="CAS"/>
              <signal pad="PE0" function="A" group="CB" index="0"/>
              <signal pad="PE1" function="A" group="CB" index="1"/>
              <signal pad="PE2" function="A" group="CB" index="2"/>
              <signal pad="PE3" function="A" group="CB" index="3"/>
              <signal pad="PE4" function="A" group="CB" index="4"/>
              <signal pad="PE5" function="A" group="CB" index="5"/>
              <signal pad="PE6" function="A" group="CB" index="6"/>
              <signal pad="PE7" function="A" group="CB" index="7"/>
              <signal pad="PE8" function="A" group="CB" index="8"/>
              <signal pad="PE9" function="A" group="CB" index="9"/>
              <signal pad="PE10" function="A" group="CB" index="10"/>
              <signal pad="PE11" function="A" group="CB" index="11"/>
              <signal pad="PE12" function="A" group="CB" index="12"/>
              <signal pad="PC31" function="A" group="CB" index="13"/>
              <signal pad="PC30" function="A" group="CB" index="14"/>
              <signal pad="PC29" function="A" group="CB" index="15"/>
              <signal pad="PG24" function="X1" group="CFG" index="0"/>
              <signal pad="PG25" function="X1" group="CFG" index="1"/>
              <signal pad="PG26" function="X1" group="CFG" index="2"/>
              <signal pad="PG27" function="X1" group="CFG" index="3"/>
              <signal pad="PD0" function="A" group="D" index="0"/>
              <signal pad="PD1" function="A" group="D" index="1"/>
              <signal pad="PD2" function="A" group="D" index="2"/>
              <signal pad="PD3" function="A" group="D" index="3"/>
              <signal pad="PD4" function="A" group="D" index="4"/>
              <signal pad="PD5" function="A" group="D" index="5"/>
              <signal pad="PD6" function="A" group="D" index="6"/>
              <signal pad="PD7" function="A" group="D" index="7"/>
              <signal pad="PD8" function="A" group="D" index="8"/>
              <signal pad="PD9" function="A" group="D" index="9"/>
              <signal pad="PD10" function="A" group="D" index="10"/>
              <signal pad="PD11" function="A" group="D" index="11"/>
              <signal pad="PD12" function="A" group="D" index="12"/>
              <signal pad="PD13" function="A" group="D" index="13"/>
              <signal pad="PD14" function="A" group="D" index="14"/>
              <signal pad="PD15" function="A" group="D" index="15"/>
              <signal pad="PD16" function="A" group="D" index="16"/>
              <signal pad="PD17" function="A" group="D" index="17"/>
              <signal pad="PD18" function="A" group="D" index="18"/>
              <signal pad="PD19" function="A" group="D" index="19"/>
              <signal pad="PD20" function="A" group="D" index="20"/>
              <signal pad="PD21" function="A" group="D" index="21"/>
              <signal pad="PD22" function="A" group="D" index="22"/>
              <signal pad="PD23" function="A" group="D" index="23"/>
              <signal pad="PD24" function="A" group="D" index="24"/>
              <signal pad="PD25" function="A" group="D" index="25"/>
              <signal pad="PD26" function="A" group="D" index="26"/>
              <signal pad="PD27" function="A" group="D" index="27"/>
              <signal pad="PD28" function="A" group="D" index="28"/>
              <signal pad="PD29" function="A" group="D" index="29"/>
              <signal pad="PD30" function="A" group="D" index="30"/>
              <signal pad="PD31" function="A" group="D" index="31"/>
              <signal pad="PF25" function="A" group="EXT_CTRL_BUFFER"/>
              <signal pad="PF11" function="A" group="NCS" index="0"/>
              <signal pad="PF12" function="A" group="NCS" index="1"/>
              <signal pad="PF13" function="A" group="NCS" index="2"/>
              <signal pad="PF14" function="A" group="NCS" index="3"/>
              <signal pad="PF15" function="A" group="NCS" index="4"/>
              <signal pad="PF16" function="A" group="NCS" index="5"/>
              <signal pad="PF17" function="A" group="NRD"/>
              <signal pad="PF24" function="A" group="NWAIT"/>
              <signal pad="PF18" function="A" group="NWE"/>
              <signal pad="PF19" function="A" group="NWR" index="0"/>
              <signal pad="PF20" function="A" group="NWR" index="1"/>
              <signal pad="PF21" function="A" group="NWR" index="2"/>
              <signal pad="PF22" function="A" group="NWR" index="3"/>
              <signal pad="PF23" function="A" group="NWR" index="4"/>
              <signal pad="PF0" function="A" group="RAS"/>
              <signal pad="PF1" function="A" group="SDA" index="10"/>
              <signal pad="PF2" function="A" group="SDCK"/>
              <signal pad="PF3" function="A" group="SDCKE"/>
              <signal pad="PF4" function="A" group="SDNBS" index="0"/>
              <signal pad="PF5" function="A" group="SDNBS" index="1"/>
              <signal pad="PF6" function="A" group="SDNBS" index="2"/>
              <signal pad="PF7" function="A" group="SDNBS" index="3"/>
              <signal pad="PF8" function="A" group="SDNBS" index="4"/>
              <signal pad="PF9" function="A" group="SDWE"/>
            </signals>
            <parameters>
              <param name="CLOCK_ID" value="59"/>
            </parameters>
          </instance>
        </module>
        <module name="HSDRAMC" id="44129" version="A">
          <instance name="HSDRAMC">
            <register-group address-space="base" name="HSDRAMC" name-in-module="HSDRAMC" offset="0x40082000"/>
