Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
          </instance>
        </module>
        <module name="HSMC" id="44128" version="A">
          <instance name="HSMC">
            <register-group address-space="base" name="HSMC" name-in-module="HSMC" offset="0x40081000"/>
          </instance>
        </module>
        <module name="ICM" id="11105" version="I">
          <instance name="ICM">
            <register-group address-space="base" name="ICM" name-in-module="ICM" offset="0x4008C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="33"/>
              <param name="CLOCK_ID" value="33"/>
            </parameters>
          </instance>
        </module>
        <module name="IP1553" id="44127" version="A">
          <instance name="IP1553">
            <register-group address-space="base" name="IP1553" name-in-module="IP1553" offset="0x4003C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="68"/>
              <param name="CLOCK_ID" value="68"/>
            </parameters>
          </instance>
        </module>
        <module name="MATRIX" id="44138" version="A">
          <instance name="MATRIX0">
            <register-group address-space="base" name="MATRIX0" name-in-module="MATRIX" offset="0x40000000"/>
            <parameters>
              <param name="INSTANCE_ID" value="6"/>
            </parameters>
          </instance>
        </module>
        <module name="MCAN" id="11273" version="P">
          <instance name="MCAN0">
            <register-group address-space="base" name="MCAN0" name-in-module="MCAN" offset="0x40058000"/>
            <parameters>
              <param name="INSTANCE_ID" value="36"/>
              <param name="CLOCK_ID" value="36"/>
              <param name="ID_MCAN0_INT0" value="36"/>
              <param name="ID_MCAN0_INT1" value="37"/>
            </parameters>
            <signals>
              <signal pad="PB7" function="C" group="CANRX" index="0"/>
              <signal pad="PE8" function="C" group="CANRX" index="0"/>
              <signal pad="PB6" function="C" group="CANTX" index="0"/>
              <signal pad="PE9" function="C" group="CANTX" index="0"/>
            </signals>
          </instance>
          <instance name="MCAN1">
            <register-group address-space="base" name="MCAN1" name-in-module="MCAN" offset="0x4005C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="38"/>
              <param name="CLOCK_ID" value="38"/>
              <param name="ID_MCAN1_INT0" value="38"/>
              <param name="ID_MCAN1_INT1" value="39"/>
            </parameters>
            <signals>
              <signal pad="PB5" function="C" group="CANRX" index="1"/>
              <signal pad="PE10" function="C" group="CANRX" index="1"/>
              <signal pad="PB4" function="C" group="CANTX" index="1"/>
              <signal pad="PE11" function="C" group="CANTX" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="NMIC" id="44062" version="A">
          <instance name="NMIC">
            <register-group address-space="base" name="NMIC" name-in-module="NMIC" offset="0x400A8000"/>
            <parameters>
              <param name="INSTANCE_ID" value="9"/>
              <param name="CLOCK_ID" value="9"/>
              <param name="NUM_NMIC_SOURCE" value="9"/>
              <param name="NMIC_SOURCE_NMI" value="0" caption="External Pin NMI"/>
              <param name="NMIC_SOURCE_CPU_FAIL" value="1" caption="Wrong CPU Frequency Monitor Detection"/>
              <param name="NMIC_SOURCE_XTAL_12M_FAIL" value="2" caption="Fast XTAL Clock Failure Detection"/>
              <param name="NMIC_SOURCE_XTAL_32K_FAIL" value="3" caption="Slow XTAL 32KHZ Clock Failure Detection"/>
              <param name="NMIC_SOURCE_VDDCORE_FAIL" value="4" caption="VDDCORE Failure Detection"/>
              <param name="NMIC_SOURCE_NOFIX_TCM" value="5" caption="TCM non fixable error Detection"/>
              <param name="NMIC_SOURCE_NOFIX_HEMC" value="6" caption="HEMC non fixable error detection"/>
              <param name="NMIC_SOURCE_NOFIX_HEFC" value="7" caption="HEFC non fixable error detection"/>
              <param name="NMIC_SOURCE_NOFIX_FlexRAM" value="8" caption="FlexRam non fixable error detection"/>
            </parameters>
          </instance>
        </module>
        <module name="PIO" id="11264" version="K">
          <instance name="PIO">
            <register-group address-space="base" name="PIO" name-in-module="PIO" offset="0x40008000"/>
            <parameters>
              <param name="CLOCK_ID" value="10"/>
              <param name="DEBOUNCE_GLITCH_ACTIVE" value="1"/>
            </parameters>
            <signals>
              <signal group="P" index="0" function="default" pad="PA0"/>
              <signal group="P" index="1" function="default" pad="PA1"/>
              <signal group="P" index="2" function="default" pad="PA2"/>
              <signal group="P" index="3" function="default" pad="PA3"/>
              <signal group="P" index="4" function="default" pad="PA4"/>
              <signal group="P" index="5" function="default" pad="PA5"/>
              <signal group="P" index="6" function="default" pad="PA6"/>
              <signal group="P" index="7" function="default" pad="PA7"/>
              <signal group="P" index="8" function="default" pad="PA8"/>
              <signal group="P" index="9" function="default" pad="PA9"/>
              <signal group="P" index="10" function="default" pad="PA10"/>
              <signal group="P" index="11" function="default" pad="PA11"/>
              <signal group="P" index="12" function="default" pad="PA12"/>
              <signal group="P" index="13" function="default" pad="PA13"/>
              <signal group="P" index="16" function="default" pad="PA16"/>
              <signal group="P" index="17" function="default" pad="PA17"/>
              <signal group="P" index="19" function="default" pad="PA19"/>
              <signal group="P" index="20" function="default" pad="PA20"/>
              <signal group="P" index="21" function="default" pad="PA21"/>
              <signal group="P" index="22" function="default" pad="PA22"/>
              <signal group="P" index="23" function="default" pad="PA23"/>
              <signal group="P" index="24" function="default" pad="PA24"/>
              <signal group="P" index="25" function="default" pad="PA25"/>
              <signal group="P" index="26" function="default" pad="PA26"/>
              <signal group="P" index="27" function="default" pad="PA27"/>
              <signal group="P" index="28" function="default" pad="PA28"/>
              <signal group="P" index="32" function="default" pad="PB0"/>
              <signal group="P" index="33" function="default" pad="PB1"/>
              <signal group="P" index="34" function="default" pad="PB2"/>
              <signal group="P" index="35" function="default" pad="PB3"/>
              <signal group="P" index="36" function="default" pad="PB4"/>
              <signal group="P" index="37" function="default" pad="PB5"/>
              <signal group="P" index="38" function="default" pad="PB6"/>
              <signal group="P" index="39" function="default" pad="PB7"/>
              <signal group="P" index="40" function="default" pad="PB8"/>
              <signal group="P" index="41" function="default" pad="PB9"/>
              <signal group="P" index="42" function="default" pad="PB10"/>
              <signal group="P" index="43" function="default" pad="PB11"/>
              <signal group="P" index="44" function="default" pad="PB12"/>
              <signal group="P" index="45" function="default" pad="PB13"/>
              <signal group="P" index="46" function="default" pad="PB14"/>
              <signal group="P" index="47" function="default" pad="PB15"/>
              <signal group="P" index="48" function="default" pad="PB16"/>
              <signal group="P" index="49" function="default" pad="PB17"/>
              <signal group="P" index="50" function="default" pad="PB18"/>
              <signal group="P" index="51" function="default" pad="PB19"/>
              <signal group="P" index="52" function="default" pad="PB20"/>
              <signal group="P" index="53" function="default" pad="PB21"/>
              <signal group="P" index="54" function="default" pad="PB22"/>
              <signal group="P" index="55" function="default" pad="PB23"/>
              <signal group="P" index="56" function="default" pad="PB24"/>
              <signal group="P" index="57" function="default" pad="PB25"/>
              <signal group="P" index="58" function="default" pad="PB26"/>
              <signal group="P" index="59" function="default" pad="PB27"/>
              <signal group="P" index="60" function="default" pad="PB28"/>
              <signal group="P" index="61" function="default" pad="PB29"/>
              <signal group="P" index="64" function="default" pad="PC0"/>
              <signal group="P" index="65" function="default" pad="PC1"/>
              <signal group="P" index="66" function="default" pad="PC2"/>
              <signal group="P" index="67" function="default" pad="PC3"/>
              <signal group="P" index="68" function="default" pad="PC4"/>
              <signal group="P" index="69" function="default" pad="PC5"/>
              <signal group="P" index="70" function="default" pad="PC6"/>
              <signal group="P" index="71" function="default" pad="PC7"/>
              <signal group="P" index="72" function="default" pad="PC8"/>
              <signal group="P" index="73" function="default" pad="PC9"/>
              <signal group="P" index="74" function="default" pad="PC10"/>
              <signal group="P" index="75" function="default" pad="PC11"/>
              <signal group="P" index="76" function="default" pad="PC12"/>
              <signal group="P" index="77" function="default" pad="PC13"/>
              <signal group="P" index="78" function="default" pad="PC14"/>
              <signal group="P" index="79" function="default" pad="PC15"/>
              <signal group="P" index="80" function="default" pad="PC16"/>
              <signal group="P" index="81" function="default" pad="PC17"/>
              <signal group="P" index="82" function="default" pad="PC18"/>
              <signal group="P" index="83" function="default" pad="PC19"/>
              <signal group="P" index="84" function="default" pad="PC20"/>
              <signal group="P" index="85" function="default" pad="PC21"/>
              <signal group="P" index="86" function="default" pad="PC22"/>
              <signal group="P" index="87" function="default" pad="PC23"/>
              <signal group="P" index="88" function="default" pad="PC24"/>
              <signal group="P" index="89" function="default" pad="PC25"/>
              <signal group="P" index="90" function="default" pad="PC26"/>
              <signal group="P" index="91" function="default" pad="PC27"/>
              <signal group="P" index="92" function="default" pad="PC28"/>
              <signal group="P" index="93" function="default" pad="PC29"/>
              <signal group="P" index="94" function="default" pad="PC30"/>
              <signal group="P" index="95" function="default" pad="PC31"/>
              <signal group="P" index="96" function="default" pad="PD0"/>
              <signal group="P" index="97" function="default" pad="PD1"/>
              <signal group="P" index="98" function="default" pad="PD2"/>
              <signal group="P" index="99" function="default" pad="PD3"/>
              <signal group="P" index="100" function="default" pad="PD4"/>
              <signal group="P" index="101" function="default" pad="PD5"/>
              <signal group="P" index="102" function="default" pad="PD6"/>
              <signal group="P" index="103" function="default" pad="PD7"/>
              <signal group="P" index="104" function="default" pad="PD8"/>
              <signal group="P" index="105" function="default" pad="PD9"/>
              <signal group="P" index="106" function="default" pad="PD10"/>
              <signal group="P" index="107" function="default" pad="PD11"/>
              <signal group="P" index="108" function="default" pad="PD12"/>
              <signal group="P" index="109" function="default" pad="PD13"/>
              <signal group="P" index="110" function="default" pad="PD14"/>
              <signal group="P" index="111" function="default" pad="PD15"/>
              <signal group="P" index="112" function="default" pad="PD16"/>
              <signal group="P" index="113" function="default" pad="PD17"/>
              <signal group="P" index="114" function="default" pad="PD18"/>
              <signal group="P" index="115" function="default" pad="PD19"/>
              <signal group="P" index="116" function="default" pad="PD20"/>
              <signal group="P" index="117" function="default" pad="PD21"/>
              <signal group="P" index="118" function="default" pad="PD22"/>
              <signal group="P" index="119" function="default" pad="PD23"/>
              <signal group="P" index="120" function="default" pad="PD24"/>
              <signal group="P" index="121" function="default" pad="PD25"/>
              <signal group="P" index="122" function="default" pad="PD26"/>
              <signal group="P" index="123" function="default" pad="PD27"/>
              <signal group="P" index="124" function="default" pad="PD28"/>
              <signal group="P" index="125" function="default" pad="PD29"/>
              <signal group="P" index="126" function="default" pad="PD30"/>
              <signal group="P" index="127" function="default" pad="PD31"/>
              <signal group="P" index="128" function="default" pad="PE0"/>
              <signal group="P" index="129" function="default" pad="PE1"/>
              <signal group="P" index="130" function="default" pad="PE2"/>
              <signal group="P" index="131" function="default" pad="PE3"/>
              <signal group="P" index="132" function="default" pad="PE4"/>
              <signal group="P" index="133" function="default" pad="PE5"/>
              <signal group="P" index="134" function="default" pad="PE6"/>
              <signal group="P" index="135" function="default" pad="PE7"/>
              <signal group="P" index="136" function="default" pad="PE8"/>
              <signal group="P" index="137" function="default" pad="PE9"/>
              <signal group="P" index="138" function="default" pad="PE10"/>
              <signal group="P" index="139" function="default" pad="PE11"/>
              <signal group="P" index="140" function="default" pad="PE12"/>
              <signal group="P" index="160" function="default" pad="PF0"/>
              <signal group="P" index="161" function="default" pad="PF1"/>
              <signal group="P" index="162" function="default" pad="PF2"/>
              <signal group="P" index="163" function="default" pad="PF3"/>
              <signal group="P" index="164" function="default" pad="PF4"/>
              <signal group="P" index="165" function="default" pad="PF5"/>
              <signal group="P" index="166" function="default" pad="PF6"/>
              <signal group="P" index="167" function="default" pad="PF7"/>
              <signal group="P" index="168" function="default" pad="PF8"/>
              <signal group="P" index="169" function="default" pad="PF9"/>
              <signal group="P" index="170" function="default" pad="PF10"/>
              <signal group="P" index="171" function="default" pad="PF11"/>
              <signal group="P" index="172" function="default" pad="PF12"/>
              <signal group="P" index="173" function="default" pad="PF13"/>
              <signal group="P" index="174" function="default" pad="PF14"/>
              <signal group="P" index="175" function="default" pad="PF15"/>
              <signal group="P" index="176" function="default" pad="PF16"/>
              <signal group="P" index="177" function="default" pad="PF17"/>
              <signal group="P" index="178" function="default" pad="PF18"/>
              <signal group="P" index="179" function="default" pad="PF19"/>
              <signal group="P" index="180" function="default" pad="PF20"/>
              <signal group="P" index="181" function="default" pad="PF21"/>
              <signal group="P" index="182" function="default" pad="PF22"/>
              <signal group="P" index="183" function="default" pad="PF23"/>
              <signal group="P" index="184" function="default" pad="PF24"/>
              <signal group="P" index="185" function="default" pad="PF25"/>
              <signal group="P" index="186" function="default" pad="PF26"/>
              <signal group="P" index="187" function="default" pad="PF27"/>
              <signal group="P" index="188" function="default" pad="PF28"/>
              <signal group="P" index="189" function="default" pad="PF29"/>
              <signal group="P" index="190" function="default" pad="PF30"/>
              <signal group="P" index="192" function="default" pad="PG0"/>
              <signal group="P" index="193" function="default" pad="PG1"/>
              <signal group="P" index="194" function="default" pad="PG2"/>
              <signal group="P" index="195" function="default" pad="PG3"/>
              <signal group="P" index="196" function="default" pad="PG4"/>
              <signal group="P" index="197" function="default" pad="PG5"/>
              <signal group="P" index="198" function="default" pad="PG6"/>
              <signal group="P" index="199" function="default" pad="PG7"/>
              <signal group="P" index="200" function="default" pad="PG8"/>
              <signal group="P" index="201" function="default" pad="PG9"/>
              <signal group="P" index="202" function="default" pad="PG10"/>
              <signal group="P" index="203" function="default" pad="PG11"/>
              <signal group="P" index="204" function="default" pad="PG12"/>
              <signal group="P" index="205" function="default" pad="PG13"/>
              <signal group="P" index="206" function="default" pad="PG14"/>
              <signal group="P" index="207" function="default" pad="PG15"/>
              <signal group="P" index="208" function="default" pad="PG16"/>
              <signal group="P" index="209" function="default" pad="PG17"/>
              <signal group="P" index="210" function="default" pad="PG18"/>
              <signal group="P" index="211" function="default" pad="PG19"/>
              <signal group="P" index="212" function="default" pad="PG20"/>
              <signal group="P" index="213" function="default" pad="PG21"/>
              <signal group="P" index="214" function="default" pad="PG22"/>
              <signal group="P" index="215" function="default" pad="PG23"/>
              <signal group="P" index="216" function="default" pad="PG24"/>
              <signal group="P" index="217" function="default" pad="PG25"/>
              <signal group="P" index="218" function="default" pad="PG26"/>
              <signal group="P" index="219" function="default" pad="PG27"/>
              <signal group="P" index="222" function="default" pad="PG30"/>
              <signal group="P" index="223" function="default" pad="PG31"/>
            </signals>
          </instance>
          <instance name="PIOA">
            <parameters>
              <param name="INSTANCE_ID" value="10"/>
            </parameters>
          </instance>
          <instance name="PIOB">
            <parameters>
              <param name="INSTANCE_ID" value="11"/>
            </parameters>
          </instance>
