Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
          <instance name="PIOC">
            <parameters>
              <param name="INSTANCE_ID" value="12"/>
            </parameters>
          </instance>
          <instance name="PIOD">
            <parameters>
              <param name="INSTANCE_ID" value="16"/>
            </parameters>
          </instance>
          <instance name="PIOE">
            <parameters>
              <param name="INSTANCE_ID" value="17"/>
            </parameters>
          </instance>
          <instance name="PIOF">
            <parameters>
              <param name="INSTANCE_ID" value="34"/>
            </parameters>
          </instance>
          <instance name="PIOG">
            <parameters>
              <param name="INSTANCE_ID" value="35"/>
            </parameters>
          </instance>
        </module>
        <module name="PMC" id="44113" version="A">
          <instance name="PMC">
            <register-group address-space="base" name="PMC" name-in-module="PMC" offset="0x4000C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="5"/>
            </parameters>
            <signals>
              <signal pad="PA11" function="B" group="PCK" index="0"/>
              <signal pad="PC7" function="A" group="PCK" index="0"/>
              <signal pad="PC8" function="A" group="PCK" index="1"/>
              <signal pad="PE12" function="B" group="PCK" index="1"/>
              <signal pad="PA10" function="B" group="PCK" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="PWM" id="6343" version="ZB">
          <instance name="PWM0">
            <register-group address-space="base" name="PWM0" name-in-module="PWM" offset="0x40068000"/>
            <parameters>
              <param name="DMAC_ID_TX" value="22"/>
              <param name="INSTANCE_ID" value="31"/>
              <param name="CLOCK_ID" value="31"/>
              <param name="FAULT_PWM_ID0" value="0x0" caption="Fault 0 - PWM0_PWMFI0 Input pin"/>
              <param name="FAULT_PWM_ID1" value="0x1" caption="Fault 1 - PWM0_PWMFI1 Input pin"/>
              <param name="FAULT_PWM_ID2" value="0x2" caption="Fault 2 - PWM0_PWMFI2 Input pin"/>
              <param name="FAULT_PWM_ID3" value="0x3" caption="Fault 3 - MAIN_OSC_PMC"/>
              <param name="FAULT_PWM_ID6" value="0x6" caption="Fault 6 - TC0"/>
            </parameters>
            <signals>
              <signal pad="PA10" function="C" group="PWMC0_PWMEXTRG" index="0"/>
              <signal pad="PA11" function="C" group="PWMC0_PWMEXTRG" index="1"/>
              <signal pad="PA8" function="C" group="PWMC0_PWMFI" index="0"/>
              <signal pad="PA9" function="C" group="PWMC0_PWMFI" index="1"/>
              <signal pad="PA12" function="C" group="PWMC0_PWMFI" index="2"/>
              <signal pad="PA0" function="C" group="PWMC0_PWMH" index="0"/>
              <signal pad="PA1" function="C" group="PWMC0_PWMH" index="1"/>
              <signal pad="PA2" function="C" group="PWMC0_PWMH" index="2"/>
              <signal pad="PA3" function="C" group="PWMC0_PWMH" index="3"/>
              <signal pad="PA4" function="C" group="PWMC0_PWML" index="0"/>
              <signal pad="PA5" function="C" group="PWMC0_PWML" index="1"/>
              <signal pad="PA6" function="C" group="PWMC0_PWML" index="2"/>
              <signal pad="PA7" function="C" group="PWMC0_PWML" index="3"/>
            </signals>
          </instance>
          <instance name="PWM1">
            <register-group address-space="base" name="PWM1" name-in-module="PWM" offset="0x4006C000"/>
            <parameters>
              <param name="DMAC_ID_TX" value="23"/>
              <param name="INSTANCE_ID" value="32"/>
              <param name="CLOCK_ID" value="32"/>
              <param name="FAULT_PWM_ID0" value="0x0" caption="Fault 0 - PWM1_PWMFI0 Input pin"/>
              <param name="FAULT_PWM_ID1" value="0x1" caption="Fault 1 - PWM1_PWMFI1 Input pin"/>
              <param name="FAULT_PWM_ID2" value="0x2" caption="Fault 2 - PWM1_PWMFI2 Input pin"/>
              <param name="FAULT_PWM_ID3" value="0x3" caption="Fault 3 - MAIN_OSC_PMC"/>
              <param name="FAULT_PWM_ID6" value="0x6" caption="Fault 6 - TC0"/>
            </parameters>
            <signals>
              <signal pad="PB17" function="A" group="PWMC1_PWMEXTRG" index="0"/>
              <signal pad="PB18" function="A" group="PWMC1_PWMEXTRG" index="1"/>
              <signal pad="PB27" function="A" group="PWMC1_PWMFI" index="0"/>
              <signal pad="PB28" function="A" group="PWMC1_PWMFI" index="1"/>
              <signal pad="PB29" function="A" group="PWMC1_PWMFI" index="2"/>
              <signal pad="PB19" function="A" group="PWMC1_PWMH" index="0"/>
              <signal pad="PB20" function="A" group="PWMC1_PWMH" index="1"/>
              <signal pad="PB21" function="A" group="PWMC1_PWMH" index="2"/>
              <signal pad="PB22" function="A" group="PWMC1_PWMH" index="3"/>
              <signal pad="PB23" function="A" group="PWMC1_PWML" index="0"/>
              <signal pad="PB24" function="A" group="PWMC1_PWML" index="1"/>
              <signal pad="PB25" function="A" group="PWMC1_PWML" index="2"/>
              <signal pad="PB26" function="A" group="PWMC1_PWML" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="QSPI" id="11171" version="N">
          <instance name="QSPI">
            <register-group address-space="base" name="QSPI" name-in-module="QSPI" offset="0x40038000"/>
            <parameters>
              <param name="DMAC_ID_TX" value="20"/>
              <param name="DMAC_ID_RX" value="21"/>
              <param name="INSTANCE_ID" value="49"/>
              <param name="CLOCK_ID" value="49"/>
            </parameters>
            <signals>
              <signal pad="PA22" function="C" group="QCS"/>
              <signal pad="PA24" function="C" group="QIO" index="0"/>
              <signal pad="PA23" function="C" group="QIO" index="1"/>
              <signal pad="PA20" function="C" group="QIO" index="2"/>
              <signal pad="PA19" function="C" group="QIO" index="3"/>
              <signal pad="PA21" function="C" group="QSCK"/>
            </signals>
          </instance>
        </module>
        <module name="RSTC" id="11009" version="N">
          <instance name="RSTC">
            <register-group address-space="base" name="RSTC" name-in-module="RSTC" offset="0x40100200"/>
            <parameters>
              <param name="INSTANCE_ID" value="1"/>
            </parameters>
          </instance>
        </module>
