Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
        <register caption="USART Receive Holding Register" name="FLEX_US_RHR" offset="0x218" rw="R" size="4">
          <mode name="DEFAULT"/>
          <mode name="FIFO_MULTI_DATA"/>
          <bitfield caption="Received Character" mask="0x000001FF" modes="DEFAULT" name="RXCHR"/>
          <bitfield caption="Received Sync" mask="0x00008000" modes="DEFAULT" name="RXSYNH"/>
          <bitfield caption="Received Character" mask="0x000000FF" modes="FIFO_MULTI_DATA" name="RXCHR0"/>
          <bitfield caption="Received Character" mask="0x0000FF00" modes="FIFO_MULTI_DATA" name="RXCHR1"/>
          <bitfield caption="Received Character" mask="0x00FF0000" modes="FIFO_MULTI_DATA" name="RXCHR2"/>
          <bitfield caption="Received Character" mask="0xFF000000" modes="FIFO_MULTI_DATA" name="RXCHR3"/>
        </register>
        <register caption="USART Transmit Holding Register" name="FLEX_US_THR" offset="0x21C" rw="W" size="4">
          <mode name="DEFAULT"/>
          <mode name="FIFO_MULTI_DATA"/>
          <bitfield caption="Character to be Transmitted" mask="0x000001FF" modes="DEFAULT" name="TXCHR"/>
          <bitfield caption="Sync Field to be Transmitted" mask="0x00008000" modes="DEFAULT" name="TXSYNH"/>
          <bitfield caption="Character to be Transmitted" mask="0x000000FF" modes="FIFO_MULTI_DATA" name="TXCHR0"/>
          <bitfield caption="Character to be Transmitted" mask="0x0000FF00" modes="FIFO_MULTI_DATA" name="TXCHR1"/>
          <bitfield caption="Character to be Transmitted" mask="0x00FF0000" modes="FIFO_MULTI_DATA" name="TXCHR2"/>
          <bitfield caption="Character to be Transmitted" mask="0xFF000000" modes="FIFO_MULTI_DATA" name="TXCHR3"/>
        </register>
        <register caption="USART Baud Rate Generator Register" name="FLEX_US_BRGR" offset="0x220" rw="RW" size="4">
          <bitfield caption="Clock Divider" mask="0x0000FFFF" name="CD"/>
          <bitfield caption="Fractional Part" mask="0x00070000" name="FP"/>
        </register>
        <register caption="USART Receiver Timeout Register" name="FLEX_US_RTOR" offset="0x224" rw="RW" size="4">
          <bitfield caption="Timeout Value" mask="0x0001FFFF" name="TO"/>
        </register>
        <register caption="USART Transmitter Timeguard Register" name="FLEX_US_TTGR" offset="0x228" rw="RW" size="4">
          <bitfield caption="Timeguard Value" mask="0x000000FF" name="TG"/>
        </register>
        <register caption="USART FI DI Ratio Register" name="FLEX_US_FIDI" offset="0x240" rw="RW" size="4">
          <bitfield caption="FI Over DI Ratio Value" mask="0x0000FFFF" name="FI_DI_RATIO"/>
        </register>
        <register caption="USART Number of Errors Register" name="FLEX_US_NER" offset="0x244" rw="R" size="4">
          <bitfield caption="Number of Errors" mask="0x000000FF" name="NB_ERRORS"/>
        </register>
        <register caption="USART IrDA Filter Register" name="FLEX_US_IF" offset="0x24C" rw="RW" size="4">
          <bitfield caption="IrDA Filter" mask="0x000000FF" name="IRDA_FILTER"/>
        </register>
        <register caption="USART Manchester Configuration Register" name="FLEX_US_MAN" offset="0x250" rw="RW" size="4">
          <bitfield caption="Transmitter Preamble Length" mask="0x0000000F" name="TX_PL"/>
          <bitfield caption="Transmitter Preamble Pattern" mask="0x00000300" name="TX_PP" values="FLEX_US_MAN__TX_PP"/>
          <bitfield caption="Transmitter Manchester Polarity" mask="0x00001000" name="TX_MPOL"/>
          <bitfield caption="Receiver Preamble Length" mask="0x000F0000" name="RX_PL"/>
          <bitfield caption="Receiver Preamble Pattern detected" mask="0x03000000" name="RX_PP" values="FLEX_US_MAN__RX_PP"/>
          <bitfield caption="Receiver Manchester Polarity" mask="0x10000000" name="RX_MPOL"/>
          <bitfield caption="Must Be Set to 1" mask="0x20000000" name="ONE"/>
          <bitfield caption="Drift Compensation" mask="0x40000000" name="DRIFT"/>
          <bitfield caption="Receiver Idle Value" mask="0x80000000" name="RXIDLEV"/>
        </register>
        <register caption="USART LIN Mode Register" name="FLEX_US_LINMR" offset="0x254" rw="RW" size="4">
          <bitfield caption="LIN Node Action" mask="0x00000003" name="NACT" values="FLEX_US_LINMR__NACT"/>
          <bitfield caption="Parity Disable" mask="0x00000004" name="PARDIS"/>
          <bitfield caption="Checksum Disable" mask="0x00000008" name="CHKDIS"/>
          <bitfield caption="Checksum Type" mask="0x00000010" name="CHKTYP"/>
          <bitfield caption="Data Length Mode" mask="0x00000020" name="DLM"/>
          <bitfield caption="Frame Slot Mode Disable" mask="0x00000040" name="FSDIS"/>
          <bitfield caption="Wakeup Signal Type" mask="0x00000080" name="WKUPTYP"/>
          <bitfield caption="Data Length Control" mask="0x0000FF00" name="DLC"/>
          <bitfield caption="DMAC Mode" mask="0x00010000" name="PDCM"/>
          <bitfield caption="Synchronization Disable" mask="0x00020000" name="SYNCDIS"/>
        </register>
        <register caption="USART LIN Identifier Register" name="FLEX_US_LINIR" offset="0x258" rw="RW" size="4">
          <bitfield caption="Identifier Character" mask="0x000000FF" name="IDCHR"/>
        </register>
        <register caption="USART LIN Baud Rate Register" name="FLEX_US_LINBRR" offset="0x25C" rw="R" size="4">
          <bitfield caption="Clock Divider after Synchronization" mask="0x0000FFFF" name="LINCD"/>
          <bitfield caption="Fractional Part after Synchronization" mask="0x00070000" name="LINFP"/>
        </register>
        <register caption="USART LON Mode Register" name="FLEX_US_LONMR" offset="0x260" rw="RW" size="4">
          <bitfield caption="LON comm_type Parameter Value" mask="0x00000001" name="COMMT"/>
          <bitfield caption="LON Collision Detection Feature" mask="0x00000002" name="COLDET"/>
          <bitfield caption="Terminate Frame upon Collision Notification" mask="0x00000004" name="TCOL"/>
          <bitfield caption="LON Collision Detection on Frame Tail" mask="0x00000008" name="CDTAIL"/>
          <bitfield caption="LON DMA Mode" mask="0x00000010" name="DMAM"/>
          <bitfield caption="LON Collision Detection Source" mask="0x00000020" name="LCDS"/>
          <bitfield caption="End of Frame Condition Size" mask="0x00FF0000" name="EOFS"/>
        </register>
        <register caption="USART LON Preamble Register" name="FLEX_US_LONPR" offset="0x264" rw="RW" size="4">
          <bitfield caption="LON Preamble Length" mask="0x00003FFF" name="LONPL"/>
        </register>
