Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
        <register caption="HECC Control Register ChannelNumbers (ChannelNumbers = 0) 8" name="HEFC_HECC_CR8" offset="0x120" rw="RW" size="4">
          <bitfield caption="ECC protection enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="test mode of ECC protection - read mode" mask="0x00000002" name="TEST_MODE_RD"/>
          <bitfield caption="test mode of ECC protection - write mode" mask="0x00000004" name="TEST_MODE_WR"/>
          <bitfield caption="reset the fixable error counter" mask="0x00000010" name="RST_FIX_CPT"/>
          <bitfield caption="reset the un-fixable error counter" mask="0x00000020" name="RST_NOFIX_CPT"/>
          <bitfield caption="BCH ECC enable" mask="0x00000040" name="ECC12_ENABLE"/>
        </register>
        <register caption="HECC Control Register ChannelNumbers (ChannelNumbers = 0) 9" name="HEFC_HECC_CR9" offset="0x124" rw="RW" size="4">
          <bitfield caption="ECC protection enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="test mode of ECC protection - read mode" mask="0x00000002" name="TEST_MODE_RD"/>
          <bitfield caption="test mode of ECC protection - write mode" mask="0x00000004" name="TEST_MODE_WR"/>
          <bitfield caption="reset the fixable error counter" mask="0x00000010" name="RST_FIX_CPT"/>
          <bitfield caption="reset the un-fixable error counter" mask="0x00000020" name="RST_NOFIX_CPT"/>
          <bitfield caption="BCH ECC enable" mask="0x00000040" name="ECC12_ENABLE"/>
        </register>
        <register caption="HECC Control Register ChannelNumbers (ChannelNumbers = 0) 10" name="HEFC_HECC_CR10" offset="0x128" rw="RW" size="4">
          <bitfield caption="ECC protection enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="test mode of ECC protection - read mode" mask="0x00000002" name="TEST_MODE_RD"/>
          <bitfield caption="test mode of ECC protection - write mode" mask="0x00000004" name="TEST_MODE_WR"/>
          <bitfield caption="reset the fixable error counter" mask="0x00000010" name="RST_FIX_CPT"/>
          <bitfield caption="reset the un-fixable error counter" mask="0x00000020" name="RST_NOFIX_CPT"/>
          <bitfield caption="BCH ECC enable" mask="0x00000040" name="ECC12_ENABLE"/>
        </register>
        <register caption="HECC Control Register ChannelNumbers (ChannelNumbers = 0) 11" name="HEFC_HECC_CR11" offset="0x12C" rw="RW" size="4">
          <bitfield caption="ECC protection enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="test mode of ECC protection - read mode" mask="0x00000002" name="TEST_MODE_RD"/>
          <bitfield caption="test mode of ECC protection - write mode" mask="0x00000004" name="TEST_MODE_WR"/>
          <bitfield caption="reset the fixable error counter" mask="0x00000010" name="RST_FIX_CPT"/>
          <bitfield caption="reset the un-fixable error counter" mask="0x00000020" name="RST_NOFIX_CPT"/>
          <bitfield caption="BCH ECC enable" mask="0x00000040" name="ECC12_ENABLE"/>
        </register>
        <register caption="HECC Control Register ChannelNumbers (ChannelNumbers = 0) 12" name="HEFC_HECC_CR12" offset="0x130" rw="RW" size="4">
          <bitfield caption="ECC protection enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="test mode of ECC protection - read mode" mask="0x00000002" name="TEST_MODE_RD"/>
          <bitfield caption="test mode of ECC protection - write mode" mask="0x00000004" name="TEST_MODE_WR"/>
          <bitfield caption="reset the fixable error counter" mask="0x00000010" name="RST_FIX_CPT"/>
          <bitfield caption="reset the un-fixable error counter" mask="0x00000020" name="RST_NOFIX_CPT"/>
          <bitfield caption="BCH ECC enable" mask="0x00000040" name="ECC12_ENABLE"/>
        </register>
        <register caption="HECC Control Register ChannelNumbers (ChannelNumbers = 0) 13" name="HEFC_HECC_CR13" offset="0x134" rw="RW" size="4">
          <bitfield caption="ECC protection enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="test mode of ECC protection - read mode" mask="0x00000002" name="TEST_MODE_RD"/>
          <bitfield caption="test mode of ECC protection - write mode" mask="0x00000004" name="TEST_MODE_WR"/>
          <bitfield caption="reset the fixable error counter" mask="0x00000010" name="RST_FIX_CPT"/>
          <bitfield caption="reset the un-fixable error counter" mask="0x00000020" name="RST_NOFIX_CPT"/>
          <bitfield caption="BCH ECC enable" mask="0x00000040" name="ECC12_ENABLE"/>
        </register>
        <register caption="HECC Control Register ChannelNumbers (ChannelNumbers = 0) 14" name="HEFC_HECC_CR14" offset="0x138" rw="RW" size="4">
          <bitfield caption="ECC protection enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="test mode of ECC protection - read mode" mask="0x00000002" name="TEST_MODE_RD"/>
          <bitfield caption="test mode of ECC protection - write mode" mask="0x00000004" name="TEST_MODE_WR"/>
          <bitfield caption="reset the fixable error counter" mask="0x00000010" name="RST_FIX_CPT"/>
          <bitfield caption="reset the un-fixable error counter" mask="0x00000020" name="RST_NOFIX_CPT"/>
          <bitfield caption="BCH ECC enable" mask="0x00000040" name="ECC12_ENABLE"/>
        </register>
        <register caption="HECC Control Register ChannelNumbers (ChannelNumbers = 0) 15" name="HEFC_HECC_CR15" offset="0x13C" rw="RW" size="4">
          <bitfield caption="ECC protection enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="test mode of ECC protection - read mode" mask="0x00000002" name="TEST_MODE_RD"/>
          <bitfield caption="test mode of ECC protection - write mode" mask="0x00000004" name="TEST_MODE_WR"/>
          <bitfield caption="reset the fixable error counter" mask="0x00000010" name="RST_FIX_CPT"/>
          <bitfield caption="reset the un-fixable error counter" mask="0x00000020" name="RST_NOFIX_CPT"/>
          <bitfield caption="BCH ECC enable" mask="0x00000040" name="ECC12_ENABLE"/>
        </register>
        <register caption="HECC Test mode ChannelNumbers (ChannelNumbers = 0) 0" name="HEFC_HECC_TESTCB0" offset="0x140" rw="RW" size="4">
          <bitfield caption="test check bit (16 bit)" mask="0x0000FFFF" name="TCB"/>
        </register>
        <register caption="HECC Test mode ChannelNumbers (ChannelNumbers = 0) 1" name="HEFC_HECC_TESTCB1" offset="0x144" rw="RW" size="4">
          <bitfield caption="test check bit (16 bit)" mask="0x0000FFFF" name="TCB"/>
        </register>
        <register caption="HECC Test mode ChannelNumbers (ChannelNumbers = 0) 2" name="HEFC_HECC_TESTCB2" offset="0x148" rw="RW" size="4">
          <bitfield caption="test check bit (16 bit)" mask="0x0000FFFF" name="TCB"/>
        </register>
