Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
      <value-group caption="" name="HEFC_FCR__FCMD">
        <value caption="Get Flash descriptor" name="GETD" value="0x00"/>
        <value caption="Write page" name="WP" value="0x01"/>
        <value caption="Write page and lock" name="WPL" value="0x02"/>
        <value caption="Erase all" name="EA" value="0x05"/>
        <value caption="Erase page" name="EP" value="0x06"/>
        <value caption="Erase pages" name="EPA" value="0x07"/>
        <value caption="Set lock bit" name="SLB" value="0x08"/>
        <value caption="Clear lock bit" name="CLB" value="0x09"/>
        <value caption="Get lock bit" name="GLB" value="0x0A"/>
        <value caption="Set GPNVM bit" name="SGPB" value="0x0B"/>
        <value caption="Clear GPNVM bit" name="CGPB" value="0x0C"/>
        <value caption="Get GPNVM bit" name="GGPB" value="0x0D"/>
        <value caption="Get CALIB bit" name="GCALB" value="0x10"/>
        <value caption="Write user signature" name="WUS" value="0x12"/>
        <value caption="Erase user signature" name="EUS" value="0x13"/>
        <value caption="Start read user signature" name="STUS" value="0x14"/>
        <value caption="Stop read user signature" name="SPUS" value="0x15"/>
      </value-group>
      <value-group caption="" name="HEFC_FCR__FKEY">
        <value caption="The 0x5A value enables the command defined by the bits of the register. If the field is written with a different value, the write is not performed and no action is started." name="PASSWD" value="0x5A"/>
      </value-group>
      <value-group caption="" name="HEFC_FPMR__PWS_DLY">
        <value caption="delay is set to 75 usec" name="_75US" value="0x0"/>
        <value caption="delay is set to 150 usec" name="_150US" value="0x1"/>
        <value caption="delay is set to 300 usec" name="_300US" value="0x2"/>
        <value caption="delay is set to 600 usec" name="_600US" value="0x3"/>
      </value-group>
      <value-group caption="" name="HEFC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0x454643"/>
      </value-group>
      <value-group caption="Debug interface mode" name="HEFC_GPNVM_MISC__DEBUG_INTF">
        <value caption="JTAG" name="JTAG" value="0x0"/>
        <value caption="SWD" name="SWD" value="0x1"/>
      </value-group>
    </module>
    <module name="HEMC" caption="HEMC" id="44121" version="A">
      <register-group name="HEMC">
        <register caption="HEMC Control Register NCS 0" name="HEMC_CR_NCS0" offset="0x0" rw="RW" size="4">
          <bitfield caption="fixed to 0" mask="0x00000001" name="ZERO"/>
          <bitfield caption="Bank Size" mask="0x0000003E" name="BANKSIZE" values="HEMC_CR_NCS__BANKSIZE"/>
          <bitfield caption="type of memory used" mask="0x00000040" name="TYPE"/>
          <bitfield caption="relative base address of NCS area" mask="0x01FFFF80" name="ADDBASE"/>
        </register>
        <register caption="HEMC Control Register NCS 1" name="HEMC_CR_NCS1" offset="0x4" rw="RW" size="4">
          <bitfield caption="fixed to 0" mask="0x00000001" name="ZERO"/>
          <bitfield caption="Bank Size" mask="0x0000003E" name="BANKSIZE" values="HEMC_CR_NCS__BANKSIZE"/>
          <bitfield caption="type of memory used" mask="0x00000040" name="TYPE"/>
          <bitfield caption="relative base address of NCS area" mask="0x01FFFF80" name="ADDBASE"/>
        </register>
        <register caption="HEMC Control Register NCS 2" name="HEMC_CR_NCS2" offset="0x8" rw="RW" size="4">
          <bitfield caption="fixed to 0" mask="0x00000001" name="ZERO"/>
          <bitfield caption="Bank Size" mask="0x0000003E" name="BANKSIZE" values="HEMC_CR_NCS__BANKSIZE"/>
          <bitfield caption="type of memory used" mask="0x00000040" name="TYPE"/>
          <bitfield caption="relative base address of NCS area" mask="0x01FFFF80" name="ADDBASE"/>
        </register>
        <register caption="HEMC Control Register NCS 3" name="HEMC_CR_NCS3" offset="0xC" rw="RW" size="4">
          <bitfield caption="fixed to 0" mask="0x00000001" name="ZERO"/>
          <bitfield caption="Bank Size" mask="0x0000003E" name="BANKSIZE" values="HEMC_CR_NCS__BANKSIZE"/>
          <bitfield caption="type of memory used" mask="0x00000040" name="TYPE"/>
          <bitfield caption="relative base address of NCS area" mask="0x01FFFF80" name="ADDBASE"/>
        </register>
        <register caption="HEMC Control Register NCS 4" name="HEMC_CR_NCS4" offset="0x10" rw="RW" size="4">
          <bitfield caption="fixed to 0" mask="0x00000001" name="ZERO"/>
          <bitfield caption="Bank Size" mask="0x0000003E" name="BANKSIZE" values="HEMC_CR_NCS__BANKSIZE"/>
          <bitfield caption="type of memory used" mask="0x00000040" name="TYPE"/>
          <bitfield caption="relative base address of NCS area" mask="0x01FFFF80" name="ADDBASE"/>
        </register>
        <register caption="HEMC Control Register NCS 5" name="HEMC_CR_NCS5" offset="0x14" rw="RW" size="4">
          <bitfield caption="fixed to 0" mask="0x00000001" name="ZERO"/>
          <bitfield caption="Bank Size" mask="0x0000003E" name="BANKSIZE" values="HEMC_CR_NCS__BANKSIZE"/>
          <bitfield caption="type of memory used" mask="0x00000040" name="TYPE"/>
          <bitfield caption="relative base address of NCS area" mask="0x01FFFF80" name="ADDBASE"/>
        </register>
        <register caption="HEMC Polarity Control register" name="HEMC_CTRL" offset="0x18" rw="RW" size="4">
          <bitfield caption="External control buffer active polarity" mask="0x00000001" name="POL"/>
        </register>
        <register caption="HEMC Control Register Protection NCS 0" name="HEMC_CRP_NCS0" offset="0x20" rw="RW" size="4">
          <bitfield caption="Master Number ID" mask="0x0000FFFF" name="MASTERNUMBER"/>
          <bitfield caption="User or Superuser access" mask="0x00010000" name="SUPERUSER"/>
          <bitfield caption="Write Access" mask="0x00020000" name="WR"/>
          <bitfield caption="Read Access" mask="0x00040000" name="RD"/>
          <bitfield caption="bank size internal separation" mask="0x00F80000" name="SPLITBANKSIZE"/>
          <bitfield caption="select area protected" mask="0x01000000" name="PROTECTZONE"/>
          <bitfield caption="protection activation" mask="0x02000000" name="PROTECTON"/>
        </register>
