Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
        <register caption="HEMC Control Register Protection NCS 1" name="HEMC_CRP_NCS1" offset="0x24" rw="RW" size="4">
          <bitfield caption="Master Number ID" mask="0x0000FFFF" name="MASTERNUMBER"/>
          <bitfield caption="User or Superuser access" mask="0x00010000" name="SUPERUSER"/>
          <bitfield caption="Write Access" mask="0x00020000" name="WR"/>
          <bitfield caption="Read Access" mask="0x00040000" name="RD"/>
          <bitfield caption="bank size internal separation" mask="0x00F80000" name="SPLITBANKSIZE"/>
          <bitfield caption="select area protected" mask="0x01000000" name="PROTECTZONE"/>
          <bitfield caption="protection activation" mask="0x02000000" name="PROTECTON"/>
        </register>
        <register caption="HEMC Control Register Protection NCS 2" name="HEMC_CRP_NCS2" offset="0x28" rw="RW" size="4">
          <bitfield caption="Master Number ID" mask="0x0000FFFF" name="MASTERNUMBER"/>
          <bitfield caption="User or Superuser access" mask="0x00010000" name="SUPERUSER"/>
          <bitfield caption="Write Access" mask="0x00020000" name="WR"/>
          <bitfield caption="Read Access" mask="0x00040000" name="RD"/>
          <bitfield caption="bank size internal separation" mask="0x00F80000" name="SPLITBANKSIZE"/>
          <bitfield caption="select area protected" mask="0x01000000" name="PROTECTZONE"/>
          <bitfield caption="protection activation" mask="0x02000000" name="PROTECTON"/>
        </register>
        <register caption="HEMC Control Register Protection NCS 3" name="HEMC_CRP_NCS3" offset="0x2C" rw="RW" size="4">
          <bitfield caption="Master Number ID" mask="0x0000FFFF" name="MASTERNUMBER"/>
          <bitfield caption="User or Superuser access" mask="0x00010000" name="SUPERUSER"/>
          <bitfield caption="Write Access" mask="0x00020000" name="WR"/>
          <bitfield caption="Read Access" mask="0x00040000" name="RD"/>
          <bitfield caption="bank size internal separation" mask="0x00F80000" name="SPLITBANKSIZE"/>
          <bitfield caption="select area protected" mask="0x01000000" name="PROTECTZONE"/>
          <bitfield caption="protection activation" mask="0x02000000" name="PROTECTON"/>
        </register>
        <register caption="HEMC Control Register Protection NCS 4" name="HEMC_CRP_NCS4" offset="0x30" rw="RW" size="4">
          <bitfield caption="Master Number ID" mask="0x0000FFFF" name="MASTERNUMBER"/>
          <bitfield caption="User or Superuser access" mask="0x00010000" name="SUPERUSER"/>
          <bitfield caption="Write Access" mask="0x00020000" name="WR"/>
          <bitfield caption="Read Access" mask="0x00040000" name="RD"/>
          <bitfield caption="bank size internal separation" mask="0x00F80000" name="SPLITBANKSIZE"/>
          <bitfield caption="select area protected" mask="0x01000000" name="PROTECTZONE"/>
          <bitfield caption="protection activation" mask="0x02000000" name="PROTECTON"/>
        </register>
        <register caption="HEMC Control Register Protection NCS 5" name="HEMC_CRP_NCS5" offset="0x34" rw="RW" size="4">
          <bitfield caption="Master Number ID" mask="0x0000FFFF" name="MASTERNUMBER"/>
          <bitfield caption="User or Superuser access" mask="0x00010000" name="SUPERUSER"/>
          <bitfield caption="Write Access" mask="0x00020000" name="WR"/>
          <bitfield caption="Read Access" mask="0x00040000" name="RD"/>
          <bitfield caption="bank size internal separation" mask="0x00F80000" name="SPLITBANKSIZE"/>
          <bitfield caption="select area protected" mask="0x01000000" name="PROTECTZONE"/>
          <bitfield caption="protection activation" mask="0x02000000" name="PROTECTON"/>
        </register>
        <register caption="HEMC Interrupt Enable Register" name="HEMC_IER" offset="0x38" rw="W" size="4">
          <bitfield caption="out of range" mask="0x00000002" name="OUTOFRANGE"/>
          <bitfield caption="read access error" mask="0x00000004" name="RDERRORACCESS"/>
          <bitfield caption="write access error" mask="0x00000008" name="WRERRORACCESS"/>
          <bitfield caption="user or superuser access error" mask="0x00000010" name="USERERRORACCESS"/>
        </register>
        <register caption="HEMC Interrupt Disable Register" name="HEMC_IDR" offset="0x3C" rw="W" size="4">
          <bitfield caption="out of range" mask="0x00000002" name="OUTOFRANGE"/>
          <bitfield caption="read access error" mask="0x00000004" name="RDERRORACCESS"/>
          <bitfield caption="write access error" mask="0x00000008" name="WRERRORACCESS"/>
          <bitfield caption="user or superuser access error" mask="0x00000010" name="USERERRORACCESS"/>
        </register>
        <register caption="HEMC Interrupt Mask Register" name="HEMC_IMR" offset="0x40" rw="R" size="4">
          <bitfield caption="out of range" mask="0x00000002" name="OUTOFRANGE"/>
          <bitfield caption="read access error" mask="0x00000004" name="RDERRORACCESS"/>
          <bitfield caption="write access error" mask="0x00000008" name="WRERRORACCESS"/>
          <bitfield caption="user or superuser access error" mask="0x00000010" name="USERERRORACCESS"/>
        </register>
        <register caption="HEMC Interrupt Status Register" name="HEMC_ISR" offset="0x44" rw="R" size="4">
          <bitfield caption="out of range" mask="0x00000002" name="OUTOFRANGE"/>
          <bitfield caption="read access error" mask="0x00000004" name="RDERRORACCESS"/>
          <bitfield caption="Write access error" mask="0x00000008" name="WRERRORACCESS"/>
          <bitfield caption="User or SuperUser Error Access" mask="0x00000010" name="USERERRORACCESS"/>
        </register>
        <register caption="HEMC Status Register" name="HEMC_SR" offset="0x48" rw="R" size="4">
          <bitfield caption="out of range" mask="0x00000002" name="OUTOFRANGE"/>
          <bitfield caption="Read access error" mask="0x00000004" name="RDERRORACCESS"/>
          <bitfield caption="Write access error" mask="0x00000008" name="WRERRORACCESS"/>
          <bitfield caption="User or SuperUser Error Access" mask="0x00000010" name="USERERRORACCESS"/>
        </register>
        <register caption="HECC Control Register Channel 0 (HSMC)" name="HEMC_HECC_CR0" offset="0x100" rw="RW" size="4">
          <bitfield caption="ECC protection enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="test mode of ECC protection - read mode" mask="0x00000002" name="TEST_MODE_RD"/>
          <bitfield caption="test mode of ECC protection - write mode" mask="0x00000004" name="TEST_MODE_WR"/>
          <bitfield caption="reset the fixable error counter" mask="0x00000010" name="RST_FIX_CPT"/>
          <bitfield caption="reset the un-fixable error counter" mask="0x00000020" name="RST_NOFIX_CPT"/>
          <bitfield caption="BCH ECC enable" mask="0x00000040" name="ECC12_ENABLE"/>
        </register>
        <register caption="HECC Control Register Channel 1 (HSDRAMC)" name="HEMC_HECC_CR1" offset="0x104" rw="RW" size="4">
          <bitfield caption="ECC protection enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="test mode of ECC protection - read mode" mask="0x00000002" name="TEST_MODE_RD"/>
          <bitfield caption="test mode of ECC protection - write mode" mask="0x00000004" name="TEST_MODE_WR"/>
          <bitfield caption="reset the fixable error counter" mask="0x00000010" name="RST_FIX_CPT"/>
          <bitfield caption="reset the un-fixable error counter" mask="0x00000020" name="RST_NOFIX_CPT"/>
          <bitfield caption="BCH ECC enable" mask="0x00000040" name="ECC12_ENABLE"/>
        </register>
        <register caption="HECC Control Register Channel 2 (HSDRAMC)" name="HEMC_HECC_CR2" offset="0x108" rw="RW" size="4">
          <bitfield caption="ECC protection enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="test mode of ECC protection - read mode" mask="0x00000002" name="TEST_MODE_RD"/>
          <bitfield caption="test mode of ECC protection - write mode" mask="0x00000004" name="TEST_MODE_WR"/>
          <bitfield caption="reset the fixable error counter" mask="0x00000010" name="RST_FIX_CPT"/>
          <bitfield caption="reset the un-fixable error counter" mask="0x00000020" name="RST_NOFIX_CPT"/>
          <bitfield caption="BCH ECC enable" mask="0x00000040" name="ECC12_ENABLE"/>
        </register>
        <register caption="HECC Test mode Register Channel 0 (HSMC)" name="HEMC_HECC_TESTCB0" offset="0x140" rw="RW" size="4">
          <bitfield caption="test check bit (16 bit)" mask="0x0000FFFF" name="TCB1"/>
        </register>
