Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
        <register caption="HECC Test mode Register Channel 1 (HSDRAMC)" name="HEMC_HECC_TESTCB1" offset="0x144" rw="RW" size="4">
          <bitfield caption="test check bit (16 bit)" mask="0x0000FFFF" name="TCB1"/>
        </register>
        <register caption="HECC Test mode Register Channel 2 (HSDRAMC)" name="HEMC_HECC_TESTCB2" offset="0x148" rw="RW" size="4">
          <bitfield caption="test check bit (16 bit)" mask="0x0000FFFF" name="TCB1"/>
        </register>
        <register caption="HECC Status Register" name="HEMC_HECC_SR" offset="0x180" rw="R" size="4">
          <bitfield caption="Fixable error status" mask="0x00000001" name="MEM_FIX"/>
          <bitfield caption="5 bits counter" mask="0x0000007C" name="CPT_FIX"/>
          <bitfield caption="counter overflow" mask="0x00000080" name="OVER_FIX"/>
          <bitfield caption="Un-fixable error status" mask="0x00000100" name="MEM_NOFIX"/>
          <bitfield caption="5 bits counter" mask="0x00007C00" name="CPT_NOFIX"/>
          <bitfield caption="counter overflow" mask="0x00008000" name="OVER_NOFIX"/>
          <bitfield caption="Hardware Error Size" mask="0x07000000" name="HES"/>
          <bitfield caption="write or read access" mask="0x08000000" name="TYPE"/>
        </register>
        <register caption="HECC Interrupt Enable Register" name="HEMC_HECC_IER" offset="0x184" rw="W" size="4">
          <bitfield caption="Fixable error" mask="0x00000001" name="MEM_FIX"/>
          <bitfield caption="Un-fixable error" mask="0x00000002" name="MEM_NOFIX"/>
        </register>
        <register caption="HECC Interrupt Disable Register" name="HEMC_HECC_IDR" offset="0x188" rw="W" size="4">
          <bitfield caption="fixable error" mask="0x00000001" name="MEM_FIX"/>
          <bitfield caption="un-fixable error" mask="0x00000002" name="MEM_NOFIX"/>
        </register>
        <register caption="HECC Interrupt Mask Register" name="HEMC_HECC_IMR" offset="0x18C" rw="R" size="4">
          <bitfield caption="fixable error" mask="0x00000001" name="MEM_FIX"/>
          <bitfield caption="un-fixable error" mask="0x00000002" name="MEM_NOFIX"/>
        </register>
        <register caption="HECC Fail address register" name="HEMC_HECC_FAILAR" offset="0x190" rw="R" size="4">
          <bitfield caption="address of the error detected" mask="0xFFFFFFFF" name="ADDRESS"/>
        </register>
      </register-group>
      <value-group caption="" name="HEMC_CR_NCS__BANKSIZE">
        <value caption="8Kbytes" name="_8KB" value="0x0"/>
        <value caption="16Kbytes" name="_16KB" value="0x1"/>
        <value caption="32Kbytes" name="_32KB" value="0x2"/>
        <value caption="64Kbytes" name="_64KB" value="0x3"/>
        <value caption="128Kbytes" name="_128KB" value="0x4"/>
        <value caption="256Kbytes" name="_256KB" value="0x5"/>
        <value caption="512Kbytes" name="_512KB" value="0x6"/>
        <value caption="1Mbytes" name="_1MB" value="0x7"/>
        <value caption="2Mbytes" name="_2MB" value="0x8"/>
        <value caption="4Mbytes" name="_4MB" value="0x9"/>
        <value caption="8Mbytes" name="_8MB" value="0xA"/>
        <value caption="16Mbytes" name="_16MB" value="0xB"/>
        <value caption="32Mbytes" name="_32MB" value="0xC"/>
        <value caption="64Mbytes" name="_64MB" value="0xD"/>
        <value caption="128Mbytes" name="_128MB" value="0xE"/>
        <value caption="256Mbytes (Default)" name="_256MB" value="0xF"/>
        <value caption="512Mbytes" name="_512MB" value="0x10"/>
        <value caption="NOT_USED" name="NOT_USED" value="0x1F"/>
      </value-group>
    </module>
    <module name="HSDRAMC" caption="Hardened SDRAM Controller" id="44129" version="A">
      <register-group name="HSDRAMC">
        <register caption="Mode Register" name="HSDRAMC_MR" offset="0x0000" rw="RW" size="4">
          <bitfield caption="SDRAMC Command Mode" mask="0x00000007" name="MODE" values="HSDRAMC_MR__MODE"/>
        </register>
        <register caption="Refresh Timer Register" name="HSDRAMC_TR" offset="0x0004" rw="RW" size="4">
          <bitfield caption="SDRAMC Refresh Timer Count" mask="0x00000FFF" name="COUNT"/>
        </register>
        <register caption="Configuration Register" name="HSDRAMC_CR" offset="0x0008" rw="RW" size="4">
          <bitfield caption="Number of Column Bits" mask="0x00000007" name="NC" values="HSDRAMC_CR__NC"/>
          <bitfield caption="Number of Row Bits" mask="0x00000018" name="NR" values="HSDRAMC_CR__NR"/>
          <bitfield caption="Number of Banks" mask="0x00000020" name="NB" values="HSDRAMC_CR__NB"/>
          <bitfield caption="CAS Latency" mask="0x000000C0" name="CAS" values="HSDRAMC_CR__CAS"/>
          <bitfield caption="Data Bus Width" mask="0x00000100" name="DBW"/>
          <bitfield caption="Read Modify Write" mask="0x00000200" name="RMW"/>
        </register>
        <register caption="Setup Delay Register" name="HSDRAMC_SDR" offset="0x000C" rw="RW" size="4">
          <bitfield caption="Write Recovery Delay" mask="0x0000000F" name="TWR"/>
          <bitfield caption="Row Cycle Delay and Row Refresh Cycle" mask="0x000000F0" name="TRC_TRFC"/>
          <bitfield caption="Row Precharge Delay" mask="0x00000F00" name="TRP"/>
          <bitfield caption="Row to Column Delay" mask="0x0000F000" name="TRCD"/>
          <bitfield caption="Active to Precharge Delay" mask="0x000F0000" name="TRAS"/>
          <bitfield caption="Exit Self-Refresh to Active Delay" mask="0x00F00000" name="TXSR"/>
        </register>
        <register caption="Interrupt Enable Register" name="HSDRAMC_IER" offset="0x0014" rw="W" size="4">
          <bitfield caption="Refresh Error Interrupt Enable" mask="0x00000001" name="RES"/>
        </register>
        <register caption="Interrupt Disable Register" name="HSDRAMC_IDR" offset="0x0018" rw="W" size="4">
          <bitfield caption="Refresh Error Interrupt Disable" mask="0x00000001" name="RES"/>
        </register>
        <register caption="Interrupt Mask Register" name="HSDRAMC_IMR" offset="0x001C" rw="R" size="4">
          <bitfield caption="Refresh Error Interrupt Mask" mask="0x00000001" name="RES"/>
        </register>
        <register caption="Interrupt Status Register" name="HSDRAMC_ISR" offset="0x0020" rw="R" size="4">
          <bitfield caption="Refresh Error Status (cleared on read)" mask="0x00000001" name="RES"/>
        </register>
        <register caption="Configuration Register 1" name="HSDRAMC_CFR1" offset="0x0024" rw="RW" size="4">
          <bitfield caption="Load Mode Register Command to Active or Refresh Command" mask="0x0000000F" name="TMRD"/>
          <bitfield caption="Support Unaligned Access" mask="0x00000100" name="UNAL" values="HSDRAMC_CFR1__UNAL"/>
        </register>
