Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
        <register caption="Write Protection Mode Register" name="HSDRAMC_WPMR" offset="0x0028" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="HSDRAMC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="HSDRAMC_WPSR" offset="0x002C" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x0000FF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="HSDRAMC_MR__MODE">
        <value caption="Normal mode. Any access to the SDRAM is decoded normally. To activate this mode, the command must be followed by a write to the SDRAM." name="NORMAL" value="0x0"/>
        <value caption="The SDRAMC issues a NOP command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM." name="NOP" value="0x1"/>
        <value caption="The SDRAMC issues an &quot;All Banks Precharge&quot; command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM." name="ALLBANKS_PRECHARGE" value="0x2"/>
        <value caption="The SDRAMC issues a &quot;Load Mode Register&quot; command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM." name="LOAD_MODEREG" value="0x3"/>
        <value caption="The SDRAMC issues an &quot;Autorefresh&quot; Command when the SDRAM device is accessed regardless of the cycle. Previously, an &quot;All Banks Precharge&quot; command must be issued. To activate this mode, the command must be followed by a write to the SDRAM." name="AUTO_REFRESH" value="0x4"/>
        <value caption="The SDRAMC issues an &quot;Extended Load Mode Register&quot; command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the &quot;Extended Load Mode Register&quot; command must be followed by a write to the SDRAM. The write in the SDRAM must be done in the appropriate bank; most low-power SDRAM devices use the bank 1." name="EXT_LOAD_MODEREG" value="0x5"/>
      </value-group>
      <value-group caption="" name="HSDRAMC_CR__NC">
        <value caption="8 bits to define the column number, up to 256 columns" name="COL8" value="0x0"/>
        <value caption="9 bits to define the column number, up to 512 columns" name="COL9" value="0x1"/>
        <value caption="10 bits to define the column number, up to 1024 columns" name="COL10" value="0x2"/>
        <value caption="11 bits to define the column number, up to 2048 columns" name="COL11" value="0x3"/>
        <value caption="12 bits to define the column number, up to 4096 columns" name="COL12" value="0x4"/>
      </value-group>
      <value-group caption="" name="HSDRAMC_CR__NR">
        <value caption="11 bits to define the row number, up to 2048 rows" name="ROW11" value="0x0"/>
        <value caption="12 bits to define the row number, up to 4096 rows" name="ROW12" value="0x1"/>
        <value caption="13 bits to define the row number, up to 8192 rows" name="ROW13" value="0x2"/>
      </value-group>
      <value-group caption="" name="HSDRAMC_CR__NB">
        <value caption="2 banks" name="BANK2" value="0"/>
        <value caption="4 banks" name="BANK4" value="1"/>
      </value-group>
      <value-group caption="" name="HSDRAMC_CR__CAS">
        <value caption="1 cycle latency" name="LATENCY1" value="0x1"/>
        <value caption="2 cycle latency" name="LATENCY2" value="0x2"/>
        <value caption="3 cycle latency" name="LATENCY3" value="0x3"/>
      </value-group>
      <value-group caption="" name="HSDRAMC_CFR1__UNAL">
        <value caption="Unaligned access is not supported." name="UNSUPPORTED" value="0"/>
        <value caption="Unaligned access is supported." name="SUPPORTED" value="1"/>
      </value-group>
      <value-group caption="" name="HSDRAMC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x534452"/>
      </value-group>
    </module>
    <module name="HSMC" caption="Harden Static Memory Controller" id="44128" version="A">
      <register-group name="HSMC">
        <register caption="HSMC Setup Register (CS_number = 0)" name="HSMC_SETUP0" offset="0x0" rw="RW" size="4">
          <bitfield caption="NWE Setup Length" mask="0x0000003F" name="NWE_SETUP"/>
          <bitfield caption="NCS Setup Length in WRITE Access" mask="0x00003F00" name="NCS_WR_SETUP"/>
          <bitfield caption="NRD Setup Length" mask="0x003F0000" name="NRD_SETUP"/>
          <bitfield caption="NCS Setup Length in READ Access" mask="0x3F000000" name="NCS_RD_SETUP"/>
        </register>
        <register caption="HSMC Pulse Register (CS_number = 0)" name="HSMC_PULSE0" offset="0x4" rw="RW" size="4">
          <bitfield caption="NWE Pulse Length" mask="0x0000007F" name="NWE_PULSE"/>
          <bitfield caption="NCS Pulse Length in WRITE Access" mask="0x00007F00" name="NCS_WR_PULSE"/>
          <bitfield caption="NRD Pulse Length" mask="0x007F0000" name="NRD_PULSE"/>
          <bitfield caption="NCS Pulse Length in READ Access" mask="0x7F000000" name="NCS_RD_PULSE"/>
        </register>
        <register caption="HSMC Cycle Register (CS_number = 0)" name="HSMC_CYCLE0" offset="0x8" rw="RW" size="4">
          <bitfield caption="Total Write Cycle Length" mask="0x000001FF" name="NWE_CYCLE"/>
          <bitfield caption="Total Read Cycle Length" mask="0x01FF0000" name="NRD_CYCLE"/>
        </register>
        <register caption="HSMC Mode Register (CS_number = 0)" name="HSMC_MODE0" offset="0xC" rw="RW" size="4">
          <bitfield caption="Read Mode" mask="0x00000001" name="READ_MODE"/>
          <bitfield caption="Write Mode" mask="0x00000002" name="WRITE_MODE"/>
          <bitfield caption="Read-Modify Write enable" mask="0x00000004" name="RMW_ENABLE"/>
          <bitfield caption="NWAIT Mode" mask="0x00000030" name="EXNW_MODE" values="HSMC_MODE0__EXNW_MODE"/>
          <bitfield caption="Data Bus Width" mask="0x00000300" name="DBW" values="HSMC_MODE0__DBW"/>
        </register>
        <register caption="HSMC Setup Register (CS_number = 1)" name="HSMC_SETUP1" offset="0x10" rw="RW" size="4">
          <bitfield caption="NWE Setup Length" mask="0x0000003F" name="NWE_SETUP"/>
          <bitfield caption="NCS Setup Length in WRITE Access" mask="0x00003F00" name="NCS_WR_SETUP"/>
          <bitfield caption="NRD Setup Length" mask="0x003F0000" name="NRD_SETUP"/>
          <bitfield caption="NCS Setup Length in READ Access" mask="0x3F000000" name="NCS_RD_SETUP"/>
        </register>
