Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
      <value-group name="ICM_RCFG__RHIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__DMIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__BEIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__WCIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__ECIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__SUIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__PROCDLY">
        <value name="SHORT" value="0"/>
        <value name="LONG" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__ALGO">
        <value caption="SHA1 algorithm processed" name="SHA1" value="0x0"/>
        <value caption="SHA256 algorithm processed" name="SHA256" value="0x1"/>
        <value caption="SHA224 algorithm processed" name="SHA224" value="0x4"/>
      </value-group>
    </module>
    <module name="IP1553" caption="IP 1553" id="44127" version="A">
      <register-group name="IP1553">
        <register caption="Configuration Register" name="IP1553_CR" offset="0x0" rw="RW" size="4">
          <bitfield caption="POTermConf" mask="0x00000001" name="PT"/>
          <bitfield caption="TermAddressConf" mask="0x0000003E" name="TA"/>
          <bitfield caption="TRBitCmd" mask="0x00000040" name="TC"/>
          <bitfield caption="SSBitCmd" mask="0x00000080" name="SC"/>
          <bitfield caption="BusyBitCmd" mask="0x00000100" name="BC"/>
          <bitfield caption="SREQBitCmd" mask="0x00000200" name="SRC"/>
          <bitfield caption="BCEnableCmd" mask="0x00000400" name="BEC"/>
          <bitfield caption="Soft Reset" mask="0x00000800" name="RST"/>
        </register>
        <register caption="Command Register 1" name="IP1553_CMDR1" offset="0xC" rw="W" size="4">
          <bitfield caption="DATA WORD COUNT" mask="0x0000001F" name="DATAWORDCOUNT"/>
          <bitfield caption="RT SUBADDRESS" mask="0x000003E0" name="RTSUBADDRESS"/>
          <bitfield caption="T/R" mask="0x00000400" name="T_R"/>
          <bitfield caption="RT ADDRESS" mask="0x0000F800" name="RTADDRESS"/>
        </register>
        <register caption="Command Register 2" name="IP1553_CMDR2" offset="0x10" rw="W" size="4">
          <bitfield caption="DATA WORD COUNT" mask="0x0000001F" name="DATAWORDCOUNT"/>
          <bitfield caption="RT SUBADDRESS" mask="0x000003E0" name="RTSUBADDRESS"/>
          <bitfield caption="R/T" mask="0x00000400" name="T_R"/>
          <bitfield caption="RT ADDRESS" mask="0x0000F800" name="RTADDRESS"/>
        </register>
        <register caption="Command Register 3" name="IP1553_CMDR3" offset="0x14" rw="W" size="4">
          <bitfield caption="bus used" mask="0x00000001" name="BUS"/>
          <bitfield caption="1553 emitter" mask="0x00000002" name="BCE"/>
          <bitfield caption="1553 receiver" mask="0x00000004" name="BCR"/>
          <bitfield caption="data or command transfer" mask="0x00000008" name="ER"/>
        </register>
        <register caption="BIT Register" name="IP1553_BITR" offset="0x18" rw="W" size="4">
          <bitfield caption="to bit word" mask="0x0000FFFF" name="TOBITWORD"/>
        </register>
        <register caption="Vector Word Register" name="IP1553_VWR" offset="0x1C" rw="W" size="4">
          <bitfield caption="to vector word" mask="0x0000FFFF" name="TOVECTORWORD"/>
        </register>
        <register caption="IRQ Mask Enable Register" name="IP1553_IER" offset="0x20" rw="W" size="4">
          <bitfield caption="EndMemTransfer" mask="0x00000001" name="EMT"/>
          <bitfield caption="MemTransferErr" mask="0x00000002" name="MTE"/>
          <bitfield caption="End reception" mask="0x00000004" name="ERX"/>
          <bitfield caption="EndTransmission" mask="0x00000008" name="ETX"/>
          <bitfield caption="EndTransfer" mask="0x00000030" name="ETRANS"/>
          <bitfield caption="TransErr" mask="0x00000040" name="TE"/>
          <bitfield caption="TransCodingErr" mask="0x00000080" name="TCE"/>
          <bitfield caption="TransParityErr" mask="0x00000100" name="TPE"/>
          <bitfield caption="TransDataTypeErr" mask="0x00000200" name="TDE"/>
          <bitfield caption="TransTimeOutErr" mask="0x00000400" name="TTE"/>
          <bitfield caption="TransWordCounterErr" mask="0x00000800" name="TWE"/>
          <bitfield caption="BufIFErr" mask="0x00001000" name="BE"/>
          <bitfield caption="IllegalTransferReq" mask="0x00002000" name="ITR"/>
          <bitfield caption="TransVecWordReq" mask="0x00004000" name="TVR"/>
          <bitfield caption="DynamicBusContReq" mask="0x00008000" name="DBR"/>
          <bitfield caption="InitSelfTestReq" mask="0x00010000" name="STR"/>
          <bitfield caption="TranShutdownReq" mask="0x00020000" name="TSR"/>
          <bitfield caption="OvTranShutdownReq" mask="0x00040000" name="OSR"/>
          <bitfield caption="SyncWithDataReq" mask="0x00080000" name="SDR"/>
          <bitfield caption="SyncWithoutDataReq" mask="0x00100000" name="SWD"/>
          <bitfield caption="ResetRTReq" mask="0x00200000" name="RRT"/>
          <bitfield caption="InhibitTermFlagReq" mask="0x00400000" name="ITF"/>
          <bitfield caption="OvInhibitTermFlagReq" mask="0x00800000" name="OTF"/>
          <bitfield caption="IPBusy" mask="0x01000000" name="IPB"/>
        </register>
        <register caption="IRQ Mask Disable Register" name="IP1553_IDR" offset="0x24" rw="W" size="4">
          <bitfield caption="EndMemTransfer" mask="0x00000001" name="EMT"/>
          <bitfield caption="MemTransferErr" mask="0x00000002" name="MTE"/>
          <bitfield caption="End reception" mask="0x00000004" name="ERX"/>
          <bitfield caption="EndTransmission" mask="0x00000008" name="ETX"/>
          <bitfield caption="EndTransfer" mask="0x00000030" name="ETRANS"/>
          <bitfield caption="TransErr" mask="0x00000040" name="TE"/>
          <bitfield caption="TransCodingErr" mask="0x00000080" name="TCE"/>
          <bitfield caption="TransParityErr" mask="0x00000100" name="TPE"/>
          <bitfield caption="TransDataTypeErr" mask="0x00000200" name="TDE"/>
          <bitfield caption="TransTimeOutErr" mask="0x00000400" name="TTE"/>
          <bitfield caption="TransWordCounterErr" mask="0x00000800" name="TWE"/>
          <bitfield caption="BufIFErr" mask="0x00001000" name="BE"/>
          <bitfield caption="IllegalTransferReq" mask="0x00002000" name="ITR"/>
          <bitfield caption="TransVecWordReq" mask="0x00004000" name="TVR"/>
          <bitfield caption="DynamicBusContReq" mask="0x00008000" name="DBR"/>
          <bitfield caption="InitSelfTestReq" mask="0x00010000" name="STR"/>
          <bitfield caption="TranShutdownReq" mask="0x00020000" name="TSR"/>
          <bitfield caption="OvTranShutdownReq" mask="0x00040000" name="OSR"/>
          <bitfield caption="SyncWithDataReq" mask="0x00080000" name="SDR"/>
          <bitfield caption="SyncWithoutDataReq" mask="0x00100000" name="SWD"/>
          <bitfield caption="ResetRTReq" mask="0x00200000" name="RRT"/>
          <bitfield caption="InhibitTermFlagReq" mask="0x00400000" name="ITF"/>
          <bitfield caption="OvInhibitTermFlagReq" mask="0x00800000" name="OTF"/>
          <bitfield caption="IPBusy" mask="0x01000000" name="IPB"/>
        </register>
        <register caption="IRQ Mask Register" name="IP1553_IMR" offset="0x28" rw="R" size="4">
          <bitfield caption="EndMemTransfer" mask="0x00000001" name="EMT"/>
          <bitfield caption="MemTransferErr" mask="0x00000002" name="MTE"/>
          <bitfield caption="End reception" mask="0x00000004" name="ERX"/>
          <bitfield caption="EndTransmission" mask="0x00000008" name="ETX"/>
          <bitfield caption="EndTransfer" mask="0x00000030" name="ETRANS"/>
          <bitfield caption="TransErr" mask="0x00000040" name="TE"/>
          <bitfield caption="TransCodingErr" mask="0x00000080" name="TCE"/>
          <bitfield caption="TransParityErr" mask="0x00000100" name="TPE"/>
          <bitfield caption="TransDataTypeErr" mask="0x00000200" name="TDE"/>
          <bitfield caption="TransTimeOutErr" mask="0x00000400" name="TTE"/>
          <bitfield caption="TransWordCounterErr" mask="0x00000800" name="TWE"/>
          <bitfield caption="BufIFErr" mask="0x00001000" name="BE"/>
          <bitfield caption="IllegalTransferReq" mask="0x00002000" name="ITR"/>
          <bitfield caption="TransVecWordReq" mask="0x00004000" name="TVR"/>
          <bitfield caption="DynamicBusContReq" mask="0x00008000" name="DBR"/>
          <bitfield caption="InitSelfTestReq" mask="0x00010000" name="STR"/>
          <bitfield caption="TranShutdownReq" mask="0x00020000" name="TSR"/>
          <bitfield caption="OvTranShutdownReq" mask="0x00040000" name="OSR"/>
          <bitfield caption="SyncWithDataReq" mask="0x00080000" name="SDR"/>
          <bitfield caption="SyncWithoutDataReq" mask="0x00100000" name="SWD"/>
          <bitfield caption="ResetRTReq" mask="0x00200000" name="RRT"/>
          <bitfield caption="InhibitTermFlagReq" mask="0x00400000" name="ITF"/>
          <bitfield caption="OvInhibitTermFlagReq" mask="0x00800000" name="OTF"/>
          <bitfield caption="IPBusy" mask="0x01000000" name="IPB"/>
        </register>
        <register caption="IRQ Status Register" name="IP1553_ISR" offset="0x2C" rw="R" size="4">
          <bitfield caption="EndMemTransfer" mask="0x00000001" name="EMT"/>
          <bitfield caption="MemTransferErr" mask="0x00000002" name="MTE"/>
          <bitfield caption="End reception" mask="0x00000004" name="ERX"/>
          <bitfield caption="EndTransmission" mask="0x00000008" name="ETX"/>
          <bitfield caption="EndTransfer" mask="0x00000030" name="ETRANS"/>
          <bitfield caption="TransErr" mask="0x00000040" name="TE"/>
          <bitfield caption="TransCodingErr" mask="0x00000080" name="TCE"/>
          <bitfield caption="TransParityErr" mask="0x00000100" name="TPE"/>
          <bitfield caption="TransDataTypeErr" mask="0x00000200" name="TDE"/>
          <bitfield caption="TransTimeOutErr" mask="0x00000400" name="TTE"/>
          <bitfield caption="TransWordCounterErr" mask="0x00000800" name="TWE"/>
          <bitfield caption="BufIFErr" mask="0x00001000" name="BE"/>
          <bitfield caption="IllegalTransferReq" mask="0x00002000" name="ITR"/>
          <bitfield caption="TransVecWordReq" mask="0x00004000" name="TVR"/>
          <bitfield caption="DynamicBusContReq" mask="0x00008000" name="DBR"/>
          <bitfield caption="InitSelfTestReq" mask="0x00010000" name="STR"/>
          <bitfield caption="TranShutdownReq" mask="0x00020000" name="TSR"/>
          <bitfield caption="OvTranShutdownReq" mask="0x00040000" name="OSR"/>
          <bitfield caption="SyncWithDataReq" mask="0x00080000" name="SDR"/>
          <bitfield caption="SyncWithoutDataReq" mask="0x00100000" name="SWD"/>
          <bitfield caption="ResetRTReq" mask="0x00200000" name="RRT"/>
          <bitfield caption="InhibitTermFlagReq" mask="0x00400000" name="ITF"/>
          <bitfield caption="OvInhibitTermFlagReq" mask="0x00800000" name="OTF"/>
          <bitfield caption="IPBusy" mask="0x01000000" name="IPB"/>
        </register>
        <register caption="Control Register 1" name="IP1553_CTRL1" offset="0x30" rw="R" size="4">
          <bitfield caption="IP1553 data value 1" mask="0x0000FFFF" name="IP1553DATA1"/>
          <bitfield caption="IP1553 data value 2" mask="0xFFFF0000" name="IP1553DATA2"/>
        </register>
        <register caption="Control Register 2" name="IP1553_CTRL2" offset="0x34" rw="R" size="4">
          <bitfield caption="from command register" mask="0x0000000F" name="FROMCOMMANDREG"/>
          <bitfield caption="from vector register" mask="0x000FFFF0" name="FROMVECTORWORD"/>
        </register>
        <register caption="Control Register 3" name="IP1553_CTRL3" offset="0x38" rw="R" size="4">
          <bitfield caption="content of status word register" mask="0x0000FFFF" name="FROMSTATUSWORD"/>
          <bitfield caption="content of bit word register" mask="0xFFFF0000" name="FROMBITWORD"/>
        </register>
        <register caption="Address Register Write" name="IP1553_ARW" offset="0x3C" rw="RW" size="4">
          <bitfield caption="TX base address" mask="0xFFFFFFFF" name="REG_ADDR_APB_W"/>
        </register>
        <register caption="Address Register Read" name="IP1553_ARR" offset="0x40" rw="RW" size="4">
          <bitfield caption="RX base address" mask="0xFFFFFFFF" name="REG_ADDR_APB_R"/>
        </register>
