Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
        <register caption="Rx Buffer Status Register" name="IP1553_RXBSR" offset="0x44" rw="RW" size="4">
          <bitfield caption="Receive Buffer, 0 with x=[0-31]" mask="0x00000001" name="RE0"/>
          <bitfield caption="Receive Buffer, 1 with x=[0-31]" mask="0x00000002" name="RE1"/>
          <bitfield caption="Receive Buffer, 2 with x=[0-31]" mask="0x00000004" name="RE2"/>
          <bitfield caption="Receive Buffer, 3 with x=[0-31]" mask="0x00000008" name="RE3"/>
          <bitfield caption="Receive Buffer, 4 with x=[0-31]" mask="0x00000010" name="RE4"/>
          <bitfield caption="Receive Buffer, 5 with x=[0-31]" mask="0x00000020" name="RE5"/>
          <bitfield caption="Receive Buffer, 6 with x=[0-31]" mask="0x00000040" name="RE6"/>
          <bitfield caption="Receive Buffer, 7 with x=[0-31]" mask="0x00000080" name="RE7"/>
          <bitfield caption="Receive Buffer, 8 with x=[0-31]" mask="0x00000100" name="RE8"/>
          <bitfield caption="Receive Buffer, 9 with x=[0-31]" mask="0x00000200" name="RE9"/>
          <bitfield caption="Receive Buffer, 10 with x=[0-31]" mask="0x00000400" name="RE10"/>
          <bitfield caption="Receive Buffer, 11 with x=[0-31]" mask="0x00000800" name="RE11"/>
          <bitfield caption="Receive Buffer, 12 with x=[0-31]" mask="0x00001000" name="RE12"/>
          <bitfield caption="Receive Buffer, 13 with x=[0-31]" mask="0x00002000" name="RE13"/>
          <bitfield caption="Receive Buffer, 14 with x=[0-31]" mask="0x00004000" name="RE14"/>
          <bitfield caption="Receive Buffer, 15 with x=[0-31]" mask="0x00008000" name="RE15"/>
          <bitfield caption="Receive Buffer, 16 with x=[0-31]" mask="0x00010000" name="RE16"/>
          <bitfield caption="Receive Buffer, 17 with x=[0-31]" mask="0x00020000" name="RE17"/>
          <bitfield caption="Receive Buffer, 18 with x=[0-31]" mask="0x00040000" name="RE18"/>
          <bitfield caption="Receive Buffer, 19 with x=[0-31]" mask="0x00080000" name="RE19"/>
          <bitfield caption="Receive Buffer, 20 with x=[0-31]" mask="0x00100000" name="RE20"/>
          <bitfield caption="Receive Buffer, 21 with x=[0-31]" mask="0x00200000" name="RE21"/>
          <bitfield caption="Receive Buffer, 22 with x=[0-31]" mask="0x00400000" name="RE22"/>
          <bitfield caption="Receive Buffer, 23 with x=[0-31]" mask="0x00800000" name="RE23"/>
          <bitfield caption="Receive Buffer, 24 with x=[0-31]" mask="0x01000000" name="RE24"/>
          <bitfield caption="Receive Buffer, 25 with x=[0-31]" mask="0x02000000" name="RE25"/>
          <bitfield caption="Receive Buffer, 26 with x=[0-31]" mask="0x04000000" name="RE26"/>
          <bitfield caption="Receive Buffer, 27 with x=[0-31]" mask="0x08000000" name="RE27"/>
          <bitfield caption="Receive Buffer, 28 with x=[0-31]" mask="0x10000000" name="RE28"/>
          <bitfield caption="Receive Buffer, 29 with x=[0-31]" mask="0x20000000" name="RE29"/>
          <bitfield caption="Receive Buffer, 30 with x=[0-31]" mask="0x40000000" name="RE30"/>
          <bitfield caption="Receive Buffer, 31 with x=[0-31]" mask="0x80000000" name="RE31"/>
        </register>
        <register caption="Rx Buffer Access Error Register" name="IP1553_RXBAER" offset="0x48" rw="RW" size="4">
          <bitfield caption="Receive error 0, x with x=[0-31]" mask="0x00000001" name="RER0"/>
          <bitfield caption="Receive error 1, x with x=[0-31]" mask="0x00000002" name="RER1"/>
          <bitfield caption="Receive error 2, x with x=[0-31]" mask="0x00000004" name="RER2"/>
          <bitfield caption="Receive error 3, x with x=[0-31]" mask="0x00000008" name="RER3"/>
          <bitfield caption="Receive error 4, x with x=[0-31]" mask="0x00000010" name="RER4"/>
          <bitfield caption="Receive error 5, x with x=[0-31]" mask="0x00000020" name="RER5"/>
          <bitfield caption="Receive error 6, x with x=[0-31]" mask="0x00000040" name="RER6"/>
          <bitfield caption="Receive error 7, x with x=[0-31]" mask="0x00000080" name="RER7"/>
          <bitfield caption="Receive error 8, x with x=[0-31]" mask="0x00000100" name="RER8"/>
          <bitfield caption="Receive error 9, x with x=[0-31]" mask="0x00000200" name="RER9"/>
          <bitfield caption="Receive error 10, x with x=[0-31]" mask="0x00000400" name="RER10"/>
          <bitfield caption="Receive error 11, x with x=[0-31]" mask="0x00000800" name="RER11"/>
          <bitfield caption="Receive error 12, x with x=[0-31]" mask="0x00001000" name="RER12"/>
          <bitfield caption="Receive error 13, x with x=[0-31]" mask="0x00002000" name="RER13"/>
          <bitfield caption="Receive error 14, x with x=[0-31]" mask="0x00004000" name="RER14"/>
          <bitfield caption="Receive error 15, x with x=[0-31]" mask="0x00008000" name="RER15"/>
          <bitfield caption="Receive error 16, x with x=[0-31]" mask="0x00010000" name="RER16"/>
          <bitfield caption="Receive error 17, x with x=[0-31]" mask="0x00020000" name="RER17"/>
          <bitfield caption="Receive error 18, x with x=[0-31]" mask="0x00040000" name="RER18"/>
          <bitfield caption="Receive error 19, x with x=[0-31]" mask="0x00080000" name="RER19"/>
          <bitfield caption="Receive error 20, x with x=[0-31]" mask="0x00100000" name="RER20"/>
          <bitfield caption="Receive error 21, x with x=[0-31]" mask="0x00200000" name="RER21"/>
          <bitfield caption="Receive error 22, x with x=[0-31]" mask="0x00400000" name="RER22"/>
          <bitfield caption="Receive error 23, x with x=[0-31]" mask="0x00800000" name="RER23"/>
          <bitfield caption="Receive error 24, x with x=[0-31]" mask="0x01000000" name="RER24"/>
          <bitfield caption="Receive error 25, x with x=[0-31]" mask="0x02000000" name="RER25"/>
          <bitfield caption="Receive error 26, x with x=[0-31]" mask="0x04000000" name="RER26"/>
          <bitfield caption="Receive error 27, x with x=[0-31]" mask="0x08000000" name="RER27"/>
          <bitfield caption="Receive error 28, x with x=[0-31]" mask="0x10000000" name="RER28"/>
          <bitfield caption="Receive error 29, x with x=[0-31]" mask="0x20000000" name="RER29"/>
          <bitfield caption="Receive error 30, x with x=[0-31]" mask="0x40000000" name="RER30"/>
          <bitfield caption="Receive error 31, x with x=[0-31]" mask="0x80000000" name="RER31"/>
        </register>
