Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
        <register caption="Priority Register A for Slave 6" name="MATRIX_PRAS6" offset="0x00B0" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 0" mask="0x00000004" name="LQOSEN0"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 1" mask="0x00000040" name="LQOSEN1"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 2" mask="0x00000400" name="LQOSEN2"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 3" mask="0x00004000" name="LQOSEN3"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 4" mask="0x00040000" name="LQOSEN4"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 5" mask="0x00400000" name="LQOSEN5"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 6" mask="0x04000000" name="LQOSEN6"/>
          <bitfield caption="Master 7 Priority" mask="0x30000000" name="M7PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 7" mask="0x40000000" name="LQOSEN7"/>
        </register>
        <register caption="Priority Register B for Slave 6" name="MATRIX_PRBS6" offset="0x00B4" rw="RW" size="4">
          <bitfield caption="Master 8 Priority" mask="0x00000003" name="M8PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 8" mask="0x00000004" name="LQOSEN8"/>
          <bitfield caption="Master 9 Priority" mask="0x00000030" name="M9PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 9" mask="0x00000040" name="LQOSEN9"/>
          <bitfield caption="Master 10 Priority" mask="0x00000300" name="M10PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 10" mask="0x00000400" name="LQOSEN10"/>
          <bitfield caption="Master 11 Priority" mask="0x00003000" name="M11PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 11" mask="0x00004000" name="LQOSEN11"/>
          <bitfield caption="Master 12 Priority" mask="0x00030000" name="M12PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 12" mask="0x00040000" name="LQOSEN12"/>
          <bitfield caption="Master 13 Priority" mask="0x00300000" name="M13PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 13" mask="0x00400000" name="LQOSEN13"/>
          <bitfield caption="Master 14 Priority" mask="0x03000000" name="M14PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 14" mask="0x04000000" name="LQOSEN14"/>
          <bitfield caption="Master 15 Priority" mask="0x30000000" name="M15PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 15" mask="0x40000000" name="LQOSEN15"/>
        </register>
        <register caption="Priority Register A for Slave 7" name="MATRIX_PRAS7" offset="0x00B8" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 0" mask="0x00000004" name="LQOSEN0"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 1" mask="0x00000040" name="LQOSEN1"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 2" mask="0x00000400" name="LQOSEN2"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 3" mask="0x00004000" name="LQOSEN3"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 4" mask="0x00040000" name="LQOSEN4"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 5" mask="0x00400000" name="LQOSEN5"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 6" mask="0x04000000" name="LQOSEN6"/>
          <bitfield caption="Master 7 Priority" mask="0x30000000" name="M7PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 7" mask="0x40000000" name="LQOSEN7"/>
        </register>
        <register caption="Priority Register B for Slave 7" name="MATRIX_PRBS7" offset="0x00BC" rw="RW" size="4">
          <bitfield caption="Master 8 Priority" mask="0x00000003" name="M8PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 8" mask="0x00000004" name="LQOSEN8"/>
          <bitfield caption="Master 9 Priority" mask="0x00000030" name="M9PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 9" mask="0x00000040" name="LQOSEN9"/>
          <bitfield caption="Master 10 Priority" mask="0x00000300" name="M10PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 10" mask="0x00000400" name="LQOSEN10"/>
          <bitfield caption="Master 11 Priority" mask="0x00003000" name="M11PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 11" mask="0x00004000" name="LQOSEN11"/>
          <bitfield caption="Master 12 Priority" mask="0x00030000" name="M12PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 12" mask="0x00040000" name="LQOSEN12"/>
          <bitfield caption="Master 13 Priority" mask="0x00300000" name="M13PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 13" mask="0x00400000" name="LQOSEN13"/>
          <bitfield caption="Master 14 Priority" mask="0x03000000" name="M14PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 14" mask="0x04000000" name="LQOSEN14"/>
          <bitfield caption="Master 15 Priority" mask="0x30000000" name="M15PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 15" mask="0x40000000" name="LQOSEN15"/>
        </register>
        <register caption="Priority Register A for Slave 8" name="MATRIX_PRAS8" offset="0x00C0" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 0" mask="0x00000004" name="LQOSEN0"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 1" mask="0x00000040" name="LQOSEN1"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 2" mask="0x00000400" name="LQOSEN2"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 3" mask="0x00004000" name="LQOSEN3"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 4" mask="0x00040000" name="LQOSEN4"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 5" mask="0x00400000" name="LQOSEN5"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 6" mask="0x04000000" name="LQOSEN6"/>
          <bitfield caption="Master 7 Priority" mask="0x30000000" name="M7PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 7" mask="0x40000000" name="LQOSEN7"/>
        </register>
        <register caption="Priority Register B for Slave 8" name="MATRIX_PRBS8" offset="0x00C4" rw="RW" size="4">
          <bitfield caption="Master 8 Priority" mask="0x00000003" name="M8PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 8" mask="0x00000004" name="LQOSEN8"/>
          <bitfield caption="Master 9 Priority" mask="0x00000030" name="M9PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 9" mask="0x00000040" name="LQOSEN9"/>
          <bitfield caption="Master 10 Priority" mask="0x00000300" name="M10PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 10" mask="0x00000400" name="LQOSEN10"/>
          <bitfield caption="Master 11 Priority" mask="0x00003000" name="M11PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 11" mask="0x00004000" name="LQOSEN11"/>
          <bitfield caption="Master 12 Priority" mask="0x00030000" name="M12PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 12" mask="0x00040000" name="LQOSEN12"/>
          <bitfield caption="Master 13 Priority" mask="0x00300000" name="M13PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 13" mask="0x00400000" name="LQOSEN13"/>
          <bitfield caption="Master 14 Priority" mask="0x03000000" name="M14PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 14" mask="0x04000000" name="LQOSEN14"/>
          <bitfield caption="Master 15 Priority" mask="0x30000000" name="M15PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 15" mask="0x40000000" name="LQOSEN15"/>
        </register>
        <register caption="Priority Register A for Slave 9" name="MATRIX_PRAS9" offset="0x00C8" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 0" mask="0x00000004" name="LQOSEN0"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 1" mask="0x00000040" name="LQOSEN1"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 2" mask="0x00000400" name="LQOSEN2"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 3" mask="0x00004000" name="LQOSEN3"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 4" mask="0x00040000" name="LQOSEN4"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 5" mask="0x00400000" name="LQOSEN5"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 6" mask="0x04000000" name="LQOSEN6"/>
          <bitfield caption="Master 7 Priority" mask="0x30000000" name="M7PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 7" mask="0x40000000" name="LQOSEN7"/>
        </register>
        <register caption="Priority Register B for Slave 9" name="MATRIX_PRBS9" offset="0x00CC" rw="RW" size="4">
          <bitfield caption="Master 8 Priority" mask="0x00000003" name="M8PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 8" mask="0x00000004" name="LQOSEN8"/>
          <bitfield caption="Master 9 Priority" mask="0x00000030" name="M9PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 9" mask="0x00000040" name="LQOSEN9"/>
          <bitfield caption="Master 10 Priority" mask="0x00000300" name="M10PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 10" mask="0x00000400" name="LQOSEN10"/>
          <bitfield caption="Master 11 Priority" mask="0x00003000" name="M11PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 11" mask="0x00004000" name="LQOSEN11"/>
          <bitfield caption="Master 12 Priority" mask="0x00030000" name="M12PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 12" mask="0x00040000" name="LQOSEN12"/>
          <bitfield caption="Master 13 Priority" mask="0x00300000" name="M13PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 13" mask="0x00400000" name="LQOSEN13"/>
          <bitfield caption="Master 14 Priority" mask="0x03000000" name="M14PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 14" mask="0x04000000" name="LQOSEN14"/>
          <bitfield caption="Master 15 Priority" mask="0x30000000" name="M15PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 15" mask="0x40000000" name="LQOSEN15"/>
        </register>
        <register caption="Priority Register A for Slave 10" name="MATRIX_PRAS10" offset="0x00D0" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 0" mask="0x00000004" name="LQOSEN0"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 1" mask="0x00000040" name="LQOSEN1"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 2" mask="0x00000400" name="LQOSEN2"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 3" mask="0x00004000" name="LQOSEN3"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 4" mask="0x00040000" name="LQOSEN4"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 5" mask="0x00400000" name="LQOSEN5"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 6" mask="0x04000000" name="LQOSEN6"/>
          <bitfield caption="Master 7 Priority" mask="0x30000000" name="M7PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 7" mask="0x40000000" name="LQOSEN7"/>
        </register>
        <register caption="Priority Register B for Slave 10" name="MATRIX_PRBS10" offset="0x00D4" rw="RW" size="4">
          <bitfield caption="Master 8 Priority" mask="0x00000003" name="M8PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 8" mask="0x00000004" name="LQOSEN8"/>
          <bitfield caption="Master 9 Priority" mask="0x00000030" name="M9PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 9" mask="0x00000040" name="LQOSEN9"/>
          <bitfield caption="Master 10 Priority" mask="0x00000300" name="M10PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 10" mask="0x00000400" name="LQOSEN10"/>
          <bitfield caption="Master 11 Priority" mask="0x00003000" name="M11PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 11" mask="0x00004000" name="LQOSEN11"/>
          <bitfield caption="Master 12 Priority" mask="0x00030000" name="M12PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 12" mask="0x00040000" name="LQOSEN12"/>
          <bitfield caption="Master 13 Priority" mask="0x00300000" name="M13PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 13" mask="0x00400000" name="LQOSEN13"/>
          <bitfield caption="Master 14 Priority" mask="0x03000000" name="M14PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 14" mask="0x04000000" name="LQOSEN14"/>
          <bitfield caption="Master 15 Priority" mask="0x30000000" name="M15PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 15" mask="0x40000000" name="LQOSEN15"/>
        </register>
        <register caption="Priority Register A for Slave 11" name="MATRIX_PRAS11" offset="0x00D8" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 0" mask="0x00000004" name="LQOSEN0"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 1" mask="0x00000040" name="LQOSEN1"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 2" mask="0x00000400" name="LQOSEN2"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 3" mask="0x00004000" name="LQOSEN3"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 4" mask="0x00040000" name="LQOSEN4"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 5" mask="0x00400000" name="LQOSEN5"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 6" mask="0x04000000" name="LQOSEN6"/>
          <bitfield caption="Master 7 Priority" mask="0x30000000" name="M7PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 7" mask="0x40000000" name="LQOSEN7"/>
        </register>
        <register caption="Priority Register B for Slave 11" name="MATRIX_PRBS11" offset="0x00DC" rw="RW" size="4">
          <bitfield caption="Master 8 Priority" mask="0x00000003" name="M8PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 8" mask="0x00000004" name="LQOSEN8"/>
          <bitfield caption="Master 9 Priority" mask="0x00000030" name="M9PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 9" mask="0x00000040" name="LQOSEN9"/>
          <bitfield caption="Master 10 Priority" mask="0x00000300" name="M10PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 10" mask="0x00000400" name="LQOSEN10"/>
          <bitfield caption="Master 11 Priority" mask="0x00003000" name="M11PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 11" mask="0x00004000" name="LQOSEN11"/>
          <bitfield caption="Master 12 Priority" mask="0x00030000" name="M12PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 12" mask="0x00040000" name="LQOSEN12"/>
          <bitfield caption="Master 13 Priority" mask="0x00300000" name="M13PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 13" mask="0x00400000" name="LQOSEN13"/>
          <bitfield caption="Master 14 Priority" mask="0x03000000" name="M14PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 14" mask="0x04000000" name="LQOSEN14"/>
          <bitfield caption="Master 15 Priority" mask="0x30000000" name="M15PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 15" mask="0x40000000" name="LQOSEN15"/>
        </register>
        <register caption="Priority Register A for Slave 12" name="MATRIX_PRAS12" offset="0x00E0" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 0" mask="0x00000004" name="LQOSEN0"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 1" mask="0x00000040" name="LQOSEN1"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 2" mask="0x00000400" name="LQOSEN2"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 3" mask="0x00004000" name="LQOSEN3"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 4" mask="0x00040000" name="LQOSEN4"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 5" mask="0x00400000" name="LQOSEN5"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 6" mask="0x04000000" name="LQOSEN6"/>
          <bitfield caption="Master 7 Priority" mask="0x30000000" name="M7PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 7" mask="0x40000000" name="LQOSEN7"/>
        </register>
