Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
        <register caption="Priority Register B for Slave 12" name="MATRIX_PRBS12" offset="0x00E4" rw="RW" size="4">
          <bitfield caption="Master 8 Priority" mask="0x00000003" name="M8PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 8" mask="0x00000004" name="LQOSEN8"/>
          <bitfield caption="Master 9 Priority" mask="0x00000030" name="M9PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 9" mask="0x00000040" name="LQOSEN9"/>
          <bitfield caption="Master 10 Priority" mask="0x00000300" name="M10PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 10" mask="0x00000400" name="LQOSEN10"/>
          <bitfield caption="Master 11 Priority" mask="0x00003000" name="M11PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 11" mask="0x00004000" name="LQOSEN11"/>
          <bitfield caption="Master 12 Priority" mask="0x00030000" name="M12PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 12" mask="0x00040000" name="LQOSEN12"/>
          <bitfield caption="Master 13 Priority" mask="0x00300000" name="M13PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 13" mask="0x00400000" name="LQOSEN13"/>
          <bitfield caption="Master 14 Priority" mask="0x03000000" name="M14PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 14" mask="0x04000000" name="LQOSEN14"/>
          <bitfield caption="Master 15 Priority" mask="0x30000000" name="M15PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 15" mask="0x40000000" name="LQOSEN15"/>
        </register>
        <register caption="Priority Register A for Slave 13" name="MATRIX_PRAS13" offset="0x00E8" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 0" mask="0x00000004" name="LQOSEN0"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 1" mask="0x00000040" name="LQOSEN1"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 2" mask="0x00000400" name="LQOSEN2"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 3" mask="0x00004000" name="LQOSEN3"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 4" mask="0x00040000" name="LQOSEN4"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 5" mask="0x00400000" name="LQOSEN5"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 6" mask="0x04000000" name="LQOSEN6"/>
          <bitfield caption="Master 7 Priority" mask="0x30000000" name="M7PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 7" mask="0x40000000" name="LQOSEN7"/>
        </register>
        <register caption="Priority Register B for Slave 13" name="MATRIX_PRBS13" offset="0x00EC" rw="RW" size="4">
          <bitfield caption="Master 8 Priority" mask="0x00000003" name="M8PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 8" mask="0x00000004" name="LQOSEN8"/>
          <bitfield caption="Master 9 Priority" mask="0x00000030" name="M9PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 9" mask="0x00000040" name="LQOSEN9"/>
          <bitfield caption="Master 10 Priority" mask="0x00000300" name="M10PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 10" mask="0x00000400" name="LQOSEN10"/>
          <bitfield caption="Master 11 Priority" mask="0x00003000" name="M11PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 11" mask="0x00004000" name="LQOSEN11"/>
          <bitfield caption="Master 12 Priority" mask="0x00030000" name="M12PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 12" mask="0x00040000" name="LQOSEN12"/>
          <bitfield caption="Master 13 Priority" mask="0x00300000" name="M13PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 13" mask="0x00400000" name="LQOSEN13"/>
          <bitfield caption="Master 14 Priority" mask="0x03000000" name="M14PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 14" mask="0x04000000" name="LQOSEN14"/>
          <bitfield caption="Master 15 Priority" mask="0x30000000" name="M15PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 15" mask="0x40000000" name="LQOSEN15"/>
        </register>
        <register caption="Priority Register A for Slave 14" name="MATRIX_PRAS14" offset="0x00F0" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 0" mask="0x00000004" name="LQOSEN0"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 1" mask="0x00000040" name="LQOSEN1"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 2" mask="0x00000400" name="LQOSEN2"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 3" mask="0x00004000" name="LQOSEN3"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 4" mask="0x00040000" name="LQOSEN4"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 5" mask="0x00400000" name="LQOSEN5"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 6" mask="0x04000000" name="LQOSEN6"/>
          <bitfield caption="Master 7 Priority" mask="0x30000000" name="M7PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 7" mask="0x40000000" name="LQOSEN7"/>
        </register>
        <register caption="Priority Register B for Slave 14" name="MATRIX_PRBS14" offset="0x00F4" rw="RW" size="4">
          <bitfield caption="Master 8 Priority" mask="0x00000003" name="M8PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 8" mask="0x00000004" name="LQOSEN8"/>
          <bitfield caption="Master 9 Priority" mask="0x00000030" name="M9PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 9" mask="0x00000040" name="LQOSEN9"/>
          <bitfield caption="Master 10 Priority" mask="0x00000300" name="M10PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 10" mask="0x00000400" name="LQOSEN10"/>
          <bitfield caption="Master 11 Priority" mask="0x00003000" name="M11PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 11" mask="0x00004000" name="LQOSEN11"/>
          <bitfield caption="Master 12 Priority" mask="0x00030000" name="M12PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 12" mask="0x00040000" name="LQOSEN12"/>
          <bitfield caption="Master 13 Priority" mask="0x00300000" name="M13PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 13" mask="0x00400000" name="LQOSEN13"/>
          <bitfield caption="Master 14 Priority" mask="0x03000000" name="M14PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 14" mask="0x04000000" name="LQOSEN14"/>
          <bitfield caption="Master 15 Priority" mask="0x30000000" name="M15PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 15" mask="0x40000000" name="LQOSEN15"/>
        </register>
        <register caption="Priority Register A for Slave 15" name="MATRIX_PRAS15" offset="0x00F8" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 0" mask="0x00000004" name="LQOSEN0"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 1" mask="0x00000040" name="LQOSEN1"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 2" mask="0x00000400" name="LQOSEN2"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 3" mask="0x00004000" name="LQOSEN3"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 4" mask="0x00040000" name="LQOSEN4"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 5" mask="0x00400000" name="LQOSEN5"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 6" mask="0x04000000" name="LQOSEN6"/>
          <bitfield caption="Master 7 Priority" mask="0x30000000" name="M7PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 7" mask="0x40000000" name="LQOSEN7"/>
        </register>
        <register caption="Priority Register B for Slave 15" name="MATRIX_PRBS15" offset="0x00FC" rw="RW" size="4">
          <bitfield caption="Master 8 Priority" mask="0x00000003" name="M8PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 8" mask="0x00000004" name="LQOSEN8"/>
          <bitfield caption="Master 9 Priority" mask="0x00000030" name="M9PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 9" mask="0x00000040" name="LQOSEN9"/>
          <bitfield caption="Master 10 Priority" mask="0x00000300" name="M10PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 10" mask="0x00000400" name="LQOSEN10"/>
          <bitfield caption="Master 11 Priority" mask="0x00003000" name="M11PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 11" mask="0x00004000" name="LQOSEN11"/>
          <bitfield caption="Master 12 Priority" mask="0x00030000" name="M12PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 12" mask="0x00040000" name="LQOSEN12"/>
          <bitfield caption="Master 13 Priority" mask="0x00300000" name="M13PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 13" mask="0x00400000" name="LQOSEN13"/>
          <bitfield caption="Master 14 Priority" mask="0x03000000" name="M14PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 14" mask="0x04000000" name="LQOSEN14"/>
          <bitfield caption="Master 15 Priority" mask="0x30000000" name="M15PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 15" mask="0x40000000" name="LQOSEN15"/>
        </register>
        <register caption="Master Remap Control Register" name="MATRIX_MRCR" offset="0x0100" rw="RW" size="4">
          <bitfield caption="Remap Command Bit for Master 0" mask="0x00000001" name="RCB0"/>
          <bitfield caption="Remap Command Bit for Master 1" mask="0x00000002" name="RCB1"/>
          <bitfield caption="Remap Command Bit for Master 2" mask="0x00000004" name="RCB2"/>
          <bitfield caption="Remap Command Bit for Master 3" mask="0x00000008" name="RCB3"/>
          <bitfield caption="Remap Command Bit for Master 4" mask="0x00000010" name="RCB4"/>
          <bitfield caption="Remap Command Bit for Master 5" mask="0x00000020" name="RCB5"/>
          <bitfield caption="Remap Command Bit for Master 6" mask="0x00000040" name="RCB6"/>
          <bitfield caption="Remap Command Bit for Master 7" mask="0x00000080" name="RCB7"/>
          <bitfield caption="Remap Command Bit for Master 8" mask="0x00000100" name="RCB8"/>
          <bitfield caption="Remap Command Bit for Master 9" mask="0x00000200" name="RCB9"/>
          <bitfield caption="Remap Command Bit for Master 10" mask="0x00000400" name="RCB10"/>
          <bitfield caption="Remap Command Bit for Master 11" mask="0x00000800" name="RCB11"/>
          <bitfield caption="Remap Command Bit for Master 12" mask="0x00001000" name="RCB12"/>
          <bitfield caption="Remap Command Bit for Master 13" mask="0x00002000" name="RCB13"/>
          <bitfield caption="Remap Command Bit for Master 14" mask="0x00004000" name="RCB14"/>
          <bitfield caption="Remap Command Bit for Master 15" mask="0x00008000" name="RCB15"/>
        </register>
        <register caption="Special Function Register 0" name="MATRIX_SFR0" offset="0x110" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Special Function Register 1" name="MATRIX_SFR1" offset="0x114" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Special Function Register 2" name="MATRIX_SFR2" offset="0x118" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Special Function Register 3" name="MATRIX_SFR3" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Special Function Register 4" name="MATRIX_SFR4" offset="0x120" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
