Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
        <register caption="Special Function Register 5" name="MATRIX_SFR5" offset="0x124" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Special Function Register 6" name="MATRIX_SFR6" offset="0x128" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Special Function Register 7" name="MATRIX_SFR7" offset="0x12C" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Special Function Register 8" name="MATRIX_SFR8" offset="0x130" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Special Function Register 9" name="MATRIX_SFR9" offset="0x134" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Special Function Register 10" name="MATRIX_SFR10" offset="0x138" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Special Function Register 11" name="MATRIX_SFR11" offset="0x13C" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Special Function Register 12" name="MATRIX_SFR12" offset="0x140" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Special Function Register 13" name="MATRIX_SFR13" offset="0x144" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Special Function Register 14" name="MATRIX_SFR14" offset="0x148" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Special Function Register 15" name="MATRIX_SFR15" offset="0x14C" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Master Error Interrupt Enable Register" name="MATRIX_MEIER" offset="0x0150" rw="W" size="4">
          <bitfield caption="Master 0 Access Error" mask="0x00000001" name="MERR0"/>
          <bitfield caption="Master 1 Access Error" mask="0x00000002" name="MERR1"/>
          <bitfield caption="Master 2 Access Error" mask="0x00000004" name="MERR2"/>
          <bitfield caption="Master 3 Access Error" mask="0x00000008" name="MERR3"/>
          <bitfield caption="Master 4 Access Error" mask="0x00000010" name="MERR4"/>
          <bitfield caption="Master 5 Access Error" mask="0x00000020" name="MERR5"/>
          <bitfield caption="Master 6 Access Error" mask="0x00000040" name="MERR6"/>
          <bitfield caption="Master 7 Access Error" mask="0x00000080" name="MERR7"/>
          <bitfield caption="Master 8 Access Error" mask="0x00000100" name="MERR8"/>
          <bitfield caption="Master 9 Access Error" mask="0x00000200" name="MERR9"/>
          <bitfield caption="Master 10 Access Error" mask="0x00000400" name="MERR10"/>
          <bitfield caption="Master 11 Access Error" mask="0x00000800" name="MERR11"/>
          <bitfield caption="Master 12 Access Error" mask="0x00001000" name="MERR12"/>
          <bitfield caption="Master 13 Access Error" mask="0x00002000" name="MERR13"/>
          <bitfield caption="Master 14 Access Error" mask="0x00004000" name="MERR14"/>
          <bitfield caption="Master 15 Access Error" mask="0x00008000" name="MERR15"/>
        </register>
        <register caption="Master Error Interrupt Disable Register" name="MATRIX_MEIDR" offset="0x0154" rw="W" size="4">
          <bitfield caption="Master 0 Access Error" mask="0x00000001" name="MERR0"/>
          <bitfield caption="Master 1 Access Error" mask="0x00000002" name="MERR1"/>
          <bitfield caption="Master 2 Access Error" mask="0x00000004" name="MERR2"/>
          <bitfield caption="Master 3 Access Error" mask="0x00000008" name="MERR3"/>
          <bitfield caption="Master 4 Access Error" mask="0x00000010" name="MERR4"/>
          <bitfield caption="Master 5 Access Error" mask="0x00000020" name="MERR5"/>
          <bitfield caption="Master 6 Access Error" mask="0x00000040" name="MERR6"/>
          <bitfield caption="Master 7 Access Error" mask="0x00000080" name="MERR7"/>
          <bitfield caption="Master 8 Access Error" mask="0x00000100" name="MERR8"/>
          <bitfield caption="Master 9 Access Error" mask="0x00000200" name="MERR9"/>
          <bitfield caption="Master 10 Access Error" mask="0x00000400" name="MERR10"/>
          <bitfield caption="Master 11 Access Error" mask="0x00000800" name="MERR11"/>
          <bitfield caption="Master 12 Access Error" mask="0x00001000" name="MERR12"/>
          <bitfield caption="Master 13 Access Error" mask="0x00002000" name="MERR13"/>
          <bitfield caption="Master 14 Access Error" mask="0x00004000" name="MERR14"/>
          <bitfield caption="Master 15 Access Error" mask="0x00008000" name="MERR15"/>
        </register>
        <register caption="Master Error Interrupt Mask Register" name="MATRIX_MEIMR" offset="0x0158" rw="R" size="4">
          <bitfield caption="Master 0 Access Error" mask="0x00000001" name="MERR0"/>
          <bitfield caption="Master 1 Access Error" mask="0x00000002" name="MERR1"/>
          <bitfield caption="Master 2 Access Error" mask="0x00000004" name="MERR2"/>
          <bitfield caption="Master 3 Access Error" mask="0x00000008" name="MERR3"/>
          <bitfield caption="Master 4 Access Error" mask="0x00000010" name="MERR4"/>
          <bitfield caption="Master 5 Access Error" mask="0x00000020" name="MERR5"/>
          <bitfield caption="Master 6 Access Error" mask="0x00000040" name="MERR6"/>
          <bitfield caption="Master 7 Access Error" mask="0x00000080" name="MERR7"/>
          <bitfield caption="Master 8 Access Error" mask="0x00000100" name="MERR8"/>
          <bitfield caption="Master 9 Access Error" mask="0x00000200" name="MERR9"/>
          <bitfield caption="Master 10 Access Error" mask="0x00000400" name="MERR10"/>
          <bitfield caption="Master 11 Access Error" mask="0x00000800" name="MERR11"/>
          <bitfield caption="Master 12 Access Error" mask="0x00001000" name="MERR12"/>
          <bitfield caption="Master 13 Access Error" mask="0x00002000" name="MERR13"/>
          <bitfield caption="Master 14 Access Error" mask="0x00004000" name="MERR14"/>
          <bitfield caption="Master 15 Access Error" mask="0x00008000" name="MERR15"/>
        </register>
