Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
        <register caption="Protection Slave 0 Register 8" name="MATRIX_PSR8" offset="0x220" rw="RW" size="4">
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000001" name="LAUSERH0"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000002" name="LAUSERH1"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000004" name="LAUSERH2"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000008" name="LAUSERH3"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000010" name="LAUSERH4"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000020" name="LAUSERH5"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000040" name="LAUSERH6"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000080" name="LAUSERH7"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000100" name="RDUSERH0"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000200" name="RDUSERH1"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000400" name="RDUSERH2"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000800" name="RDUSERH3"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00001000" name="RDUSERH4"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00002000" name="RDUSERH5"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00004000" name="RDUSERH6"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00008000" name="RDUSERH7"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00010000" name="WRUSERH0"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00020000" name="WRUSERH1"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00040000" name="WRUSERH2"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00080000" name="WRUSERH3"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00100000" name="WRUSERH4"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00200000" name="WRUSERH5"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00400000" name="WRUSERH6"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00800000" name="WRUSERH7"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x01000000" name="DPSOA0"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x02000000" name="DPSOA1"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x04000000" name="DPSOA2"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x08000000" name="DPSOA3"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x10000000" name="DPSOA4"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x20000000" name="DPSOA5"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x40000000" name="DPSOA6"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x80000000" name="DPSOA7"/>
        </register>
        <register caption="Protection Slave 0 Register 9" name="MATRIX_PSR9" offset="0x224" rw="RW" size="4">
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000001" name="LAUSERH0"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000002" name="LAUSERH1"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000004" name="LAUSERH2"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000008" name="LAUSERH3"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000010" name="LAUSERH4"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000020" name="LAUSERH5"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000040" name="LAUSERH6"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000080" name="LAUSERH7"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000100" name="RDUSERH0"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000200" name="RDUSERH1"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000400" name="RDUSERH2"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000800" name="RDUSERH3"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00001000" name="RDUSERH4"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00002000" name="RDUSERH5"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00004000" name="RDUSERH6"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00008000" name="RDUSERH7"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00010000" name="WRUSERH0"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00020000" name="WRUSERH1"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00040000" name="WRUSERH2"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00080000" name="WRUSERH3"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00100000" name="WRUSERH4"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00200000" name="WRUSERH5"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00400000" name="WRUSERH6"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00800000" name="WRUSERH7"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x01000000" name="DPSOA0"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x02000000" name="DPSOA1"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x04000000" name="DPSOA2"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x08000000" name="DPSOA3"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x10000000" name="DPSOA4"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x20000000" name="DPSOA5"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x40000000" name="DPSOA6"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x80000000" name="DPSOA7"/>
        </register>
        <register caption="Protection Slave 0 Register 10" name="MATRIX_PSR10" offset="0x228" rw="RW" size="4">
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000001" name="LAUSERH0"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000002" name="LAUSERH1"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000004" name="LAUSERH2"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000008" name="LAUSERH3"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000010" name="LAUSERH4"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000020" name="LAUSERH5"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000040" name="LAUSERH6"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000080" name="LAUSERH7"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000100" name="RDUSERH0"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000200" name="RDUSERH1"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000400" name="RDUSERH2"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000800" name="RDUSERH3"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00001000" name="RDUSERH4"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00002000" name="RDUSERH5"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00004000" name="RDUSERH6"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00008000" name="RDUSERH7"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00010000" name="WRUSERH0"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00020000" name="WRUSERH1"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00040000" name="WRUSERH2"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00080000" name="WRUSERH3"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00100000" name="WRUSERH4"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00200000" name="WRUSERH5"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00400000" name="WRUSERH6"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00800000" name="WRUSERH7"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x01000000" name="DPSOA0"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x02000000" name="DPSOA1"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x04000000" name="DPSOA2"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x08000000" name="DPSOA3"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x10000000" name="DPSOA4"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x20000000" name="DPSOA5"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x40000000" name="DPSOA6"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x80000000" name="DPSOA7"/>
        </register>
        <register caption="Protection Slave 0 Register 11" name="MATRIX_PSR11" offset="0x22C" rw="RW" size="4">
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000001" name="LAUSERH0"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000002" name="LAUSERH1"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000004" name="LAUSERH2"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000008" name="LAUSERH3"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000010" name="LAUSERH4"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000020" name="LAUSERH5"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000040" name="LAUSERH6"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000080" name="LAUSERH7"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000100" name="RDUSERH0"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000200" name="RDUSERH1"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000400" name="RDUSERH2"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000800" name="RDUSERH3"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00001000" name="RDUSERH4"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00002000" name="RDUSERH5"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00004000" name="RDUSERH6"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00008000" name="RDUSERH7"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00010000" name="WRUSERH0"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00020000" name="WRUSERH1"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00040000" name="WRUSERH2"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00080000" name="WRUSERH3"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00100000" name="WRUSERH4"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00200000" name="WRUSERH5"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00400000" name="WRUSERH6"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00800000" name="WRUSERH7"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x01000000" name="DPSOA0"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x02000000" name="DPSOA1"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x04000000" name="DPSOA2"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x08000000" name="DPSOA3"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x10000000" name="DPSOA4"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x20000000" name="DPSOA5"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x40000000" name="DPSOA6"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x80000000" name="DPSOA7"/>
        </register>
        <register caption="Protection Slave 0 Register 12" name="MATRIX_PSR12" offset="0x230" rw="RW" size="4">
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000001" name="LAUSERH0"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000002" name="LAUSERH1"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000004" name="LAUSERH2"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000008" name="LAUSERH3"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000010" name="LAUSERH4"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000020" name="LAUSERH5"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000040" name="LAUSERH6"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000080" name="LAUSERH7"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000100" name="RDUSERH0"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000200" name="RDUSERH1"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000400" name="RDUSERH2"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000800" name="RDUSERH3"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00001000" name="RDUSERH4"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00002000" name="RDUSERH5"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00004000" name="RDUSERH6"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00008000" name="RDUSERH7"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00010000" name="WRUSERH0"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00020000" name="WRUSERH1"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00040000" name="WRUSERH2"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00080000" name="WRUSERH3"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00100000" name="WRUSERH4"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00200000" name="WRUSERH5"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00400000" name="WRUSERH6"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00800000" name="WRUSERH7"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x01000000" name="DPSOA0"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x02000000" name="DPSOA1"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x04000000" name="DPSOA2"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x08000000" name="DPSOA3"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x10000000" name="DPSOA4"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x20000000" name="DPSOA5"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x40000000" name="DPSOA6"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x80000000" name="DPSOA7"/>
        </register>
        <register caption="Protection Slave 0 Register 13" name="MATRIX_PSR13" offset="0x234" rw="RW" size="4">
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000001" name="LAUSERH0"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000002" name="LAUSERH1"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000004" name="LAUSERH2"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000008" name="LAUSERH3"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000010" name="LAUSERH4"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000020" name="LAUSERH5"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000040" name="LAUSERH6"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000080" name="LAUSERH7"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000100" name="RDUSERH0"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000200" name="RDUSERH1"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000400" name="RDUSERH2"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000800" name="RDUSERH3"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00001000" name="RDUSERH4"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00002000" name="RDUSERH5"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00004000" name="RDUSERH6"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00008000" name="RDUSERH7"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00010000" name="WRUSERH0"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00020000" name="WRUSERH1"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00040000" name="WRUSERH2"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00080000" name="WRUSERH3"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00100000" name="WRUSERH4"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00200000" name="WRUSERH5"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00400000" name="WRUSERH6"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00800000" name="WRUSERH7"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x01000000" name="DPSOA0"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x02000000" name="DPSOA1"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x04000000" name="DPSOA2"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x08000000" name="DPSOA3"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x10000000" name="DPSOA4"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x20000000" name="DPSOA5"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x40000000" name="DPSOA6"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x80000000" name="DPSOA7"/>
        </register>
