Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
        <register caption="Protected Region Top Slave 0 Register 8" name="MATRIX_PRTSR8" offset="0x2A0" rw="RW" size="4">
          <bitfield caption="HSELx Protected Region Top" mask="0x0000000F" name="PRTOP0"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000000F0" name="PRTOP1"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00000F00" name="PRTOP2"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0000F000" name="PRTOP3"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000F0000" name="PRTOP4"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00F00000" name="PRTOP5"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0F000000" name="PRTOP6"/>
          <bitfield caption="HSELx Protected Region Top" mask="0xF0000000" name="PRTOP7"/>
        </register>
        <register caption="Protected Region Top Slave 0 Register 9" name="MATRIX_PRTSR9" offset="0x2A4" rw="RW" size="4">
          <bitfield caption="HSELx Protected Region Top" mask="0x0000000F" name="PRTOP0"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000000F0" name="PRTOP1"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00000F00" name="PRTOP2"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0000F000" name="PRTOP3"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000F0000" name="PRTOP4"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00F00000" name="PRTOP5"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0F000000" name="PRTOP6"/>
          <bitfield caption="HSELx Protected Region Top" mask="0xF0000000" name="PRTOP7"/>
        </register>
        <register caption="Protected Region Top Slave 0 Register 10" name="MATRIX_PRTSR10" offset="0x2A8" rw="RW" size="4">
          <bitfield caption="HSELx Protected Region Top" mask="0x0000000F" name="PRTOP0"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000000F0" name="PRTOP1"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00000F00" name="PRTOP2"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0000F000" name="PRTOP3"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000F0000" name="PRTOP4"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00F00000" name="PRTOP5"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0F000000" name="PRTOP6"/>
          <bitfield caption="HSELx Protected Region Top" mask="0xF0000000" name="PRTOP7"/>
        </register>
        <register caption="Protected Region Top Slave 0 Register 11" name="MATRIX_PRTSR11" offset="0x2AC" rw="RW" size="4">
          <bitfield caption="HSELx Protected Region Top" mask="0x0000000F" name="PRTOP0"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000000F0" name="PRTOP1"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00000F00" name="PRTOP2"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0000F000" name="PRTOP3"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000F0000" name="PRTOP4"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00F00000" name="PRTOP5"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0F000000" name="PRTOP6"/>
          <bitfield caption="HSELx Protected Region Top" mask="0xF0000000" name="PRTOP7"/>
        </register>
        <register caption="Protected Region Top Slave 0 Register 12" name="MATRIX_PRTSR12" offset="0x2B0" rw="RW" size="4">
          <bitfield caption="HSELx Protected Region Top" mask="0x0000000F" name="PRTOP0"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000000F0" name="PRTOP1"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00000F00" name="PRTOP2"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0000F000" name="PRTOP3"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000F0000" name="PRTOP4"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00F00000" name="PRTOP5"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0F000000" name="PRTOP6"/>
          <bitfield caption="HSELx Protected Region Top" mask="0xF0000000" name="PRTOP7"/>
        </register>
        <register caption="Protected Region Top Slave 0 Register 13" name="MATRIX_PRTSR13" offset="0x2B4" rw="RW" size="4">
          <bitfield caption="HSELx Protected Region Top" mask="0x0000000F" name="PRTOP0"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000000F0" name="PRTOP1"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00000F00" name="PRTOP2"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0000F000" name="PRTOP3"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000F0000" name="PRTOP4"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00F00000" name="PRTOP5"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0F000000" name="PRTOP6"/>
          <bitfield caption="HSELx Protected Region Top" mask="0xF0000000" name="PRTOP7"/>
        </register>
        <register caption="Protected Region Top Slave 0 Register 14" name="MATRIX_PRTSR14" offset="0x2B8" rw="RW" size="4">
          <bitfield caption="HSELx Protected Region Top" mask="0x0000000F" name="PRTOP0"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000000F0" name="PRTOP1"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00000F00" name="PRTOP2"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0000F000" name="PRTOP3"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000F0000" name="PRTOP4"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00F00000" name="PRTOP5"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0F000000" name="PRTOP6"/>
          <bitfield caption="HSELx Protected Region Top" mask="0xF0000000" name="PRTOP7"/>
        </register>
