Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
        <register caption="Source Configuration Register 0 0" name="NMIC_SCFGxR0" offset="0x14" rw="RW" size="4">
          <bitfield caption="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8)" mask="0x00000003" name="GFSEL"/>
          <bitfield caption="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000010" name="GFEN"/>
          <bitfield caption="Polarity (POL bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000100" name="POL"/>
          <bitfield caption="Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000200" name="LVL"/>
          <bitfield caption="Source Enable" mask="0x00010000" name="EN"/>
          <bitfield caption="Interrupt Line Freeze" mask="0x80000000" name="FRZ"/>
        </register>
        <register caption="Source Configuration Register 0 1" name="NMIC_SCFGxR1" offset="0x18" rw="RW" size="4">
          <bitfield caption="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8)" mask="0x00000003" name="GFSEL"/>
          <bitfield caption="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000010" name="GFEN"/>
          <bitfield caption="Polarity (POL bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000100" name="POL"/>
          <bitfield caption="Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000200" name="LVL"/>
          <bitfield caption="Source Enable" mask="0x00010000" name="EN"/>
          <bitfield caption="Interrupt Line Freeze" mask="0x80000000" name="FRZ"/>
        </register>
        <register caption="Source Configuration Register 0 2" name="NMIC_SCFGxR2" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8)" mask="0x00000003" name="GFSEL"/>
          <bitfield caption="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000010" name="GFEN"/>
          <bitfield caption="Polarity (POL bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000100" name="POL"/>
          <bitfield caption="Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000200" name="LVL"/>
          <bitfield caption="Source Enable" mask="0x00010000" name="EN"/>
          <bitfield caption="Interrupt Line Freeze" mask="0x80000000" name="FRZ"/>
        </register>
        <register caption="Source Configuration Register 0 3" name="NMIC_SCFGxR3" offset="0x20" rw="RW" size="4">
          <bitfield caption="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8)" mask="0x00000003" name="GFSEL"/>
          <bitfield caption="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000010" name="GFEN"/>
          <bitfield caption="Polarity (POL bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000100" name="POL"/>
          <bitfield caption="Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000200" name="LVL"/>
          <bitfield caption="Source Enable" mask="0x00010000" name="EN"/>
          <bitfield caption="Interrupt Line Freeze" mask="0x80000000" name="FRZ"/>
        </register>
        <register caption="Source Configuration Register 0 4" name="NMIC_SCFGxR4" offset="0x24" rw="RW" size="4">
          <bitfield caption="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8)" mask="0x00000003" name="GFSEL"/>
          <bitfield caption="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000010" name="GFEN"/>
          <bitfield caption="Polarity (POL bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000100" name="POL"/>
          <bitfield caption="Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000200" name="LVL"/>
          <bitfield caption="Source Enable" mask="0x00010000" name="EN"/>
          <bitfield caption="Interrupt Line Freeze" mask="0x80000000" name="FRZ"/>
        </register>
        <register caption="Source Configuration Register 0 5" name="NMIC_SCFGxR5" offset="0x28" rw="RW" size="4">
          <bitfield caption="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8)" mask="0x00000003" name="GFSEL"/>
          <bitfield caption="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000010" name="GFEN"/>
          <bitfield caption="Polarity (POL bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000100" name="POL"/>
          <bitfield caption="Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000200" name="LVL"/>
          <bitfield caption="Source Enable" mask="0x00010000" name="EN"/>
          <bitfield caption="Interrupt Line Freeze" mask="0x80000000" name="FRZ"/>
        </register>
        <register caption="Source Configuration Register 0 6" name="NMIC_SCFGxR6" offset="0x2C" rw="RW" size="4">
          <bitfield caption="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8)" mask="0x00000003" name="GFSEL"/>
          <bitfield caption="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000010" name="GFEN"/>
          <bitfield caption="Polarity (POL bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000100" name="POL"/>
          <bitfield caption="Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000200" name="LVL"/>
          <bitfield caption="Source Enable" mask="0x00010000" name="EN"/>
          <bitfield caption="Interrupt Line Freeze" mask="0x80000000" name="FRZ"/>
        </register>
        <register caption="Source Configuration Register 0 7" name="NMIC_SCFGxR7" offset="0x30" rw="RW" size="4">
          <bitfield caption="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8)" mask="0x00000003" name="GFSEL"/>
          <bitfield caption="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000010" name="GFEN"/>
          <bitfield caption="Polarity (POL bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000100" name="POL"/>
          <bitfield caption="Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000200" name="LVL"/>
          <bitfield caption="Source Enable" mask="0x00010000" name="EN"/>
          <bitfield caption="Interrupt Line Freeze" mask="0x80000000" name="FRZ"/>
        </register>
