Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
        <register caption="Source Configuration Register 0 8" name="NMIC_SCFGxR8" offset="0x34" rw="RW" size="4">
          <bitfield caption="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8)" mask="0x00000003" name="GFSEL"/>
          <bitfield caption="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000010" name="GFEN"/>
          <bitfield caption="Polarity (POL bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000100" name="POL"/>
          <bitfield caption="Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8)" mask="0x00000200" name="LVL"/>
          <bitfield caption="Source Enable" mask="0x00010000" name="EN"/>
          <bitfield caption="Interrupt Line Freeze" mask="0x80000000" name="FRZ"/>
        </register>
        <register caption="Write Protection Mode Register" name="NMIC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Configuration Enable" mask="0x00000001" name="WPCFEN"/>
          <bitfield caption="Write Protection Interrupt Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="NMIC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="NMIC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Register Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Frozen Register Write Violation Status" mask="0x00000002" name="FZWVS"/>
          <bitfield caption="Busy Register Write Violation Status" mask="0x00000004" name="BSWVS"/>
          <bitfield caption="Write Violation Source" mask="0x0000FF00" name="WVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="NMIC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPCFEN and WPITEN bit. Always reads as 0." name="PASSWD" value="0x4E4D49"/>
      </value-group>
    </module>
    <module name="PIO" caption="Parallel Input/Output Controller" id="11264" version="K">
      <register-group name="PIO_GROUP" size="64">
        <register caption="PIO Mask Register" name="PIO_MSKR" offset="0x00" rw="RW" size="4">
          <bitfield caption="PIO Line 0 Mask" mask="0x00000001" name="MSK0" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 1 Mask" mask="0x00000002" name="MSK1" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 2 Mask" mask="0x00000004" name="MSK2" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 3 Mask" mask="0x00000008" name="MSK3" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 4 Mask" mask="0x00000010" name="MSK4" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 5 Mask" mask="0x00000020" name="MSK5" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 6 Mask" mask="0x00000040" name="MSK6" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 7 Mask" mask="0x00000080" name="MSK7" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 8 Mask" mask="0x00000100" name="MSK8" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 9 Mask" mask="0x00000200" name="MSK9" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 10 Mask" mask="0x00000400" name="MSK10" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 11 Mask" mask="0x00000800" name="MSK11" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 12 Mask" mask="0x00001000" name="MSK12" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 13 Mask" mask="0x00002000" name="MSK13" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 14 Mask" mask="0x00004000" name="MSK14" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 15 Mask" mask="0x00008000" name="MSK15" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 16 Mask" mask="0x00010000" name="MSK16" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 17 Mask" mask="0x00020000" name="MSK17" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 18 Mask" mask="0x00040000" name="MSK18" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 19 Mask" mask="0x00080000" name="MSK19" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 20 Mask" mask="0x00100000" name="MSK20" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 21 Mask" mask="0x00200000" name="MSK21" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 22 Mask" mask="0x00400000" name="MSK22" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 23 Mask" mask="0x00800000" name="MSK23" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 24 Mask" mask="0x01000000" name="MSK24" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 25 Mask" mask="0x02000000" name="MSK25" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 26 Mask" mask="0x04000000" name="MSK26" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 27 Mask" mask="0x08000000" name="MSK27" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 28 Mask" mask="0x10000000" name="MSK28" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 29 Mask" mask="0x20000000" name="MSK29" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 30 Mask" mask="0x40000000" name="MSK30" values="PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 31 Mask" mask="0x80000000" name="MSK31" values="PIO_MSKR0__MSKX"/>
        </register>
        <register caption="PIO Configuration Register" name="PIO_CFGR" offset="0x04" rw="RW" size="4">
          <bitfield caption="I/O Line Function" mask="0x00000007" name="FUNC" values="PIO_CFGR0__FUNC"/>
          <bitfield caption="Direction" mask="0x00000100" name="DIR" values="PIO_CFGR0__DIR"/>
          <bitfield caption="Pull-Up Enable" mask="0x00000200" name="PUEN" values="PIO_CFGR0__PUEN"/>
          <bitfield caption="Pull-Down Enable" mask="0x00000400" name="PDEN" values="PIO_CFGR0__PDEN"/>
          <bitfield caption="Open-Drain" mask="0x00004000" name="OPD" values="PIO_CFGR0__OPD"/>
          <bitfield caption="Schmitt Trigger" mask="0x00008000" name="SCHMITT" values="PIO_CFGR0__SCHMITT"/>
          <bitfield caption="Drive Strength" mask="0x00070000" name="DRVSTR" values="PIO_CFGR0__DRVSTR"/>
          <bitfield caption="Event Selection" mask="0x07000000" name="EVTSEL" values="PIO_CFGR0__EVTSEL"/>
          <bitfield caption="Physical Configuration Freeze Status (read-only)" mask="0x20000000" name="PCFS" values="PIO_CFGR0__PCFS"/>
          <bitfield caption="Interrupt Configuration Freeze Status (read-only)" mask="0x40000000" name="ICFS" values="PIO_CFGR0__ICFS"/>
        </register>
