Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
        <register caption="Generic Clock Status Register 2" name="PMC_GCSR2" offset="0x0198" rw="R" size="4">
          <bitfield caption="Generic Clock 64 Status" mask="0x00000001" name="GPID64"/>
          <bitfield caption="Generic Clock 65 Status" mask="0x00000002" name="GPID65"/>
          <bitfield caption="Generic Clock 66 Status" mask="0x00000004" name="GPID66"/>
          <bitfield caption="Generic Clock 67 Status" mask="0x00000008" name="GPID67"/>
          <bitfield caption="Generic Clock 68 Status" mask="0x00000010" name="GPID68"/>
          <bitfield caption="Generic Clock 69 Status" mask="0x00000020" name="GPID69"/>
          <bitfield caption="Generic Clock 70 Status" mask="0x00000040" name="GPID70"/>
          <bitfield caption="Generic Clock 71 Status" mask="0x00000080" name="GPID71"/>
          <bitfield caption="Generic Clock 72 Status" mask="0x00000100" name="GPID72"/>
          <bitfield caption="Generic Clock 73 Status" mask="0x00000200" name="GPID73"/>
          <bitfield caption="Generic Clock 74 Status" mask="0x00000400" name="GPID74"/>
          <bitfield caption="Generic Clock 75 Status" mask="0x00000800" name="GPID75"/>
          <bitfield caption="Generic Clock 76 Status" mask="0x00001000" name="GPID76"/>
          <bitfield caption="Generic Clock 77 Status" mask="0x00002000" name="GPID77"/>
          <bitfield caption="Generic Clock 78 Status" mask="0x00004000" name="GPID78"/>
          <bitfield caption="Generic Clock 79 Status" mask="0x00008000" name="GPID79"/>
          <bitfield caption="Generic Clock 80 Status" mask="0x00010000" name="GPID80"/>
          <bitfield caption="Generic Clock 81 Status" mask="0x00020000" name="GPID81"/>
          <bitfield caption="Generic Clock 82 Status" mask="0x00040000" name="GPID82"/>
          <bitfield caption="Generic Clock 83 Status" mask="0x00080000" name="GPID83"/>
          <bitfield caption="Generic Clock 84 Status" mask="0x00100000" name="GPID84"/>
          <bitfield caption="Generic Clock 85 Status" mask="0x00200000" name="GPID85"/>
          <bitfield caption="Generic Clock 86 Status" mask="0x00400000" name="GPID86"/>
          <bitfield caption="Generic Clock 87 Status" mask="0x00800000" name="GPID87"/>
          <bitfield caption="Generic Clock 88 Status" mask="0x01000000" name="GPID88"/>
          <bitfield caption="Generic Clock 89 Status" mask="0x02000000" name="GPID89"/>
          <bitfield caption="Generic Clock 90 Status" mask="0x04000000" name="GPID90"/>
          <bitfield caption="Generic Clock 91 Status" mask="0x08000000" name="GPID91"/>
          <bitfield caption="Generic Clock 92 Status" mask="0x10000000" name="GPID92"/>
          <bitfield caption="Generic Clock 93 Status" mask="0x20000000" name="GPID93"/>
          <bitfield caption="Generic Clock 94 Status" mask="0x40000000" name="GPID94"/>
          <bitfield caption="Generic Clock 95 Status" mask="0x80000000" name="GPID95"/>
        </register>
        <register caption="Generic Clock Status Register 3" name="PMC_GCSR3" offset="0x019C" rw="R" size="4">
          <bitfield caption="Generic Clock 96 Status" mask="0x00000001" name="GPID96"/>
          <bitfield caption="Generic Clock 97 Status" mask="0x00000002" name="GPID97"/>
          <bitfield caption="Generic Clock 98 Status" mask="0x00000004" name="GPID98"/>
          <bitfield caption="Generic Clock 99 Status" mask="0x00000008" name="GPID99"/>
          <bitfield caption="Generic Clock 100 Status" mask="0x00000010" name="GPID100"/>
          <bitfield caption="Generic Clock 101 Status" mask="0x00000020" name="GPID101"/>
          <bitfield caption="Generic Clock 102 Status" mask="0x00000040" name="GPID102"/>
          <bitfield caption="Generic Clock 103 Status" mask="0x00000080" name="GPID103"/>
          <bitfield caption="Generic Clock 104 Status" mask="0x00000100" name="GPID104"/>
          <bitfield caption="Generic Clock 105 Status" mask="0x00000200" name="GPID105"/>
          <bitfield caption="Generic Clock 106 Status" mask="0x00000400" name="GPID106"/>
          <bitfield caption="Generic Clock 107 Status" mask="0x00000800" name="GPID107"/>
          <bitfield caption="Generic Clock 108 Status" mask="0x00001000" name="GPID108"/>
          <bitfield caption="Generic Clock 109 Status" mask="0x00002000" name="GPID109"/>
          <bitfield caption="Generic Clock 110 Status" mask="0x00004000" name="GPID110"/>
          <bitfield caption="Generic Clock 111 Status" mask="0x00008000" name="GPID111"/>
          <bitfield caption="Generic Clock 112 Status" mask="0x00010000" name="GPID112"/>
          <bitfield caption="Generic Clock 113 Status" mask="0x00020000" name="GPID113"/>
          <bitfield caption="Generic Clock 114 Status" mask="0x00040000" name="GPID114"/>
          <bitfield caption="Generic Clock 115 Status" mask="0x00080000" name="GPID115"/>
          <bitfield caption="Generic Clock 116 Status" mask="0x00100000" name="GPID116"/>
          <bitfield caption="Generic Clock 117 Status" mask="0x00200000" name="GPID117"/>
          <bitfield caption="Generic Clock 118 Status" mask="0x00400000" name="GPID118"/>
          <bitfield caption="Generic Clock 119 Status" mask="0x00800000" name="GPID119"/>
          <bitfield caption="Generic Clock 120 Status" mask="0x01000000" name="GPID120"/>
          <bitfield caption="Generic Clock 122 Status" mask="0x06000000" name="GPID122"/>
          <bitfield caption="Generic Clock 123 Status" mask="0x08000000" name="GPID123"/>
          <bitfield caption="Generic Clock 124 Status" mask="0x10000000" name="GPID124"/>
          <bitfield caption="Generic Clock 125 Status" mask="0x20000000" name="GPID125"/>
          <bitfield caption="Generic Clock 126 Status" mask="0x40000000" name="GPID126"/>
          <bitfield caption="Generic Clock 127 Status" mask="0x80000000" name="GPID127"/>
        </register>
        <register caption="Oscillator Control Register 2" name="PMC_OSC2" offset="0x01B0" rw="RW" size="4">
          <bitfield caption="Enable" mask="0x00000001" name="EN"/>
          <bitfield caption="2nd Oscillator Frequency Selection" mask="0x00000030" name="OSCRCF" values="PMC_OSC2__OSCRCF"/>
          <bitfield caption="Enable Calibration Register Write" mask="0x00000100" name="EN_WR_CALIB"/>
          <bitfield caption="Register Write Access Password" mask="0x00FF0000" name="KEY" values="PMC_OSC2__KEY"/>
        </register>
