Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
        <register caption="Oscillator Calibration Register 2" name="PMC_OCR2" offset="0x01B4" rw="RW" size="4">
          <bitfield caption="Main RC Oscillator Calibration Bits for 4 MHz" mask="0x0000007F" name="CAL4"/>
          <bitfield caption="Selection of Main RC Oscillator Calibration Bits for 4 MHz" mask="0x00000080" name="SEL4"/>
          <bitfield caption="Main RC Oscillator Calibration Bits for 8 MHz" mask="0x00007F00" name="CAL8"/>
          <bitfield caption="Selection of Main RC Oscillator Calibration Bits for 8 MHz" mask="0x00008000" name="SEL8"/>
          <bitfield caption="Main RC Oscillator Calibration Bits for 10 MHz" mask="0x007F0000" name="CAL10"/>
          <bitfield caption="Selection of Main RC Oscillator Calibration Bits for 10 MHz" mask="0x00800000" name="SEL10"/>
          <bitfield caption="Main RC Oscillator Calibration Bits for 12 MHz" mask="0x7F000000" name="CAL12"/>
          <bitfield caption="Selection of Main RC Oscillator Calibration Bits for 12 MHz" mask="0x80000000" name="SEL12"/>
        </register>
      </register-group>
      <value-group caption="" name="CKGR_MOR__MOSCRCF">
        <value caption="The RC oscillator frequency is at 4 MHz" name="_4_MHZ" value="0x0"/>
        <value caption="The RC oscillator frequency is at 8 MHz" name="_8_MHZ" value="0x1"/>
        <value caption="The RC oscillator frequency is at 10 MHz" name="_10_MHZ" value="0x2"/>
        <value caption="The RC oscillator frequency is at 12 MHz" name="_12_MHZ" value="0x3"/>
      </value-group>
      <value-group caption="" name="CKGR_MOR__KEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0x37"/>
      </value-group>
      <value-group caption="" name="CKGR_PLLAR__DIVA">
        <value caption="PLLA is disabled." name="_0" value="0"/>
        <value caption="Divider is bypassed (divide by 1) and PLLA is enabled." name="BYPASS" value="1"/>
      </value-group>
      <value-group caption="" name="CKGR_PLLAR__FREQ_VCO">
        <value caption="Frequency range: 40-80 MHz" name="VCO0" value="0x0"/>
        <value caption="Frequency range: 70-150 MHz" name="VCO1" value="0x1"/>
        <value caption="Frequency range: 125-275 MHz" name="VCO2" value="0x2"/>
        <value caption="Frequency range: 250-450 MHz" name="VCO3" value="0x3"/>
      </value-group>
      <value-group caption="" name="CKGR_PLLBR__DIVB">
        <value caption="PLLBis disabled." name="_0" value="0"/>
        <value caption="Divider is bypassed (divide by 1) and PLLB is enabled." name="BYPASS" value="1"/>
      </value-group>
      <value-group caption="" name="CKGR_PLLBR__FREQ_VCO">
        <value caption="Frequency range: 40-80 MHz" name="VCO0" value="0x0"/>
        <value caption="Frequency range: 70-150 MHz" name="VCO1" value="0x1"/>
        <value caption="Frequency range: 125-275 MHz" name="VCO2" value="0x2"/>
        <value caption="Frequency range: 250-450 MHz" name="VCO3" value="0x3"/>
      </value-group>
      <value-group caption="" name="CKGR_PLLBR__SRCB">
        <value caption="MAINCK is the source clock of PLLB." name="MAINCK" value="0x0"/>
        <value caption="RC2CK is the source clock of PLLB." name="RC2CK" value="0x2"/>
      </value-group>
      <value-group caption="" name="PMC_MCKR__CSS">
        <value caption="MD_SLCK is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="MAINCK is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLACK is selected" name="PLLA_CLK" value="0x2"/>
      </value-group>
      <value-group caption="" name="PMC_MCKR__PRES">
        <value caption="Selected clock" name="CLK_1" value="0x0"/>
        <value caption="Selected clock divided by 2" name="CLK_2" value="0x1"/>
        <value caption="Selected clock divided by 4" name="CLK_4" value="0x2"/>
        <value caption="Selected clock divided by 8" name="CLK_8" value="0x3"/>
        <value caption="Selected clock divided by 16" name="CLK_16" value="0x4"/>
        <value caption="Selected clock divided by 32" name="CLK_32" value="0x5"/>
        <value caption="Selected clock divided by 64" name="CLK_64" value="0x6"/>
      </value-group>
      <value-group caption="" name="PMC_MCKR__MDIV">
        <value caption="MCK is FCLK divided by 1." name="EQ_PCK" value="0"/>
        <value caption="MCK is FCLK divided by 2." name="PCK_DIV2" value="1"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__CSS">
        <value caption="MD_SLCK is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="MAINCK is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLACK is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="PLLBCKDIV is selected" name="PLLB_CLK" value="0x3"/>
        <value caption="MCK is selected" name="MCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="PMC_PLL_CFG__OUTCUR_PLLA">
        <value caption="0.5 mA" name="ICP0" value="0x0"/>
        <value caption="0.75 mA" name="ICP1" value="0x1"/>
        <value caption="1 mA" name="ICP2" value="0x2"/>
        <value caption="1.25 mA" name="ICP3" value="0x3"/>
      </value-group>
      <value-group caption="" name="PMC_PLL_CFG__SCA">
        <value caption="20 pF" name="SC_VAL_20p" value="0x0"/>
        <value caption="40 pF" name="SC_VAL_40p" value="0x1"/>
        <value caption="30 pF" name="SC_VAL_30p" value="0x2"/>
        <value caption="60 pF" name="SC_VAL_60p" value="0x3"/>
      </value-group>
      <value-group caption="" name="PMC_PLL_CFG__SRA">
        <value caption="24 Ohms" name="SR_VAL_24K" value="0x0"/>
        <value caption="6 Ohms" name="SR_VAL_6K" value="0x1"/>
        <value caption="3 Ohms" name="SR_VAL_3K" value="0x2"/>
        <value caption="12 Ohms" name="SR_VAL_12K" value="0x3"/>
      </value-group>
      <value-group caption="" name="PMC_PLL_CFG__OUTCUR_PLLB">
        <value caption="0.5 mA" name="ICP0" value="0x0"/>
        <value caption="0.75 mA" name="ICP1" value="0x1"/>
        <value caption="1 mA" name="ICP2" value="0x2"/>
        <value caption="1.25 mA" name="ICP3" value="0x3"/>
      </value-group>
      <value-group caption="" name="PMC_PLL_CFG__SCB">
        <value caption="20 pF" name="SC_VAL_20p" value="0x0"/>
        <value caption="40 pF" name="SC_VAL_40p" value="0x1"/>
        <value caption="30 pF" name="SC_VAL_30p" value="0x2"/>
        <value caption="60 pF" name="SC_VAL_60p" value="0x3"/>
      </value-group>
      <value-group caption="" name="PMC_PLL_CFG__SRB">
        <value caption="24 Ohms" name="SR_VAL_24K" value="0x0"/>
        <value caption="6 Ohms" name="SR_VAL_6K" value="0x1"/>
        <value caption="3 Ohms" name="SR_VAL_3K" value="0x2"/>
        <value caption="12 Ohms" name="SR_VAL_12K" value="0x3"/>
      </value-group>
      <value-group caption="" name="PMC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x504D43"/>
      </value-group>
      <value-group caption="" name="PMC_PCR__GCLKCSS">
        <value caption="MD_SLCK is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="MAINCK is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLACK is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="PLLBCK is selected" name="PLLB_CLK" value="0x3"/>
        <value caption="MCK is selected" name="MCK_CLK" value="0x4"/>
        <value caption="RC2 is selected" name="MCK_RC2" value="0x5"/>
      </value-group>
      <value-group caption="" name="PMC_OSC2__OSCRCF">
        <value caption="The 2nd RC oscillator frequency is at 4 MHZ" name="_4_MHZ" value="0x0"/>
        <value caption="The 2nd RC oscillator frequency is at 8 MHZ" name="_8_MHZ" value="0x1"/>
        <value caption="The 2nd RC oscillator frequency is at 10 MHZ" name="_10_MHZ" value="0x2"/>
        <value caption="The 2nd RC oscillator frequency is at 12 MHZ" name="_12_MHZ" value="0x3"/>
      </value-group>
