Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
      <value-group caption="" name="PMC_OSC2__KEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0x37"/>
      </value-group>
    </module>
    <module name="PWM" caption="Pulse Width Modulation Controller" id="6343" version="ZB">
      <register-group name="PWM_CH_NUM" size="32">
        <register caption="PWM Channel Mode Register" name="PWM_CMR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Channel Pre-scaler" mask="0x0000000F" name="CPRE" values="PWM_CMR0__CPRE"/>
          <bitfield caption="Channel Alignment" mask="0x00000100" name="CALG" values="PWM_CMR0__CALG"/>
          <bitfield caption="Channel Polarity" mask="0x00000200" name="CPOL" values="PWM_CMR0__CPOL"/>
          <bitfield caption="Counter Event Selection" mask="0x00000400" name="CES" values="PWM_CMR0__CES"/>
          <bitfield caption="Update Selection" mask="0x00000800" name="UPDS" values="PWM_CMR0__UPDS"/>
          <bitfield caption="Disabled Polarity Inverted" mask="0x00001000" name="DPOLI"/>
          <bitfield caption="Timer Counter Trigger Selection" mask="0x00002000" name="TCTS"/>
          <bitfield caption="Dead-Time Generator Enable" mask="0x00010000" name="DTE"/>
          <bitfield caption="Dead-Time PWMHx Output Inverted" mask="0x00020000" name="DTHI"/>
          <bitfield caption="Dead-Time PWMLx Output Inverted" mask="0x00040000" name="DTLI"/>
          <bitfield caption="Push-Pull Mode" mask="0x00080000" name="PPM"/>
        </register>
        <register caption="PWM Channel Duty Cycle Register" name="PWM_CDTY" offset="0x04" rw="RW" size="4">
          <bitfield caption="Channel Duty-Cycle" mask="0x00FFFFFF" name="CDTY"/>
        </register>
        <register caption="PWM Channel Duty Cycle Update Register" name="PWM_CDTYUPD" offset="0x08" rw="W" size="4">
          <bitfield caption="Channel Duty-Cycle Update" mask="0x00FFFFFF" name="CDTYUPD"/>
        </register>
        <register caption="PWM Channel Period Register" name="PWM_CPRD" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Channel Period" mask="0x00FFFFFF" name="CPRD"/>
        </register>
        <register caption="PWM Channel Period Update Register" name="PWM_CPRDUPD" offset="0x10" rw="W" size="4">
          <bitfield caption="Channel Period Update" mask="0x00FFFFFF" name="CPRDUPD"/>
        </register>
        <register caption="PWM Channel Counter Register" name="PWM_CCNT" offset="0x14" rw="R" size="4">
          <bitfield caption="Channel Counter Register" mask="0x00FFFFFF" name="CNT"/>
        </register>
        <register caption="PWM Channel Dead Time Register" name="PWM_DT" offset="0x18" rw="RW" size="4">
          <bitfield caption="Dead-Time Value for PWMHx Output" mask="0x0000FFFF" name="DTH"/>
          <bitfield caption="Dead-Time Value for PWMLx Output" mask="0xFFFF0000" name="DTL"/>
        </register>
        <register caption="PWM Channel Dead Time Update Register" name="PWM_DTUPD" offset="0x1C" rw="W" size="4">
          <bitfield caption="Dead-Time Value Update for PWMHx Output" mask="0x0000FFFF" name="DTHUPD"/>
          <bitfield caption="Dead-Time Value Update for PWMLx Output" mask="0xFFFF0000" name="DTLUPD"/>
        </register>
      </register-group>
      <register-group name="PWM_CMP" size="16">
        <register caption="PWM Comparison 0 Value Register" name="PWM_CMPV" offset="0x00" rw="RW" size="4">
          <bitfield caption="Comparison x Value" mask="0x00FFFFFF" name="CV"/>
          <bitfield caption="Comparison x Value Mode" mask="0x01000000" name="CVM" values="PWM_CMPV0__CVM"/>
        </register>
        <register caption="PWM Comparison 0 Value Update Register" name="PWM_CMPVUPD" offset="0x04" rw="W" size="4">
          <bitfield caption="Comparison x Value Update" mask="0x00FFFFFF" name="CVUPD"/>
          <bitfield caption="Comparison x Value Mode Update" mask="0x01000000" name="CVMUPD"/>
        </register>
        <register caption="PWM Comparison 0 Mode Register" name="PWM_CMPM" offset="0x08" rw="RW" size="4">
          <bitfield caption="Comparison x Enable" mask="0x00000001" name="CEN"/>
          <bitfield caption="Comparison x Trigger" mask="0x000000F0" name="CTR"/>
          <bitfield caption="Comparison x Period" mask="0x00000F00" name="CPR"/>
          <bitfield caption="Comparison x Period Counter" mask="0x0000F000" name="CPRCNT"/>
          <bitfield caption="Comparison x Update Period" mask="0x000F0000" name="CUPR"/>
          <bitfield caption="Comparison x Update Period Counter" mask="0x00F00000" name="CUPRCNT"/>
        </register>
        <register caption="PWM Comparison 0 Mode Update Register" name="PWM_CMPMUPD" offset="0x0C" rw="W" size="4">
          <bitfield caption="Comparison x Enable Update" mask="0x00000001" name="CENUPD"/>
          <bitfield caption="Comparison x Trigger Update" mask="0x000000F0" name="CTRUPD"/>
          <bitfield caption="Comparison x Period Update" mask="0x00000F00" name="CPRUPD"/>
          <bitfield caption="Comparison x Update Period Update" mask="0x000F0000" name="CUPRUPD"/>
        </register>
      </register-group>
      <register-group name="PWM">
        <register caption="PWM Clock Register" name="PWM_CLK" offset="0x00" rw="RW" size="4">
          <bitfield caption="CLKA Divide Factor" mask="0x000000FF" name="DIVA" values="PWM_CLK__DIVA"/>
          <bitfield caption="CLKA Source Clock Selection" mask="0x00000F00" name="PREA" values="PWM_CLK__PREA"/>
          <bitfield caption="CLKB Divide Factor" mask="0x00FF0000" name="DIVB" values="PWM_CLK__DIVB"/>
          <bitfield caption="CLKB Source Clock Selection" mask="0x0F000000" name="PREB" values="PWM_CLK__PREB"/>
        </register>
        <register caption="PWM Enable Register" name="PWM_ENA" offset="0x04" rw="W" size="4">
          <bitfield caption="Channel ID" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Channel ID" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Channel ID" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Channel ID" mask="0x00000008" name="CHID3"/>
        </register>
        <register caption="PWM Disable Register" name="PWM_DIS" offset="0x08" rw="W" size="4">
          <bitfield caption="Channel ID" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Channel ID" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Channel ID" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Channel ID" mask="0x00000008" name="CHID3"/>
        </register>
        <register caption="PWM Status Register" name="PWM_SR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Channel ID" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Channel ID" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Channel ID" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Channel ID" mask="0x00000008" name="CHID3"/>
        </register>
        <register caption="PWM Interrupt Enable Register 1" name="PWM_IER1" offset="0x10" rw="W" size="4">
          <bitfield caption="Counter Event on Channel 0 Interrupt Enable" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Counter Event on Channel 1 Interrupt Enable" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Counter Event on Channel 2 Interrupt Enable" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Counter Event on Channel 3 Interrupt Enable" mask="0x00000008" name="CHID3"/>
          <bitfield caption="Fault Protection Trigger on Channel 0 Interrupt Enable" mask="0x00010000" name="FCHID0"/>
          <bitfield caption="Fault Protection Trigger on Channel 1 Interrupt Enable" mask="0x00020000" name="FCHID1"/>
          <bitfield caption="Fault Protection Trigger on Channel 2 Interrupt Enable" mask="0x00040000" name="FCHID2"/>
          <bitfield caption="Fault Protection Trigger on Channel 3 Interrupt Enable" mask="0x00080000" name="FCHID3"/>
        </register>
