Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
        <register caption="Mode Register" name="SHA_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Start Mode" mask="0x00000003" name="SMOD" values="SHA_MR__SMOD"/>
          <bitfield caption="User Initial Hash Value Registers" mask="0x00000020" name="UIHV"/>
          <bitfield caption="User Initial or Expected Hash Value Registers" mask="0x00000040" name="UIEHV"/>
          <bitfield caption="SHA Algorithm" mask="0x00000F00" name="ALGO" values="SHA_MR__ALGO"/>
          <bitfield caption="Dual Input Buffer" mask="0x00010000" name="DUALBUFF" values="SHA_MR__DUALBUFF"/>
          <bitfield caption="Hash Check" mask="0x03000000" name="CHECK" values="SHA_MR__CHECK"/>
          <bitfield caption="Check Counter" mask="0xF0000000" name="CHKCNT"/>
        </register>
        <register caption="Interrupt Enable Register" name="SHA_IER" offset="0x10" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Enable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Enable" mask="0x00000100" name="URAD"/>
          <bitfield caption="Check Done Interrupt Enable" mask="0x00010000" name="CHECKF"/>
          <bitfield caption="Safety Event Interrupt Enable" mask="0x01000000" name="SECE"/>
        </register>
        <register caption="Interrupt Disable Register" name="SHA_IDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Disable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Disable" mask="0x00000100" name="URAD"/>
          <bitfield caption="Check Done Interrupt Disable" mask="0x00010000" name="CHECKF"/>
          <bitfield caption="Safety Event Interrupt Disable" mask="0x01000000" name="SECE"/>
        </register>
        <register caption="Interrupt Mask Register" name="SHA_IMR" offset="0x18" rw="R" size="4">
          <bitfield caption="Data Ready Interrupt Mask" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Mask" mask="0x00000100" name="URAD"/>
          <bitfield caption="Check Done Interrupt Mask" mask="0x00010000" name="CHECKF"/>
          <bitfield caption="Safety Event Interrupt Mask" mask="0x01000000" name="SECE"/>
        </register>
        <register caption="Interrupt Status Register" name="SHA_ISR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Data Ready (cleared by writing a 1 to bit SWRST or START in SHA_CR, or by reading SHA_IODATARx)" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Input Data Register Write Ready" mask="0x00000010" name="WRDY"/>
          <bitfield caption="Unspecified Register Access Detection Status (cleared by writing a 1 to SWRST bit in SHA_CR)" mask="0x00000100" name="URAD"/>
          <bitfield caption="Unspecified Register Access Type (cleared by writing a 1 to SWRST bit in SHA_CR)" mask="0x00007000" name="URAT"/>
          <bitfield caption="Check Done Status (cleared by writing START or SWRST bits in SHA_CR or by reading SHA_IODATARx)" mask="0x00010000" name="CHECKF"/>
          <bitfield caption="Check Status (cleared by writing START or SWRST bits in SHA_CR or by reading SHA_IODATARx)" mask="0x00F00000" name="CHKST"/>
          <bitfield caption="Security and/or Safety Event" mask="0x01000000" name="SECE"/>
        </register>
        <register caption="Message Size Register" name="SHA_MSR" offset="0x20" rw="RW" size="4">
          <bitfield caption="Message Size" mask="0xFFFFFFFF" name="MSGSIZE"/>
        </register>
        <register caption="Bytes Count Register" name="SHA_BCR" offset="0x30" rw="RW" size="4">
          <bitfield caption="Remaining Byte Count Before Auto Padding" mask="0xFFFFFFFF" name="BYTCNT"/>
        </register>
        <register caption="Input Data 0 Register 0" name="SHA_IDATAR0" offset="0x40" rw="W" size="4">
          <bitfield caption="Input Data" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Input Data 0 Register 1" name="SHA_IDATAR1" offset="0x44" rw="W" size="4">
          <bitfield caption="Input Data" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Input Data 0 Register 2" name="SHA_IDATAR2" offset="0x48" rw="W" size="4">
          <bitfield caption="Input Data" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Input Data 0 Register 3" name="SHA_IDATAR3" offset="0x4C" rw="W" size="4">
          <bitfield caption="Input Data" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Input Data 0 Register 4" name="SHA_IDATAR4" offset="0x50" rw="W" size="4">
          <bitfield caption="Input Data" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Input Data 0 Register 5" name="SHA_IDATAR5" offset="0x54" rw="W" size="4">
          <bitfield caption="Input Data" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Input Data 0 Register 6" name="SHA_IDATAR6" offset="0x58" rw="W" size="4">
          <bitfield caption="Input Data" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Input Data 0 Register 7" name="SHA_IDATAR7" offset="0x5C" rw="W" size="4">
          <bitfield caption="Input Data" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Input Data 0 Register 8" name="SHA_IDATAR8" offset="0x60" rw="W" size="4">
          <bitfield caption="Input Data" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Input Data 0 Register 9" name="SHA_IDATAR9" offset="0x64" rw="W" size="4">
          <bitfield caption="Input Data" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Input Data 0 Register 10" name="SHA_IDATAR10" offset="0x68" rw="W" size="4">
          <bitfield caption="Input Data" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Input Data 0 Register 11" name="SHA_IDATAR11" offset="0x6C" rw="W" size="4">
          <bitfield caption="Input Data" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Input Data 0 Register 12" name="SHA_IDATAR12" offset="0x70" rw="W" size="4">
          <bitfield caption="Input Data" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Input Data 0 Register 13" name="SHA_IDATAR13" offset="0x74" rw="W" size="4">
          <bitfield caption="Input Data" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Input Data 0 Register 14" name="SHA_IDATAR14" offset="0x78" rw="W" size="4">
          <bitfield caption="Input Data" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Input Data 0 Register 15" name="SHA_IDATAR15" offset="0x7C" rw="W" size="4">
          <bitfield caption="Input Data" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Input/Output Data 0 Register 0" name="SHA_IODATAR0" offset="0x80" rw="RW" size="4">
          <bitfield caption="Input/Output Data" mask="0xFFFFFFFF" name="IODATA"/>
        </register>
