Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
      <value-group caption="" name="SHA_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN,WPITEN,WPCREN bits.Always reads as 0." name="PASSWD" value="0x534841"/>
      </value-group>
    </module>
    <module name="SPW" caption="SpW" id="44126" version="A">
      <register-group name="SPW">
        <register caption="SpW Router Status" name="SPW_ROUTER_STS" offset="0x0000" rw="R" size="4">
          <bitfield caption="Destination addr" mask="0x0000001F" name="DEST"/>
          <bitfield caption="Source address" mask="0x00001F00" name="SOURCE"/>
          <bitfield caption="Router byte" mask="0x00FF0000" name="BYTE"/>
          <bitfield caption="Packet Count" mask="0xFF000000" name="COUNT"/>
        </register>
        <register caption="SpW Router Config" name="SPW_ROUTER_CFG" offset="0x0004" rw="RW" size="4">
          <bitfield caption="LA Routing Enable" mask="0x00000001" name="LAENA"/>
          <bitfield caption="Fallback Routing" mask="0x00000002" name="FALLBACK"/>
          <bitfield caption="Disable Timeout" mask="0x00000004" name="DISTIMEOUT"/>
        </register>
        <register caption="SpW Router Timeout" name="SPW_ROUTER_TIMEOUT" offset="0x0008" rw="R" size="4">
          <bitfield caption="Physical Address" mask="0x0000001F" name="ADDR"/>
          <bitfield caption="Locked" mask="0x80000000" name="LOCKED"/>
        </register>
        <register caption="SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32)" name="SPW_ROUTER_TABLE" offset="0x80" rw="RW" size="4" count="224">
          <bitfield caption="Address" mask="0x0000001F" name="ADDR"/>
          <bitfield caption="Delete Header Byte" mask="0x00000100" name="DELHEAD"/>
        </register>
        <register caption="SpW Link 1 Pending Read Masked Interrupt" name="SPW_LINK1_PI_RM" offset="0x400" rw="R" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
        <register caption="SpW Link 1 Pending Read and Clear Masked Interrupt" name="SPW_LINK1_PI_RCM" offset="0x404" rw="R" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
        <register caption="SpW Link 1 Pending Read Interrupt" name="SPW_LINK1_PI_R" offset="0x408" rw="R" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
        <register caption="SpW Link 1 Pending Read, Clear and Enabed Interrupt" name="SPW_LINK1_PI_RCS" offset="0x40C" rw="RW" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
        <register caption="SpW Link 1 Interrupt Mask" name="SPW_LINK1_IM" offset="0x410" rw="RW" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
