Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
        <register caption="SpW Link 1 Distributed Interrupt Set Mask" name="SPW_LINK1_DISTINTIM_S" offset="0x458" rw="W" size="4">
          <bitfield caption="Distributed Interrupt mask" mask="0x00000001" name="DI0"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000002" name="DI1"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000004" name="DI2"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000008" name="DI3"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000010" name="DI4"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000020" name="DI5"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000040" name="DI6"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000080" name="DI7"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000100" name="DI8"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000200" name="DI9"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000400" name="DI10"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000800" name="DI11"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00001000" name="DI12"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00002000" name="DI13"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00004000" name="DI14"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00008000" name="DI15"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00010000" name="DI16"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00020000" name="DI17"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00040000" name="DI18"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00080000" name="DI19"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00100000" name="DI20"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00200000" name="DI21"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00400000" name="DI22"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00800000" name="DI23"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x01000000" name="DI24"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x02000000" name="DI25"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x04000000" name="DI26"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x08000000" name="DI27"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x10000000" name="DI28"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x20000000" name="DI29"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x40000000" name="DI30"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x80000000" name="DI31"/>
        </register>
        <register caption="SpW Link 1 Distributed Interrupt Clear Mask" name="SPW_LINK1_DISTINTIM_C" offset="0x45C" rw="W" size="4">
          <bitfield caption="Distributed Interrupt mask" mask="0x00000001" name="DI0"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000002" name="DI1"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000004" name="DI2"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000008" name="DI3"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000010" name="DI4"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000020" name="DI5"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000040" name="DI6"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000080" name="DI7"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000100" name="DI8"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000200" name="DI9"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000400" name="DI10"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000800" name="DI11"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00001000" name="DI12"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00002000" name="DI13"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00004000" name="DI14"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00008000" name="DI15"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00010000" name="DI16"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00020000" name="DI17"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00040000" name="DI18"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00080000" name="DI19"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00100000" name="DI20"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00200000" name="DI21"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00400000" name="DI22"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00800000" name="DI23"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x01000000" name="DI24"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x02000000" name="DI25"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x04000000" name="DI26"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x08000000" name="DI27"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x10000000" name="DI28"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x20000000" name="DI29"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x40000000" name="DI30"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x80000000" name="DI31"/>
        </register>
        <register caption="SpW Link 1 Distributed Interrupt Acknowledge Pending Read Masked Interrupt" name="SPW_LINK1_DISTACKPI_RM" offset="0x460" rw="R" size="4">
          <bitfield caption="Distributed Acknowledge" mask="0x00000001" name="DA0"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000002" name="DA1"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000004" name="DA2"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000008" name="DA3"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000010" name="DA4"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000020" name="DA5"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000040" name="DA6"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000080" name="DA7"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000100" name="DA8"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000200" name="DA9"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000400" name="DA10"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000800" name="DA11"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00001000" name="DA12"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00002000" name="DA13"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00004000" name="DA14"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00008000" name="DA15"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00010000" name="DA16"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00020000" name="DA17"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00040000" name="DA18"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00080000" name="DA19"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00100000" name="DA20"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00200000" name="DA21"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00400000" name="DA22"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00800000" name="DA23"/>
          <bitfield caption="Distributed Acknowledge" mask="0x01000000" name="DA24"/>
          <bitfield caption="Distributed Acknowledge" mask="0x02000000" name="DA25"/>
          <bitfield caption="Distributed Acknowledge" mask="0x04000000" name="DA26"/>
          <bitfield caption="Distributed Acknowledge" mask="0x08000000" name="DA27"/>
          <bitfield caption="Distributed Acknowledge" mask="0x10000000" name="DA28"/>
          <bitfield caption="Distributed Acknowledge" mask="0x20000000" name="DA29"/>
          <bitfield caption="Distributed Acknowledge" mask="0x40000000" name="DA30"/>
          <bitfield caption="Distributed Acknowledge" mask="0x80000000" name="DA31"/>
        </register>
        <register caption="SpW Link 1 Distributed Interrupt Acknowledge Pending Read and Clear Masked Interrupt" name="SPW_LINK1_DISTACKPI_RCM" offset="0x464" rw="R" size="4">
          <bitfield caption="Distributed Acknowledge" mask="0x00000001" name="DA0"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000002" name="DA1"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000004" name="DA2"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000008" name="DA3"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000010" name="DA4"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000020" name="DA5"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000040" name="DA6"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000080" name="DA7"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000100" name="DA8"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000200" name="DA9"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000400" name="DA10"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000800" name="DA11"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00001000" name="DA12"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00002000" name="DA13"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00004000" name="DA14"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00008000" name="DA15"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00010000" name="DA16"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00020000" name="DA17"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00040000" name="DA18"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00080000" name="DA19"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00100000" name="DA20"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00200000" name="DA21"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00400000" name="DA22"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00800000" name="DA23"/>
          <bitfield caption="Distributed Acknowledge" mask="0x01000000" name="DA24"/>
          <bitfield caption="Distributed Acknowledge" mask="0x02000000" name="DA25"/>
          <bitfield caption="Distributed Acknowledge" mask="0x04000000" name="DA26"/>
          <bitfield caption="Distributed Acknowledge" mask="0x08000000" name="DA27"/>
          <bitfield caption="Distributed Acknowledge" mask="0x10000000" name="DA28"/>
          <bitfield caption="Distributed Acknowledge" mask="0x20000000" name="DA29"/>
          <bitfield caption="Distributed Acknowledge" mask="0x40000000" name="DA30"/>
          <bitfield caption="Distributed Acknowledge" mask="0x80000000" name="DA31"/>
        </register>
        <register caption="SpW Link 1 Distributed Interrupt Acknowledge Pending Read Interrupt" name="SPW_LINK1_DISTACKPI_R" offset="0x468" rw="R" size="4">
          <bitfield caption="Distributed Acknowledge" mask="0x00000001" name="DA0"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000002" name="DA1"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000004" name="DA2"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000008" name="DA3"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000010" name="DA4"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000020" name="DA5"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000040" name="DA6"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000080" name="DA7"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000100" name="DA8"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000200" name="DA9"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000400" name="DA10"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000800" name="DA11"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00001000" name="DA12"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00002000" name="DA13"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00004000" name="DA14"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00008000" name="DA15"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00010000" name="DA16"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00020000" name="DA17"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00040000" name="DA18"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00080000" name="DA19"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00100000" name="DA20"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00200000" name="DA21"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00400000" name="DA22"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00800000" name="DA23"/>
          <bitfield caption="Distributed Acknowledge" mask="0x01000000" name="DA24"/>
          <bitfield caption="Distributed Acknowledge" mask="0x02000000" name="DA25"/>
          <bitfield caption="Distributed Acknowledge" mask="0x04000000" name="DA26"/>
          <bitfield caption="Distributed Acknowledge" mask="0x08000000" name="DA27"/>
          <bitfield caption="Distributed Acknowledge" mask="0x10000000" name="DA28"/>
          <bitfield caption="Distributed Acknowledge" mask="0x20000000" name="DA29"/>
          <bitfield caption="Distributed Acknowledge" mask="0x40000000" name="DA30"/>
          <bitfield caption="Distributed Acknowledge" mask="0x80000000" name="DA31"/>
        </register>
        <register caption="SpW Link 1 Distributed Interrupt Acknowledge Pending Read and Clear Interrupt" name="SPW_LINK1_DISTACKPI_RCS" offset="0x46C" rw="RW" size="4">
          <bitfield caption="Distributed Acknowledge" mask="0x00000001" name="DA0"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000002" name="DA1"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000004" name="DA2"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000008" name="DA3"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000010" name="DA4"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000020" name="DA5"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000040" name="DA6"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000080" name="DA7"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000100" name="DA8"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000200" name="DA9"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000400" name="DA10"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000800" name="DA11"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00001000" name="DA12"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00002000" name="DA13"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00004000" name="DA14"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00008000" name="DA15"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00010000" name="DA16"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00020000" name="DA17"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00040000" name="DA18"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00080000" name="DA19"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00100000" name="DA20"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00200000" name="DA21"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00400000" name="DA22"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00800000" name="DA23"/>
          <bitfield caption="Distributed Acknowledge" mask="0x01000000" name="DA24"/>
          <bitfield caption="Distributed Acknowledge" mask="0x02000000" name="DA25"/>
          <bitfield caption="Distributed Acknowledge" mask="0x04000000" name="DA26"/>
          <bitfield caption="Distributed Acknowledge" mask="0x08000000" name="DA27"/>
          <bitfield caption="Distributed Acknowledge" mask="0x10000000" name="DA28"/>
          <bitfield caption="Distributed Acknowledge" mask="0x20000000" name="DA29"/>
          <bitfield caption="Distributed Acknowledge" mask="0x40000000" name="DA30"/>
          <bitfield caption="Distributed Acknowledge" mask="0x80000000" name="DA31"/>
        </register>
        <register caption="SpW Link 1 Distributed Interrupt Acknowledge Mask" name="SPW_LINK1_DISTACKIM" offset="0x470" rw="RW" size="4">
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000001" name="DA0"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000002" name="DA1"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000004" name="DA2"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000008" name="DA3"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000010" name="DA4"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000020" name="DA5"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000040" name="DA6"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000080" name="DA7"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000100" name="DA8"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000200" name="DA9"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000400" name="DA10"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00000800" name="DA11"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00001000" name="DA12"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00002000" name="DA13"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00004000" name="DA14"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00008000" name="DA15"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00010000" name="DA16"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00020000" name="DA17"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00040000" name="DA18"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00080000" name="DA19"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00100000" name="DA20"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00200000" name="DA21"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00400000" name="DA22"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x00800000" name="DA23"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x01000000" name="DA24"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x02000000" name="DA25"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x04000000" name="DA26"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x08000000" name="DA27"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x10000000" name="DA28"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x20000000" name="DA29"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x40000000" name="DA30"/>
          <bitfield caption="Distributed Acknowledge mask" mask="0x80000000" name="DA31"/>
        </register>
        <register caption="SpW Link 1 Distributed Interrupt Acknowledge Clear Pending Interrupt" name="SPW_LINK1_DISTACKPI_C" offset="0x474" rw="W" size="4">
          <bitfield caption="Distributed Acknowledge" mask="0x00000001" name="DA0"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000002" name="DA1"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000004" name="DA2"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000008" name="DA3"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000010" name="DA4"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000020" name="DA5"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000040" name="DA6"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000080" name="DA7"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000100" name="DA8"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000200" name="DA9"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000400" name="DA10"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00000800" name="DA11"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00001000" name="DA12"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00002000" name="DA13"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00004000" name="DA14"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00008000" name="DA15"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00010000" name="DA16"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00020000" name="DA17"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00040000" name="DA18"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00080000" name="DA19"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00100000" name="DA20"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00200000" name="DA21"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00400000" name="DA22"/>
          <bitfield caption="Distributed Acknowledge" mask="0x00800000" name="DA23"/>
          <bitfield caption="Distributed Acknowledge" mask="0x01000000" name="DA24"/>
          <bitfield caption="Distributed Acknowledge" mask="0x02000000" name="DA25"/>
          <bitfield caption="Distributed Acknowledge" mask="0x04000000" name="DA26"/>
          <bitfield caption="Distributed Acknowledge" mask="0x08000000" name="DA27"/>
          <bitfield caption="Distributed Acknowledge" mask="0x10000000" name="DA28"/>
          <bitfield caption="Distributed Acknowledge" mask="0x20000000" name="DA29"/>
          <bitfield caption="Distributed Acknowledge" mask="0x40000000" name="DA30"/>
          <bitfield caption="Distributed Acknowledge" mask="0x80000000" name="DA31"/>
        </register>
