Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
        <register caption="PktTx Pending Read, Clear and Enabled Interrupt" name="SPW_PKTTX1_PI_RCS" offset="0xC0C" rw="RW" size="4">
          <bitfield caption="Deactivated" mask="0x00000001" name="DEACT"/>
          <bitfield caption="Activated" mask="0x00000002" name="ACT"/>
          <bitfield caption="EOP sent" mask="0x00000004" name="EOP"/>
          <bitfield caption="EEP sent" mask="0x00000008" name="EEP"/>
        </register>
        <register caption="PktTx Interrupt Mask" name="SPW_PKTTX1_IM" offset="0xC10" rw="RW" size="4">
          <bitfield caption="Deactivated" mask="0x00000001" name="DEACT"/>
          <bitfield caption="Activated" mask="0x00000002" name="ACT"/>
          <bitfield caption="EOP sent" mask="0x00000004" name="EOP"/>
          <bitfield caption="EEP sent" mask="0x00000008" name="EEP"/>
        </register>
        <register caption="PktTx Clear Pending Interrupt" name="SPW_PKTTX1_PI_C" offset="0xC14" rw="W" size="4">
          <bitfield caption="Deactivated" mask="0x00000001" name="DEACT"/>
          <bitfield caption="Activated" mask="0x00000002" name="ACT"/>
          <bitfield caption="EOP sent" mask="0x00000004" name="EOP"/>
          <bitfield caption="EEP sent" mask="0x00000008" name="EEP"/>
        </register>
        <register caption="PktTx Interrupt Set Mask" name="SPW_PKTTX1_IM_S" offset="0xC18" rw="W" size="4">
          <bitfield caption="Deactivated" mask="0x00000001" name="DEACT"/>
          <bitfield caption="Activated" mask="0x00000002" name="ACT"/>
          <bitfield caption="EOP sent" mask="0x00000004" name="EOP"/>
          <bitfield caption="EEP sent" mask="0x00000008" name="EEP"/>
        </register>
        <register caption="PktTx Interrupt Clear Mask" name="SPW_PKTTX1_IM_C" offset="0xC1C" rw="W" size="4">
          <bitfield caption="Deactivated" mask="0x00000001" name="DEACT"/>
          <bitfield caption="Activated" mask="0x00000002" name="ACT"/>
          <bitfield caption="EOP sent" mask="0x00000004" name="EOP"/>
          <bitfield caption="EEP sent" mask="0x00000008" name="EEP"/>
        </register>
        <register caption="PktTx Status" name="SPW_PKTTX1_STATUS" offset="0xC20" rw="RW" size="4">
          <bitfield caption="Armed" mask="0x00000001" name="ARM"/>
          <bitfield caption="Active" mask="0x00000002" name="ACT"/>
          <bitfield caption="Pending" mask="0x00000004" name="PENDING"/>
          <bitfield caption="Deactivating" mask="0x00000008" name="DEACT"/>
          <bitfield caption="Previous" mask="0x00070000" name="PREV" values="SPW_PKTTX1_STATUS__PREV"/>
        </register>
        <register caption="PktTx Next Send List Router Bytes" name="SPW_PKTTX1_NXTSENDROUT" offset="0xC24" rw="RW" size="4">
          <bitfield caption="Byte4" mask="0x000000FF" name="BYTE4"/>
          <bitfield caption="Byte3" mask="0x0000FF00" name="BYTE3"/>
          <bitfield caption="Byte2" mask="0x00FF0000" name="BYTE2"/>
          <bitfield caption="Byte1" mask="0xFF000000" name="BYTE1"/>
        </register>
        <register caption="PktTx Next Send List Address" name="SPW_PKTTX1_NXTSENDADDR" offset="0xC28" rw="RW" size="4">
          <bitfield caption="Address" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="PktTx Next Send List Config" name="SPW_PKTTX1_NXTSENDCFG" offset="0xC2C" rw="RW" size="4">
          <bitfield caption="Length" mask="0x0000FFFF" name="LEN"/>
          <bitfield caption="Start Value" mask="0x003F0000" name="VALUE"/>
          <bitfield caption="Start Mode" mask="0x00C00000" name="START" values="SPW_PKTTX1_NXTSENDCFG__START"/>
          <bitfield caption="Abort" mask="0x20000000" name="ABORT"/>
        </register>
        <register caption="PktTx Current Send List Router Bytes" name="SPW_PKTTX1_CURSENDROUT" offset="0xC30" rw="R" size="4">
          <bitfield caption="Byte4" mask="0x000000FF" name="BYTE4"/>
          <bitfield caption="Byte3" mask="0x0000FF00" name="BYTE3"/>
          <bitfield caption="Byte2" mask="0x00FF0000" name="BYTE2"/>
          <bitfield caption="Byte1" mask="0xFF000000" name="BYTE1"/>
        </register>
        <register caption="PktTx Current Send List Address" name="SPW_PKTTX1_CURSENDADDR" offset="0xC34" rw="R" size="4">
          <bitfield caption="Address" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="PktTx Current Send List Config" name="SPW_PKTTX1_CURSENDCFG" offset="0xC38" rw="RW" size="4">
          <bitfield caption="Length" mask="0x0000FFFF" name="LEN"/>
          <bitfield caption="Abort" mask="0x80000000" name="ABORT"/>
        </register>
        <register caption="PktTx Software Reset" name="SPW_PKTTX1_SWRESET" offset="0xC3C" rw="RW" size="4">
          <bitfield caption="Pattern" mask="0xFFFFFFFF" name="PATTERN"/>
        </register>
        <register caption="SpW RMAP 1 Config" name="SPW_RMAP1_CFG" offset="0x00000E00" rw="RW" size="4">
          <bitfield caption="DestKey" mask="0x000000FF" name="DESTKEY"/>
          <bitfield caption="Address" mask="0x0000FF00" name="TLA"/>
          <bitfield caption="RMAP Enable" mask="0x00010000" name="RMAPENA"/>
        </register>
        <register caption="SpW RMAP 1 Read and Clear Status" name="SPW_RMAP1_STS_RC" offset="0x00000E04" rw="R" size="4">
          <bitfield caption="Error Code" mask="0x000000FF" name="ERRCODE" values="SPW_RMAP1_STS_RC__ERRCODE"/>
          <bitfield caption="Valid" mask="0x00000100" name="VALID"/>
        </register>
        <register caption="SpW RMAP 1 Read Status" name="SPW_RMAP1_STS" offset="0x00000E08" rw="R" size="4">
          <bitfield caption="Error Code" mask="0x000000FF" name="ERRCODE" values="SPW_RMAP1_STS__ERRCODE"/>
          <bitfield caption="Valid" mask="0x00000100" name="VALID"/>
        </register>
        <register caption="SpW Tch Pending Read Masked Interrupt" name="SPW_TCH_PI_RM" offset="0x00000E80" rw="R" size="4">
          <bitfield caption="TcEvent" mask="0x00000001" name="TCEVENT"/>
          <bitfield caption="Time Code" mask="0x00000002" name="TIMECODE"/>
          <bitfield caption="Any Time Code" mask="0x00000004" name="ANYTIMECODE"/>
          <bitfield caption="Late Watchdog" mask="0x00000008" name="LATEWD"/>
          <bitfield caption="Early Watchdog" mask="0x00000010" name="EARLYWD"/>
        </register>
        <register caption="SpW Tch Pending Read and Clear Masked Interrupt" name="SPW_TCH_PI_RCM" offset="0x00000E84" rw="R" size="4">
          <bitfield caption="TcEvent" mask="0x00000001" name="TCEVENT"/>
          <bitfield caption="Time Code" mask="0x00000002" name="TIMECODE"/>
          <bitfield caption="Any Time Code" mask="0x00000004" name="ANYTIMECODE"/>
          <bitfield caption="Late Watchdog" mask="0x00000008" name="LATEWD"/>
          <bitfield caption="Early Watchdog" mask="0x00000010" name="EARLYWD"/>
        </register>
        <register caption="SpW Tch Pending Read Interrupt" name="SPW_TCH_PI_R" offset="0x00000E88" rw="R" size="4">
          <bitfield caption="TcEvent" mask="0x00000001" name="TCEVENT"/>
          <bitfield caption="Time Code" mask="0x00000002" name="TIMECODE"/>
          <bitfield caption="Any Time Code" mask="0x00000004" name="ANYTIMECODE"/>
          <bitfield caption="Late Watchdog" mask="0x00000008" name="LATEWD"/>
          <bitfield caption="Early Watchdog" mask="0x00000010" name="EARLYWD"/>
        </register>
        <register caption="SpW Tch Pending Read, Clear and Enabled Interrupt" name="SPW_TCH_PI_RCS" offset="0x00000E8C" rw="RW" size="4">
          <bitfield caption="TcEvent" mask="0x00000001" name="TCEVENT"/>
          <bitfield caption="Time Code" mask="0x00000002" name="TIMECODE"/>
          <bitfield caption="Any Time Code" mask="0x00000004" name="ANYTIMECODE"/>
          <bitfield caption="Late Watchdog" mask="0x00000008" name="LATEWD"/>
          <bitfield caption="Early Watchdog" mask="0x00000010" name="EARLYWD"/>
        </register>
        <register caption="SpW Tch Interrupt Mask" name="SPW_TCH_IM" offset="0x00000E90" rw="RW" size="4">
          <bitfield caption="TcEvent" mask="0x00000001" name="TCEVENT"/>
          <bitfield caption="Time Code" mask="0x00000002" name="TIMECODE"/>
          <bitfield caption="Any Time Code" mask="0x00000004" name="ANYTIMECODE"/>
          <bitfield caption="Late Watchdog" mask="0x00000008" name="LATEWD"/>
          <bitfield caption="Early Watchdog" mask="0x00000010" name="EARLYWD"/>
        </register>
        <register caption="SpW Tch Clear Pending Interrupt" name="SPW_TCH_PI_C" offset="0x00000E94" rw="W" size="4">
          <bitfield caption="TcEvent" mask="0x00000001" name="TCEVENT"/>
          <bitfield caption="Time Code" mask="0x00000002" name="TIMECODE"/>
          <bitfield caption="Any Time Code" mask="0x00000004" name="ANYTIMECODE"/>
          <bitfield caption="Late Watchdog" mask="0x00000008" name="LATEWD"/>
          <bitfield caption="Early Watchdog" mask="0x00000010" name="EARLYWD"/>
        </register>
        <register caption="SpW Tch Interrupt Set Mask" name="SPW_TCH_IM_S" offset="0x00000E98" rw="W" size="4">
          <bitfield caption="TcEvent" mask="0x00000001" name="TCEVENT"/>
          <bitfield caption="Time Code" mask="0x00000002" name="TIMECODE"/>
          <bitfield caption="Any Time Code" mask="0x00000004" name="ANYTIMECODE"/>
          <bitfield caption="Late Watchdog" mask="0x00000008" name="LATEWD"/>
          <bitfield caption="Early Watchdog" mask="0x00000010" name="EARLYWD"/>
        </register>
        <register caption="SpW Tch Interrupt Clear Mask" name="SPW_TCH_IM_C" offset="0x00000E9C" rw="W" size="4">
          <bitfield caption="TcEvent" mask="0x00000001" name="TCEVENT"/>
          <bitfield caption="Time Code" mask="0x00000002" name="TIMECODE"/>
          <bitfield caption="Any Time Code" mask="0x00000004" name="ANYTIMECODE"/>
          <bitfield caption="Late Watchdog" mask="0x00000008" name="LATEWD"/>
          <bitfield caption="Early Watchdog" mask="0x00000010" name="EARLYWD"/>
        </register>
        <register caption="SpW Tch Config Listener" name="SPW_TCH_CFGLISTEN" offset="0x00000EA0" rw="RW" size="4">
          <bitfield caption="Listen  link 1" mask="0x00000001" name="L1"/>
          <bitfield caption="Listen link 2" mask="0x00000002" name="L2"/>
        </register>
