Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/1.1.67/atdf/ATSAMRH71F20B.atdf
      <value-group caption="RC Compare Effect on TIOAx" name="TC_CMR0__ACPC">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="External Event Effect on TIOAx" name="TC_CMR0__AEEVT">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="Software Trigger Effect on TIOAx" name="TC_CMR0__ASWTRG">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="RB Compare Effect on TIOBx" name="TC_CMR0__BCPB">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="RC Compare Effect on TIOBx" name="TC_CMR0__BCPC">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="External Event Effect on TIOBx" name="TC_CMR0__BEEVT">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="Software Trigger Effect on TIOBx" name="TC_CMR0__BSWTRG">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="Trigger Source for Input A" name="TC_EMR0__TRIGSRCA">
        <value caption="The trigger/capture input A is driven by external pin TIOAx" name="EXTERNAL_TIOAx" value="0"/>
        <value caption="The trigger/capture input A is driven internally by PWMx" name="PWMx" value="1"/>
      </value-group>
      <value-group caption="Trigger Source for Input B" name="TC_EMR0__TRIGSRCB">
        <value caption="The trigger/capture input B is driven by external pin TIOBx" name="EXTERNAL_TIOBx" value="0"/>
        <value caption="For TC0 to TC10: The trigger/capture input B is driven internally by the comparator output (see Figure 7-16) of the PWMx.For TC11: The trigger/capture input B is driven internally by the GTSUCOMP signal of the Ethernet MAC (GMAC)." name="PWMx" value="1"/>
      </value-group>
      <value-group caption="External Clock Signal 0 Selection" name="TC_BMR__TC0XC0S">
        <value caption="Signal connected to XC0: TCLK0" name="TCLK0" value="0x0"/>
        <value caption="Signal connected to XC0: TIOA1" name="TIOA1" value="0x2"/>
        <value caption="Signal connected to XC0: TIOA2" name="TIOA2" value="0x3"/>
      </value-group>
      <value-group caption="External Clock Signal 1 Selection" name="TC_BMR__TC1XC1S">
        <value caption="Signal connected to XC1: TCLK1" name="TCLK1" value="0x0"/>
        <value caption="Signal connected to XC1: TIOA0" name="TIOA0" value="0x2"/>
        <value caption="Signal connected to XC1: TIOA2" name="TIOA2" value="0x3"/>
      </value-group>
      <value-group caption="External Clock Signal 2 Selection" name="TC_BMR__TC2XC2S">
        <value caption="Signal connected to XC2: TCLK2" name="TCLK2" value="0x0"/>
        <value caption="Signal connected to XC2: TIOA0" name="TIOA0" value="0x2"/>
        <value caption="Signal connected to XC2: TIOA1" name="TIOA1" value="0x3"/>
      </value-group>
      <value-group caption="Write Protection Key" name="TC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x54494D"/>
      </value-group>
    </module>
    <module name="TCMECC" caption="HECC" id="44125" version="A">
      <register-group name="TCMECC">
        <register caption="TCMECC Control Register" name="TCMECC_CR" offset="0x0" rw="RW" size="4">
          <bitfield caption="ECC protection enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="test mode of ECC protection - read mode" mask="0x00000002" name="TEST_MODE_RD"/>
          <bitfield caption="test mode of ECC protection - write mode" mask="0x00000004" name="TEST_MODE_WR"/>
          <bitfield caption="reset the fixable error counter" mask="0x00000010" name="RST_FIX_CPT"/>
          <bitfield caption="reset the un-fixable error counter" mask="0x00000020" name="RST_NOFIX_CPT"/>
        </register>
        <register caption="TCMECC Test mode register 1" name="TCMECC_TESTCB1" offset="0x4" rw="RW" size="4">
          <bitfield caption="test check bit (8 bit)" mask="0x000000FF" name="TCB1"/>
          <bitfield caption="test check bit (8 bit)" mask="0x0000FF00" name="TCB2"/>
        </register>
        <register caption="TCMECC Status register" name="TCMECC_SR" offset="0xC" rw="R" size="4">
          <bitfield caption="Fixable error status in instruction memory" mask="0x00000001" name="MEM_FIX_I"/>
          <bitfield caption="Fixable error status in data memory" mask="0x00000002" name="MEM_FIX_D"/>
          <bitfield caption="5 bits counter" mask="0x0000007C" name="CPT_FIX"/>
          <bitfield caption="counter overflow" mask="0x00000080" name="OVER_FIX"/>
          <bitfield caption="Un-fixable error status in instruction memory" mask="0x00000100" name="MEM_NOFIX_I"/>
          <bitfield caption="Un-fixable error status in data memory" mask="0x00000200" name="MEM_NOFIX_D"/>
          <bitfield caption="5 bits counter" mask="0x00007C00" name="CPT_NOFIX"/>
          <bitfield caption="counter overflow" mask="0x00008000" name="OVER_NOFIX"/>
          <bitfield caption="Hardware Error Size" mask="0x07000000" name="HES"/>
          <bitfield caption="one" mask="0x08000000" name="ONE"/>
          <bitfield caption="memory identification number" mask="0x10000000" name="MEM_ID_I"/>
          <bitfield caption="memory identification number" mask="0x20000000" name="MEM_ID_D"/>
        </register>
        <register caption="TCMECC Interrupt Enable Register" name="TCMECC_IER" offset="0x10" rw="W" size="4">
          <bitfield caption="Fixable error on instruction" mask="0x00000001" name="MEM_FIX_I"/>
          <bitfield caption="Un-fixable error on instruction" mask="0x00000002" name="MEM_NOFIX_I"/>
          <bitfield caption="Fixable error on data" mask="0x00000004" name="MEM_FIX_D"/>
          <bitfield caption="Un-fixable error on data" mask="0x00000008" name="MEM_NOFIX_D"/>
        </register>
        <register caption="TCMECC Interrupt Disable Register" name="TCMECC_IDR" offset="0x14" rw="W" size="4">
          <bitfield caption="fixable error on instruction" mask="0x00000001" name="MEM_FIX_I"/>
          <bitfield caption="un-fixable error on instruction" mask="0x00000002" name="MEM_NOFIX_I"/>
          <bitfield caption="fixable error on data" mask="0x00000004" name="MEM_FIX_D"/>
          <bitfield caption="un-fixable error on data" mask="0x00000008" name="MEM_NOFIX_D"/>
        </register>
        <register caption="TCMECC Interrupt Mask Register" name="TCMECC_IMR" offset="0x18" rw="R" size="4">
          <bitfield caption="fixable error on instruction" mask="0x00000001" name="MEM_FIX_I"/>
          <bitfield caption="un-fixable error on instruction" mask="0x00000002" name="MEM_NOFIX_I"/>
          <bitfield caption="fixable error on data" mask="0x00000004" name="MEM_FIX_D"/>
          <bitfield caption="un-fixable error on data" mask="0x00000008" name="MEM_NOFIX_D"/>
        </register>
